Repository: jasp-stats/jaspMachineLearning
Catalog: po/QML-*.po
Languages: de, es, gl, id, nl, pt, ru, ta

# FeatureImportance|
source: Permutations
de: Permutationen
es: Permutaciones
gl: Permutacións
id: Permutasi,
pt: Permutações
ta: வரிசைமாற்றங்கள்

# FeatureImportance|
source: Sets the number of permutations on which the mean dropout loss is based.
es: Establece el número de permutaciones en las que se basa la pérdida media por abandono.
gl: Establece o número de permutacións nas que se basa a perda media por abandono.
id: Mengatur jumlah permutasi yang menjadi dasar rata-rata kehilangan.
pt: Define o número de permutações nas quais a perda média de abandono é baseada.
ta: சராசரி கைவிடுதல் இழப்பு அடிப்படையாகக் கொண்ட வரிசைமாற்றங்களின் எண்ணிக்கையை அமைக்கிறது.

# Description|
source: Model-Based
es: Basado en el modelo
gl: Baseado no modelo
pt: Baseado no Modelo
ta: மாதிரி அடிப்படையிலான

# Description|
source: Model-Based Clustering
es: Conglomeración basada en el Modelo
gl: Conglomeración baseada no Modelo
pt: Agrupamento Baseado no Modelo
ta: மாதிரி அடிப்படையிலான கிளச்டரிங்

# ClusterMatrix|
source: Display components
es: Representar las componentes
gl: Representar as compoñentes
pt: Exibir compopnentes
ta: கூறுகளைக் காண்பி

# mlClusteringModelBased|
source: Model-based clustering is based on parameterized finite Gaussian mixture models. The models are estimated by EM algorithm initialized by hierarchical model-based agglomerative clustering.
es: La conglomeración basada en modelos se fundamenta en modelos mixturados Gaussianos finitos con parámetros. Los modelos se estiman con el algoritmo ME (EM) que se inicia mediante la conglomeración jerárquica acumulativa basada en modelos.
gl: A conglomeración baseada en modelos se fundamenta en modelos mesturados Gaussianos finitos con parámetros. Os modelos estímanse co algoritmo ME (EM) que se inicia mediante a conglomeración xerárquica acumulativa baseada en modelos.
pt: O agrupamento baseado em modelos é baseado em modelos de mistura gaussiana finita parametrizados. Os modelos são estimados pelo algoritmo EM inicializado por agrupamento aglomerativo baseado em modelos hierárquicos.
ta: மாதிரி அடிப்படையிலான கிளச்டரிங் அளவுருவாக்கப்பட்ட வரையறுக்கப்பட்ட காசியன் கலவை மாதிரிகளை அடிப்படையாகக் கொண்டது. மாதிரிகள் படிநிலை மாதிரி அடிப்படையிலான திரட்டல் கிளச்டரிங் மூலம் துவக்கப்படும் ஈ.எம் வழிமுறை மூலம் மதிப்பிடப்படுகின்றன.

# mlClusteringModelBased|
source: Tables
es: Tablas
gl: Táboas
pt: Tabelas
ru: Таблицы
ta: அட்டவணைகள்

# mlClusteringModelBased|
source: Parameter estimates
es: Estimaciones de parámetros
gl: Estimacións dos parámetros
pt: Estimativas dos parâmetros
ta: அளவுரு மதிப்பீடுகள்

# mlClusteringModelBased|
source: Shows tables containing the model parameters for each cluster and feature variable.
es: Muestra las tablas que contienen los parámetros del modelo para cada conglomerado y variable característica.
gl: Amosa as táboas que conteñen os parámetros do modelo para cada conglomerado e variable característica.
pt: Mostra tabelas contendo os parâmetros do modelo para cada agrupamento e a variável de característica.
ta: ஒவ்வொரு கிளச்டர் மற்றும் அம்ச மாறிக்கான மாதிரி அளவுருக்களைக் கொண்ட அட்டவணைகளைக் காட்டுகிறது.

# mlClusteringModelBased|
source: Plots
es: Gráficos
gl: Gráficas
pt: Gráficos
ru: Графики
ta: அடுக்கு

# mlClusteringModelBased|
source: Training Parameters
es: Parámetros de adiestramiento
gl: Parámetros de ensaio
pt: Parâmetros de Treinamento
ru: Гиперпараметры модели
ta: பயிற்சி அளவுருக்கள்

# mlClusteringModelBased|
source: Algorithmic Settings
es: Configuraciones Algorítmicas
gl: Configuracións Algorítmicas
pt: Configurações do Algoritmo
ru: Настройки алгоритма
ta: வழிமுறை அமைப்புகள்

# mlClusteringModelBased|
source: Model
es: Modelo
gl: Modelo
pt: Modelo
ta: மாதிரியுரு

# mlClusteringModelBased|
source: Auto
ta: தானி

# mlClusteringModelBased|
source: EEI
ta: Ei

# mlClusteringModelBased|
source: VEI
ta: நீங்கள்

# mlClusteringModelBased|
source: EVI
ta: ஈவி

# mlClusteringModelBased|
source: VEE
ta: வீ

# mlClusteringModelBased|
source: EVE
ta: ஈவ்

# mlClusteringModelBased|
source: EEV
ta: ஈவ்

# mlClusteringModelBased|
source: VEV
ta: வலைத்தளம்

# mlClusteringModelBased|
source: EVV
ta: ஈ.வி.வி.

# mlClusteringModelBased|
source: VVV
ta: வி.வி.வி.

# mlClusteringModelBased|
source: Choose the model to be fitted in the EM step of the clustering.
es: Elige el modelo que se ajustará en la etapa del ME (EM) de la conglomeración.
gl: Escolle o modelo que se axustará na etapa do ME (EM) da conglomeración.
pt: Escolha o modelo a ser ajustado na etapa EM do agrupamento.
ta: கிளச்டரிங்கின் எம் படியில் பொருத்தப்பட வேண்டிய மாதிரியைத் தேர்வுசெய்க.

# mlClusteringModelBased|
source: Max. iterations
es: Máx. iteraciones
gl: Máx. iteracións
pt: Máx. iterações
ta: அதிகபட்சம். மறு செய்கைகள்

# mlClusteringModelBased|
source: The maximum number of iterations for the M-step in the algorithm.
es: El número máximo de iteraciones para la etapa M del algoritmo.
gl: O número máximo de iteracións para a etapa M do algoritmo.
pt: O número máximo de iterações para o passo M no algoritmo.
ta: வழிமுறையில் எம்-ச்டெப்பிற்கான அதிகபட்ச மறு செய்கைகள்.

# mlPrediction|
source: Predictions for new data
es: Predicciones para datos nuevos
gl: Predicións para datos novos
pt: Previsões para novos dados
ru: Предсказания для новых данных
ta: புதிய தரவுகளுக்கான கணிப்புகள்

# ConfusionMatrix|
source: Transpose matrix
es: Transponer matriz
gl: Traspoñer matriz
pt: Transpor matriz
ta: டிரான்ச் மேட்ரிக்ச்

# ConfusionMatrix|
source: Transposes the confusion matrix.
es: Transpone la matriz de desorden.
gl: Traspón a matriz de desarranxo.
pt: Transpõe a matriz de confusão.
ta: குழப்ப மேட்ரிக்சை மாற்றுகிறது.

# ExplainPredictions|
source: Shows a decomposition of the predictions of the model into contributions that can be attributed to individual model features. This feature uses the breakdown algoritm from the `ibreakdown` R package. For more details about this method, see Gosiewska and Biecek (2019).
es: Muestra una descomposición de las predicciones del modelo, en contribuciones que pueden atribuirse a características individuales del modelo. Esta funcionalidad utiliza el algoritmo de descomposición del paquete `ibreakdown` de R. Para obtener más detalles sobre este método, consulta Gosiewska y Biecek (2019).
gl: Amosa unha descomposición das predicións do modelo en contribucións que poden atribuírse a características individuais do modelo. Esta funcionalidade utiliza o algoritmo de descomposición do paquete `ibreakdown` de R. Para obter máis detalles sobre este método, consulta Gosiewska e Biecek (2019).
pt: Apresenta uma decomposição das previsões do modelo em contribuições que podem ser atribuídas a características individuais do modelo. Esta característica utiliza o algoritmo de decomposição do pacote `ibreakdown` do R. Para mais detalhes sobre este método, consulte Gosiewska e Biecek (2019).
ta: தனிப்பட்ட மாதிரி அம்சங்களுக்குக் கூறக்கூடிய பங்களிப்புகளாக மாதிரியின் கணிப்புகளின் சிதைவைக் காட்டுகிறது. இந்த நற்பொருத்தம் `ibreakdown` r தொகுப்பிலிருந்து முறிவு அல்கோரிட்மைப் பயன்படுத்துகிறது. இந்த முறையைப் பற்றிய கூடுதல் விவரங்களுக்கு, கோசீவ்ச்கா மற்றும் பயிசெக் (2019) ஐப் பார்க்கவும்.

# DataSplit|
source: e.g., testSet
es: p.e. testSet
gl: p.e. testSet
ta: எ.கா., டெச்ட்செட்

# Description|
source: Logistic / Multinomial
es: Logística / Multinomial
gl: Loxística / Multinomial
pt: Logístico / Multinomial
ta: லாசிச்டிக் / பன்முக

# Description|
source: Logistic / Multinomial Regression Classification
es: Clasificación de la Regresión Logística/Multinomial
gl: Clasificación da Regresión Loxística/Multinomial
pt: Classificação de Regressão Logística / Multinomial
ta: லாசிச்டிக் / பன்முக பின்னடைவு வகைப்பாடு

# mlClassificationLogisticMultinomial|
source: Logistic regression is a statistical method used to model the relationship between a binary target variable (with two possible outcomes) and one or more feature variables. It predicts the probability of a specific outcome by using a logistic function, which ensures that the predicted probabilities are between 0 and 1. Multinomial regression extends logistic regression to handle target variables with more than two categories. Instead of predicting binary outcomes, multinomial regression is used for scenarios where the target variable has three or more unordered categories.
es: La regresión logística es un método estadístico utilizado para modelizar la relación entre una variable objetivo binaria (con dos resultados posibles) y una o más variables características. Predice la probabilidad de un resultado específico utilizando una función logística, que garantiza que las probabilidades predichas estén entre 0 y 1. La regresión multinomial amplía la regresión logística para manejar variables objetivo con más de dos categorías. En lugar de predecir resultados binarios, la regresión multinomial se utiliza para escenarios en los que la variable objetivo tiene tres o más categorías no ordenadas.
gl: A regresión loxística é un método estatístico usado para modelar a relación entre unha variable obxectivo binaria (con dous posibles resultados) e unha ou máis variables características. Predí a probabilidade dun resultado concreto utilizando unha función loxística, que garante que as probabilidades preditas estean entre 0 e 1. A regresión multinomial estende a regresión loxística para manexar variables obxectivo con máis de dúas categorías. En troques de predicir resultados de tipo binario, a regresión multinomial utilízase para escenarios nos que a variable obxectivo ten tres ou máis categorías non ordenadas.
pt: A regressão logística é um método estatístico usado para modelar a relação entre uma variável alvo binária (com dois resultados possíveis) e uma ou mais variáveis de características. Ela prevê a probabilidade de um resultado específico usando uma função logística, o que garante que as probabilidades previstas estejam entre 0 e 1. A regressão multinomial estende a regressão logística para lidar com variáveis alvo com mais de duas categorias. Em vez de prever resultados binários, a regressão multinomial é usada para cenários em que a variável alvo possui três ou mais categorias não ordenadas.
ta: லாசிச்டிக் பின்னடைவு என்பது ஒரு பைனரி இலக்கு மாறி (இரண்டு சாத்தியமான விளைவுகளுடன்) மற்றும் ஒன்று அல்லது அதற்கு மேற்பட்ட அம்ச மாறிகள் ஆகியவற்றுக்கு இடையிலான உறவை மாதிரியாகப் பயன்படுத்தப் பயன்படுத்தப்படும் ஒரு புள்ளிவிவர முறையாகும். ஒரு லாசிச்டிக் செயல்பாட்டைப் பயன்படுத்துவதன் மூலம் ஒரு குறிப்பிட்ட முடிவின் நிகழ்தகவை இது கணிக்கிறது, இது கணிக்கப்பட்ட நிகழ்தகவுகள் 0 முதல் 1 வரை இருப்பதை உறுதி செய்கிறது. பல்லினோமியல் பின்னடைவு இரண்டு வகைகளுக்கு மேல் இலக்கு மாறிகளைக் கையாள லாசிச்டிக் பின்னடைவை விரிவுபடுத்துகிறது. பைனரி விளைவுகளை முன்னறிவிப்பதற்கு பதிலாக, இலக்கு மாறி மூன்று அல்லது அதற்கு மேற்பட்ட வரிசைப்படுத்தப்படாத வகைகளைக் கொண்ட காட்சிகளுக்கு பன்முக பின்னடைவு பயன்படுத்தப்படுகிறது.

# mlClassificationLogisticMultinomial|
source: Tables
es: Tablas
gl: Táboas
pt: Tabelas
ta: அட்டவணைகள்

# mlClassificationLogisticMultinomial|
source: Plots
es: Gráficos
gl: Gráficas
pt: Gráficos
ta: அடுக்கு

# mlClassificationLogisticMultinomial|
source: Training Parameters
es: Parámetros de adiestramiento
gl: Parámetros de ensaio
pt: Parâmetros de Treinamento
ta: பயிற்சி அளவுருக்கள்

# mlClassificationLogisticMultinomial|
source: Algorithmic Settings
es: Configuraciones Algorítmicas
gl: Configuracións Algorítmicas
pt: Configurações do Algoritmo
ta: வழிமுறை அமைப்புகள்

# mlClassificationLogisticMultinomial|
source: Link function (for binary classification)
es: Función de enlace (para clasificación binaria)
gl: Función de enlace (para clasificación binaria)
pt: Função de ligação (para classificação binária)
ta: இணைப்பு செயல்பாடு (பைனரி வகைப்பாட்டிற்கு)

# mlClassificationLogisticMultinomial|
source: Logit
ta: உள்நுழைவு

# mlClassificationLogisticMultinomial|
source: Probit
ta: ஆய்வு

# mlClassificationLogisticMultinomial|
source: Cauchit
ta: க uch சிட்

# mlClassificationLogisticMultinomial|
source: Complimentary log-log
es: Log-log complementaria (CLOGLOG)
gl: Log-log complementaria (CLOGLOG)
pt: Log-log complementar
ta: பாராட்டு பதிவு-பதிவு

# mlClassificationLogisticMultinomial|
source: Log
ta: பதிவு

# mlPrediction|
source: The prediction analysis enables you to load a trained machine learning model and apply it to new data. It is important that the features in the new dataset have the same names as in the original dataset used for training.
es: El análisis de predicción te permite cargar un modelo ensayado de aprendizaje de máquina y aplicarlo a datos nuevos. Es importante que las características del nuevo conjunto de datos tengan los mismos nombres que en el conjunto original de datos utilizado en el ensayo.
pt: A análise de previsão permite carregar um modelo de aprendizado de máquina treinado e aplicá-lo a novos dados. É importante que os recursos no novo conjunto de dados tenham os mesmos nomes que os do conjunto de dados original usado para o treinamento.
ta: முன்கணிப்பு பகுப்பாய்வு பயிற்சி பெற்ற இயந்திர கற்றல் மாதிரியை ஏற்றவும் புதிய தரவுகளுக்குப் பயன்படுத்தவும் உங்களுக்கு உதவுகிறது. புதிய தரவுத்தொகுப்பில் உள்ள நற்பொருத்தங்கள் பயிற்சிக்கு பயன்படுத்தப்படும் அசல் தரவுத்தொகுப்பில் உள்ள அதே பெயர்களைக் கொண்டிருப்பது முதன்மை.

# DataSplit|
source: Use an indicator variable to select data for the test set. This indicator should be a column of type scale in your data that consists of only 0 (excluded from the test set) and 1 (included in the test set). The data will then be split into a training (and validation if requested) set (0), and a test set (1) according to your indicator.
pt: Use uma variável indicadora para selecionar dados para o conjunto de teste. Este indicador deve ser uma coluna do tipo escala nos seus dados, composta apenas por 0 (excluído do conjunto de teste) e 1 (incluído no conjunto de teste). Os dados serão então divididos em um conjunto de treinamento (e validação, se solicitado) (0) e um conjunto de teste (1), de acordo com o seu indicador.
ta: சோதனை தொகுப்பிற்கான தரவைத் தேர்ந்தெடுக்க ஒரு காட்டி மாறியைப் பயன்படுத்தவும். இந்த காட்டி உங்கள் தரவுகளில் வகை அளவின் நெடுவரிசையாக இருக்க வேண்டும், இது 0 (சோதனை தொகுப்பிலிருந்து விலக்கப்பட்டுள்ளது) மற்றும் 1 (சோதனை தொகுப்பில் சேர்க்கப்பட்டுள்ளது) மட்டுமே. தரவு பின்னர் உங்கள் குறிகாட்டியின் படி ஒரு பயிற்சியாக (மற்றும் கோரப்பட்டால் சரிபார்ப்பு) தொகுப்பு (0), மற்றும் ஒரு சோதனை தொகுப்பு (1) என பிரிக்கப்படும்.

# DataSplit|
source: Use an indicator variable to select data for the test set. This indicator should be a column in your data that consists of only 0 (excluded from the test set) and 1 (included in the test set). The data will then be split into a training (and validation if requested) set (0), and a test set (1) according to your indicator.
de: Nutzen Sie eine Indikatorvariable, um Daten für die Testmenge auszuwählen. Dieser Indikator sollte eine Spalte in Ihren Daten sein, die nur aus 0 (aus der Testmenge ausgeschlossen) und 1 (in der Testmenge enthalten) besteht. Die Daten werden dann nach Ihrem Indikator in eine Trainings- (und auf Wunsch Validierungs-) Menge (0) und eine Testmenge (1) aufgeteilt.
es: Utiliza una variable índice para seleccionar los datos para el conjunto de contraste. Este índice debe ser una columna de tus datos que contenga solo 0 (excluido del conjunto de contraste) y 1 (incluido en el conjunto de contraste). Entonces, los datos se van a separar en el conjunto (0) de adiestramiento (y validación cuando se solicite), y en el conjunto (1) de contraste de acuerdo con tu índice.
gl: Utiliza unha variable índice para seleccionar os datos para o conxunto de proba. Este índice debe ser unha columna dos teus datos que conteña só 0 (excluído do conxunto de proba) e 1 (incluído no conxunto de proba). Entón, os datos vanse separar no conxunto (0) de ensaio (e validación cando se solicite), e no conxunto (1) de proba de acordo co teu índice.
nl: Gebruik een indicatorvariabele om gegevens te selecteren voor de testset. Deze indicator moet een kolom in je gegevens zijn die alleen uit 0 (uitgesloten van de testset) en 1 (opgenomen in de testset) bestaat. De gegevens worden dan opgesplitst in een trainingsset (en validatieset indien gewenst) (0) en een testset (1) op basis van je indicator.

# ExportResults|
source: Add probabilities (classification only)
pt: Adicionar probabilidades (apenas classificação)

# ExportResults|
source: In classification analyses, append the predicted probabilities for each class to the data. For neural networks, this option provides the output of the final layer.
pt: Em análises de classificação, anexe as probabilidades previstas para cada classe aos dados. Para redes neurais, esta opção fornece a saída da camada final.

# Description|
source: Supervised Learning
pt: Aprendizado Supervisionado

# Description|
source: Unsupervised Learning
pt: Aprendizado Não Supervisionado

# ModelPerformance|
source: Displays available model performance metrics. For regression, these metrics include mean squared error (MSE), root mean squared error (RMSE), R<sup>2</sup> and more. For classification, these metrics include precision, recall, the F1-score, support, AUC (area under the ROC curve) and more. For clustering, these metrics include entropy, Dunn index and more.
pt: Exibe as métricas de desempenho do modelo disponíveis. Para regressão, essas métricas incluem erro quadrático médio (EQM), raiz quadrada do erro quadrático médio (RQEQM), R<sup>2</sup> e outras. Para classificação, essas métricas incluem precisão, revocação, pontuação F1, suporte, AUC (área sob a curva ROC) e outras. Para agrupamento, essas métricas incluem entropia, índice de Dunn e outras.

# mlPrediction|
source: The prediction analysis enables you to load a trained machine learning model and apply it to new data.
de: Mit der Prognose-Analyse können Sie ein trainiertes Maschinenlernmodell laden und auf neue Daten anwenden.
gl: A análise de predición te permite cargar un modelo de aprendizaxe de máquina ensaiado e aplicalo a novos datos.
nl: Met de voorspellingsanalyse kun je een getraind machine-learningmodel laden en toepassen op nieuwe gegevens.

# ExplainPredictions|
source: Shows a decomposition of the predictions of the model into contributions that can be attributed to individual model features.
de: Zeigt eine Aufteilung der Vorhersagen des Modells in Beiträge, die auf einzelne Modellmerkmale zurückgeführt werden können.
nl: Toont een ontbinding van de voorspellingen van het model in bijdragen die kunnen worden toegeschreven aan individuele kenmerken.

# AlgorithmicSettings|
source: Epanechnikov
ru: Епанечникова
