Repository: jasp-stats/jaspMachineLearning
Catalog: po/QML-*.po
Languages: de, es, gl, id, nl, pt, ru, ta

# mlRegressionDecisionTree|
source: Decision Trees is a supervised learning algorithm that uses a decision tree as a predictive model to go from observations about an item (represented in the roots of the tree) to conclusions about the item's target value (represented in the endpoints of the tree). ### Assumptions - The target variable is a continuous variable. - The feature variables consist of continuous, nominal, or ordinal variables.
de: Entscheidungsbäume sind ein überwachter Lernalgorithmus, der einen Entscheidungsbaum als Vorhersagemodell verwendet, um von Beobachtungen über ein Element (repräsentiert in den Wurzeln des Baums) zu Schlussfolgerungen über den Zielwert des Elements (repräsentiert in den Endpunkten des Baums) zu gelangen. ### Annahmen - Die Zielvariable ist eine kontinuierliche Variable. - Die Merkmalsvariablen bestehen aus kontinuierlichen, nominalen oder ordinalen Variablen.
es: Los Árboles de Decisión son un algoritmo de aprendizaje supervisado que utiliza un árbol de decisión como modelo predictivo para ir desde las observaciones sobre un elemento (representado por las raíces del árbol) hasta conclusiones sobre el valor del objetivo de los elementos (representado por los puntos finales del árbol). ### Supuestos - La variable objetivo es una variable continua. - Las variables de características consisten en variables continuas, nominales u ordinales.
gl: As Árbores de Decisión son un algoritmo de aprendizaxe supervisado que utiliza unha árbore de decisión como modelo preditivo para ir desde as observacións sobre un elemento (representado polas raíces da árbore) ata conclusións sobre o valor do obxectivo dos elementos (representado polos puntos finais da árbore). ### Supostos - A variable obxectivo é unha variable continua. - As variables de características consisten en variables continuas, nominais ou ordinais.
id: Decision Trees adalah algoritma pembelajaran terawasi yang menggunakan pohon keputusan sebagai model prediktif untuk beralih dari pengamatan tentang sebuah item (direpresentasikan di akar pohon) ke kesimpulan tentang nilai target item tersebut (direpresentasikan di titik akhir pohon). ### Asumsi - Variabel target adalah variabel kontinu. - Variabel fitur terdiri dari variabel kontinu, nominal, atau ordinal.
nl: Decision Trees is een algoritme voor leren onder toezicht dat een beslissingsboom gebruikt als een voorspellend model om van waarnemingen over een item (weergegeven in de wortels van de boom) naar conclusies over de doelwaarde van het item te gaan (weergegeven in de eindpunten van de boom). ### Aannames - De doelvariabele is een continue variabele. - De kenmerken bestaan uit continue, nominale of ordinale variabelen.
pt: Árvores de Decisão são um algoritmo de aprendizado supervisionado que utiliza uma árvore de decisão como modelo preditivo para partir de observações sobre um item (representadas nas raízes da árvore) até conclusões sobre o valor-alvo do item (representado nas extremidades da árvore). ### Suposições - A variável alvo é uma variável contínua. - As variáveis de característica consistem em variáveis contínuas, nominais ou ordinais.
ru: Деревья решений - это алгоритм, который через отраженную в корнях дерева комбинацию признаков наблюдения приходит к выводам об отраженном в листьях дерева значении целевой переменной для данного наблюдения. ### Допущения - Целевая переменная является непрерывной. - Признаки могут быть непрерывными, номинальными или порядковыми переменными.
ta: முடிவு மரங்கள் என்பது ஒரு மேற்பார்வையிடப்பட்ட கற்றல் வழிமுறையாகும், இது ஒரு முடிவை ஒரு முன்கணிப்பு மாதிரியாகப் பயன்படுத்துகிறது, இது ஒரு பொருளைப் பற்றிய அவதானிப்புகளிலிருந்து (மரத்தின் வேர்களில் குறிப்பிடப்படுகிறது) உருப்படியின் இலக்கு மதிப்பைப் பற்றிய முடிவுகளுக்கு (மரத்தின் இறுதிப் புள்ளிகளில் குறிப்பிடப்படுகிறது). ### அனுமானங்கள் - இலக்கு மாறி தொடர்ச்சியான மாறி. - அம்ச மாறிகள் தொடர்ச்சியான, பெயரளவு அல்லது சாதாரண மாறிகள் கொண்டவை.

# mlRegressionKnn|
source: K-nearest neighbors is a method of regression that looks at the *k* number of feature observations that are most similar to new observations to make a prediction for their values. The number of nearest neighbors is intrinsincly linked to model complexity, as small numbers increase the flexibility of the model. ### Assumptions - The target variable is a continuous variable. - The feature variables consist of continuous, nominal, or ordinal variables.
de: K-nächste-Nachbarn ist eine Regressionsmethode, die auf die *k* Anzahl von Merkmalsbeobachtungen schaut, die neuen Beobachtungen am ähnlichsten sind, um eine Vorhersage für deren Werte zu treffen. Die Anzahl der nächsten Nachbarn ist untrennbar mit der Komplexität des Modells verbunden, da eine kleine Anzahl die Flexibilität des Modells erhöht. ### Annahmen - Die Zielvariable ist eine kontinuierliche Variable. - Die Merkmalsvariablen bestehen aus kontinuierlichen, nominalen oder ordinalen Variablen.
es: El de los K Vecinos Más Cercanos es un método de regresión que examina el número *k* de observaciones características que son más parecidas a nuevas observaciones para hacer una predicción de sus valores. El número de vecinos más cercanos está vinculado intrínsecamente a la complejidad del modelo, puesto que números pequeños aumentan la flexibilidad del modelo. ### Supuestos - La variable objetivo es una variable continua. - Las variables de características consisten en variables continuas, nominales u ordinales.
gl: O dos K Veciños Máis Próximos é un método de regresión que examina o número *k* de observacións características que son máis semellantes a novas observacións para facer unha predición dos seus valores. O número de veciños máis próximos está vencellado intrinsecamente á complexidade do modelo, posto que números pequenos aumentan a flexibilidade do modelo. ### Supostos - A variable obxectivo é unha variable continua. - As variables de características consisten en variables continuas, nominais ou ordinais.
id: K-nearest neighbors adalah metode regresi yang melihat *k* jumlah pengamatan fitur yang paling mirip dengan pengamatan baru untuk membuat prediksi nilainya. Jumlah tetangga terdekat secara intrinsik terkait dengan kompleksitas model, karena jumlah yang kecil meningkatkan fleksibilitas model. ### Asumsi - Variabel target adalah variabel kontinu. - Variabel fitur terdiri dari variabel kontinu, nominal, atau ordinal.
nl: K-dichtsbijzijnde buren is een regressiemethode waarbij wordt gekeken naar het *k* aantal kenmerkwaarnemingen dat het meest lijkt op nieuwe waarnemingen om een voorspelling te doen voor hun waarden. Het aantal dichtstbijzijnde buren is nauw verbonden met de complexiteit van het model, omdat kleine aantallen de flexibiliteit van het model vergroten. ### Aannames - De doelvariabele is een continue variabele. - De kenmerken bestaan uit continue, nominale of ordinale variabelen.
pt: K-vizinhos mais próximos é um método de regressão que analisa o número *k* de observações de características que são mais semelhantes a novas observações para fazer uma previsão de seus valores. O número de vizinhos mais próximos está intrinsecamente ligado à complexidade do modelo, pois números pequenos aumentam a flexibilidade do modelo. ### Suposições - A variável-alvo é uma variável contínua. - As variáveis de características consistem em variáveis contínuas, nominais ou ordinais.
ru: К-ближайших соседей - это метод классификации, который ищет *k* размеченных наблюдений, наиболее близких к новым наблюдениям для того, чтобы сделать предсказание их класса. Количество ближайших соседей внутренне связано со сложностью модели, и маленькие его значения повышают гибкость. ### Допущения - Целевая переменная является непрерывной. - Признаки могут быть непрерывными, номинальными или порядковыми переменными.
ta: கே-நெரிசலான அண்டை நாடுகள் பின்னடைவின் ஒரு முறையாகும், இது * கே * அம்ச அவதானிப்புகளின் எண்ணிக்கையைப் பார்க்கிறது, அவை அவற்றின் மதிப்புகளுக்கு ஒரு கணிப்பைச் செய்ய புதிய அவதானிப்புகளுக்கு மிகவும் ஒத்தவை. சிறிய எண்கள் மாதிரியின் நெகிழ்வுத்தன்மையை அதிகரிப்பதால், அருகிலுள்ள அண்டை நாடுகளின் எண்ணிக்கை மாதிரி சிக்கலுடன் உள்ளார்ந்த முறையில் இணைக்கப்பட்டுள்ளது. ### அனுமானங்கள் - இலக்கு மாறி தொடர்ச்சியான மாறி. - அம்ச மாறிகள் தொடர்ச்சியான, பெயரளவு அல்லது சாதாரண மாறிகள் கொண்டவை.

# mlRegressionLinear|
source: Linear regression allows the user to model a linear relationship between one or more features (predictors) and a continuous dependent (target) variable.
de: Lineare Regression ermöglicht es dem Benutzer, eine lineare Beziehung zwischen einem oder mehreren Merkmalen (Prädiktoren) und einer kontinuierlichen abhängigen (Ziel-)Variable zu modellieren.
es: La regresión lineal permite al usuario modelar una relación lineal entre una o más características (predictores) y una variable dependiente continua (objetivo).
gl: A regresión linear permite ao usuario modelar unha relación linear entre unha ou máis características (preditores) e unha variable dependente continua (obxectivo).
id: Regresi linier memungkinkan pengguna untuk memodelkan hubungan linier antara satu atau lebih fitur (prediktor) dan variabel dependen (target) yang kontinu.
nl: Linear regressie laat de gebruiker een lineaire relatie modeleren tussen een of meer kenmerken en een continue afhankelijke variabele.
pt: A regressão linear permite ao usuário modelar uma relação linear entre um ou mais recursos (preditores) e uma variável dependente contínua (alvo).
ru: Линейная регрессия позволяет смоделировать линейную взаимосвязь между одним или несколькими признаками (предикторами) и непрерывной зависимой (целевой) переменной.
ta: நேரியல் பின்னடைவு ஒன்று அல்லது அதற்கு மேற்பட்ட நற்பொருத்தங்கள் (முன்னறிவிப்பாளர்கள்) மற்றும் தொடர்ச்சியான சார்பு (இலக்கு) மாறிக்கு இடையில் ஒரு நேரியல் உறவை வடிவமைக்க பயனரை அனுமதிக்கிறது.

# mlRegressionLinear|
source: Tables
de: Tabellen
es: Tablas
gl: Táboas
id: Tabel
nl: Tabellen
pt: Tabelas
ru: Таблицы
ta: அட்டவணைகள்

# mlRegressionLinear|
source: Plots
de: Diagramme
es: Gráficos
gl: Gráficas
id: Plot
nl: Grafieken
pt: Gráficos
ru: Графики
ta: அடுக்கு

# mlRegressionLinear|
source: Training Parameters
de: Trainingsparameter
es: Parámetros de adiestramiento
gl: Parámetros de ensaio
id: Parameter Pelatihan
pt: Parâmetros de treinamento
ru: Гиперпараметры модели
ta: பயிற்சி அளவுருக்கள்

# mlRegressionLinear|
source: Algorithmic Settings
de: Algorithmus-Einstellungen
es: Configuraciones Algorítmicas
gl: Configuracións Algorítmicas
id: Pengaturan Algoritmik
nl: Algoritmische Instellingen
pt: Configurações do algoritmo
ru: Настройки алгоритма
ta: வழிமுறை அமைப்புகள்

# mlRegressionNeuralNetwork|
source: Feedforward neural networks are predictive algorithms inspired by the biological neural networks that constitute brains. A neuron (node) that receives a signal then processes it and can send signals to neurons connected to it. The signal at a node is a real number, and the output of each node is computed by sending the signal trough the activation function. The number of layers and nodes in the network is intrinsincly linked to model complexity, as high numbers increase the flexibility of the model. ### Assumptions - The target variable is a continuous variable. - The feature variables consist of continuous.
de: Feedforward Neuronale Netze sind Vohersage-Algorithmen, die sich an biologischen neuronalen Netzen orientieren, aus denen Gehirne bestehen. Ein Neuron (Knoten), das ein Signal empfängt, verarbeitet dieses und kann Signale an mit ihm verbundene Neuronen senden. Das Signal eines Knotens ist eine reelle Zahl, und die Ausgabe eines jeden Knotens wird berechnet, indem das Signal durch die Aktivierungsfunktion geschickt wird. Die Anzahl der Schichten und Knoten im Netz ist untrennbar mit der Komplexität des Modells verbunden, da eine hohe Anzahl die Flexibilität des Modells erhöht. ### Annahmen - Die Zielvariable ist eine kontinuierliche Variable. - Die Merkmalsvariablen bestehen aus kontinuierlichen.
es: Las Redes Neuronales Feedforward son algoritmos predictivos inspirados en las redes neuronales biológicas que forman los cerebros. Una neurona (nodo) que recibe una señal, a continuación la procesa y puede enviar señales a neuronas conectadas con ella. La señal en un nodo es un número real, y el resultado de cada nodo se calcula enviando la señal a través de la función de activación. El número de estratos y nodos de la red está vinculado intrínsecamente a la complejidad del modelo, puesto que números grandes aumentan la flexibilidad del modelo. ### Supuestos - La variable objetivo es una variable continua. - Las variables de características consisten en variables continuas.
gl: As Redes Neuronais Feedforward son algoritmos preditivos inspirados nas redes neuronais biolóxicas que forman os cerebros. Unha neurona (nodo) que recibe un sinal, a continuación o procesa e pode enviar sinais a neuronas conectadas con ela. O sinal nun nodo é un número real, e o resultado de cada nodo calcúlase enviando o sinal a través da función de activación. O número de estratos e nodos da rede está vencellado intrinsecamente á complexidade do modelo, posto que números grandes aumentan a flexibilidade do modelo. ### Supostos - A variable obxectivo é unha variable continua. - As variables de características consisten en variables continuas.
id: Jaringan saraf feedforward adalah algoritme prediktif yang terinspirasi oleh jaringan saraf biologis yang membentuk otak. Sebuah neuron (simpul) yang menerima sinyal kemudian memprosesnya dan dapat mengirim sinyal ke neuron yang terhubung dengannya. Sinyal pada sebuah node adalah bilangan real, dan output dari setiap node dihitung dengan mengirimkan sinyal melalui fungsi aktivasi. Jumlah lapisan dan node dalam jaringan secara intrinsik terkait dengan kompleksitas model, karena jumlah yang tinggi meningkatkan fleksibilitas model. ### Asumsi-asumsi - Variabel target adalah variabel kontinu. - Variabel fitur terdiri dari variabel kontinu.
nl: Feedforward neurale netwerken zijn voorspellende algoritmen die geïnspireerd zijn op de biologische neurale netwerken waaruit hersenen bestaan. Een neuron (knooppunt) dat een signaal ontvangt, verwerkt het en kan signalen sturen naar neuronen die ermee verbonden zijn. Het signaal op een knooppunt is een reëel getal en de output van elk knooppunt wordt berekend door het signaal door de activeringsfunctie te sturen. Het aantal lagen en knooppunten in het netwerk is onlosmakelijk verbonden met de complexiteit van het model, aangezien hoge aantallen de flexibiliteit van het model vergroten. ### Aannames - De doelvariabele is een continue variabele. - De kenmerken bestaan uit continue variabelen.
pt: Redes neurais feedforward são algoritmos preditivos inspirados nas redes neurais biológicas que constituem o cérebro. Um neurônio (nó) recebe um sinal e o processa, podendo enviar sinais aos neurônios conectados a ele. O sinal em um nó é um número real, e a saída de cada nó é calculada enviando o sinal através da função de ativação. O número de camadas e nós na rede está intrinsecamente ligado à complexidade do modelo, visto que números altos aumentam a flexibilidade do modelo. ### Suposições - A variável alvo é uma variável contínua. - As variáveis de característica consistem em contínuas.
ru: Нейронные сети с прямой связью - это предсказательный алгоритм, вдохновленный представлениями о биологических нейронных сетях, из которых состоит мозг. Нейрон (узел) принимает сигнал, обрабатывает его и посылает результат другим нейронам, которые с ним соединены. Сигнал каждого узла - это вещественное число, а выход узла вычисляется путем прохождения сигнала через функцию активации. Количество слоев и узлов в сети внутренне связано со сложностью модели, и большие их значения повышают гибкость. ### Допущения - Целевая переменная является непрерывной. - Признаки являются непрерывными переменными.
ta: ஃபீட்ஃபோர்டு நியூரல் நெட்வொர்க்குகள் மூளைகளை உருவாக்கும் உயிரியல் நரம்பியல் நெட்வொர்க்குகளால் ஈர்க்கப்பட்ட முன்கணிப்பு வழிமுறைகள். ஒரு சிக்னலைப் பெறும் ஒரு நியூரானை (முனை) பின்னர் அதை செயலாக்குகிறது மற்றும் அதனுடன் இணைக்கப்பட்ட நியூரான்களுக்கு சமிக்ஞைகளை அனுப்ப முடியும். ஒரு முனையில் உள்ள சமிக்ஞை ஒரு உண்மையான எண், மற்றும் ஒவ்வொரு முனையின் வெளியீடும் சமிக்ஞை தொட்டியை செயல்படுத்தும் செயல்பாட்டை அனுப்புவதன் மூலம் கணக்கிடப்படுகிறது. நெட்வொர்க்கில் உள்ள அடுக்குகள் மற்றும் முனைகளின் எண்ணிக்கை மாதிரி சிக்கலுடன் உள்ளார்ந்த முறையில் இணைக்கப்பட்டுள்ளது, ஏனெனில் அதிக எண்கள் மாதிரியின் நெகிழ்வுத்தன்மையை அதிகரிக்கின்றன. ### அனுமானங்கள் - இலக்கு மாறி தொடர்ச்சியான மாறி. - அம்ச மாறிகள் தொடர்ச்சியாக உள்ளன.

# mlRegressionRandomForest|
source: Random Forest is a method of regression that creates a set of decision trees that consists of a large number of individual trees which operate as an ensemble. ### Assumptions - The target variable is a continuous variable. - The feature variables consist of continuous, nominal, or ordinal variables.
de: Random Forest ist eine Regressionsmethode, bei der eine Menge von Entscheidungsbäumen erstellt wird, die aus einer großen Anzahl von Einzelbäumen bestehen, die als Ensemble funktionieren. ### Annahmen - Die Zielvariable ist eine kontinuierliche Variable. - Die Merkmalsvariablen bestehen aus kontinuierlichen, nominalen oder ordinalen Variablen.
es: El de Bosques Aleatorios es un método de regresión que genera un conjunto de árboles de decisión, que consiste en un número grande de árboles individuales que funcionan como un conjunto. ### Supuestos - La variable objetivo es una variable continua. - Las variables de características consisten en variables continuas, nominales u ordinales.
gl: O de Bosques Aleatorios é un método de regresión que xera un conxunto de árbores de decisión, que consiste nun número grande de árbores individuais que funcionan como un conxunto. ### Supostos - A variable obxectivo é unha variable continua. - As variables de características consisten en variables continuas, nominais ou ordinais.
id: Random Forest adalah sebuah metode regresi yang menciptakan sekumpulan pohon keputusan yang terdiri dari sejumlah besar pohon individu yang beroperasi sebagai sebuah ensemble. ### Asumsi - Variabel target adalah variabel kontinu. - Variabel fitur terdiri dari variabel kontinu, nominal, atau ordinal.
nl: Random Forest is een regressiemethode die een set beslisbomen creëert die bestaat uit een groot aantal individuele bomen die als een ensemble werken. ### Veronderstellingen - De doelvariabele is een continue variabele. - De kenmerken bestaan uit continue, nominale of ordinale variabelen.
pt: Floresta Aleatória é um método de regressão que cria um conjunto de árvores de decisão composto por um grande número de árvores individuais que operam como um conjunto. ### Suposições - A variável alvo é uma variável contínua. - As variáveis de característica consistem em variáveis contínuas, nominais ou ordinais.
ru: Случайный лес - это метод классификации, создающий большое количество отдельных деревьев решений, которые работают вместе как ансамбль. ### Допущения - Целевая переменная является непрерывной. - Признаки могут быть непрерывными, номинальными или порядковыми переменными.
ta: ரேண்டம் ஃபாரச்ட் என்பது பின்னடைவின் ஒரு முறையாகும், இது ஒரு குழுவாக செயல்படும் ஏராளமான தனிப்பட்ட மரங்களைக் கொண்ட ஒரு முடிவு மரங்களின் தொகுப்பை உருவாக்குகிறது. ### அனுமானங்கள் - இலக்கு மாறி தொடர்ச்சியான மாறி. - அம்ச மாறிகள் தொடர்ச்சியான, பெயரளவு அல்லது சாதாரண மாறிகள் கொண்டவை.

# mlRegressionRegularized|
source: Regularized linear regression is an adaptation of linear regression in which the coefficients are shrunken towards 0. This is done by applying a penalty (e.g., ridge, lasso, or elastic net). The parameter λ controls the degree to which parameters are shrunken. ### Assumptions - The target variable is a continuous variable. - The feature variables consist of continuous, nominal, or ordinal variables.
de: Regularisierte lineare Regression ist eine Abwandlung der linearen Regression, bei der die Koeffizienten gegen 0 geschrumpft werden. Dies geschieht durch die Anwendung eines Strafterms (z. B. Ridge, Lasso oder elastisches Netz). Der Parameter λ bestimmt, wie stark die Parameter geschrumpft werden. ### Annahmen - Die Zielvariable ist eine kontinuierliche Variable. - Die Merkmalsvariablen bestehen aus kontinuierlichen, nominalen oder ordinalen Variablen.
es: La Regresión Lineal Regularizada es una adaptación de la regresión lineal en la que los coeficientes están contraídos hacia 0. Esto se hace aplicando una penalización (e.g. ridge, lasso o red elástica). El parámetro λ controla el grao en el que se contraen los parámetros. ### Supuestos - La variable objetivo es una variable continua. - Las variables de características consisten en variables continuas, nominales u ordinales.
gl: A Regresión Linear Regularizada é unha adaptación da regresión linear na que os coeficientes están contraídos cara a 0. Isto faise aplicando unha penalización (e.g. ridge, lasso ou rede elástica). O parámetro λ controla o grao no que se contraen os parámetros. ### Supostos - A variable obxectivo é unha variable continua. - As variables de características consisten en variables continuas, nominais ou ordinais.
id: Regresi linier teregresi adalah adaptasi dari regresi linier di mana koefisien menyusut menuju 0. Hal ini dilakukan dengan menerapkan penalti (misalnya, punggungan, laso, atau jaring elastis). Parameter λ mengontrol sejauh mana parameter menyusut. ### Asumsi - Variabel target adalah variabel kontinu. - Variabel fitur terdiri dari variabel kontinu, nominal, atau ordinal.
nl: Geregulariseerde lineaire regressie is een aanpassing van lineaire regressie waarbij de coëfficiënten worden gekrompen naar 0. Dit wordt gedaan door een straf toe te passen (bijvoorbeeld ridge, lasso of elastisch net). De parameter λ bepaalt de mate waarin parameters worden gekrompen. ### Aannames - De doelvariabele is een continue variabele. - De kenmerken bestaan uit continue, nominale of ordinale variabelen.
pt: A regressão linear regularizada é uma adaptação da regressão linear na qual os coeficientes são reduzidos em direção a 0. Isso é feito aplicando uma penalidade (por exemplo, ridge, lasso ou elastic net). O parâmetro λ controla o grau de redução dos parâmetros. ### Suposições - A variável alvo é uma variável contínua. - As variáveis de característica consistem em variáveis contínuas, nominais ou ordinais.
ta: ஒழுங்குபடுத்தப்பட்ட நேரியல் பின்னடைவு என்பது நேரியல் பின்னடைவின் தழுவலாகும், இதில் குணகங்கள் 0 ஐ நோக்கி சுருங்குகின்றன. இது தண்டம் (எ.கா., ரிட்ச், லாசோ அல்லது மீள் நெட்) பயன்படுத்துவதன் மூலம் செய்யப்படுகிறது. அளவுருவுகள் எந்த அளவிற்கு அளவுருக்கள் சுருங்குகின்றன என்பதை கட்டுப்படுத்துகிறது. ### அனுமானங்கள் - இலக்கு மாறி தொடர்ச்சியான மாறி. - அம்ச மாறிகள் தொடர்ச்சியான, பெயரளவு அல்லது சாதாரண மாறிகள் கொண்டவை.
