Repository: jasp-stats/jaspMachineLearning
Catalog: po/QML-*.po
Languages: de, es, gl, id, nl, pt, ru, ta

# DataSplit|
source: Choose a percentage to randomly sample from your data to derive prediction error. Generates an internal indicator variable that indicates whether the observation is included (1) or excluded (0) from the test set.
de: Wählen Sie einen Prozentsatz, der zufällig aus Ihren Daten gezogen wird, um den Vorhersagefehler zu bestimmen. Erzeugt eine interne Indikatorvariable, die angibt, ob die Beobachtung enthalten ist (1) oder aus dem Testset ausgeschlossen ist (0).
es: Escoger un porcentaje para hacer un muestreo aleatorio de sus datos para derivar el error de predicción. Genera una variable índice interna que indica si la observación esta incluída (1) o excluída (0) del conjunto de contraste.
gl: Escoller unha porcentaxe para facer unha mostraxe aleatoria dos teus datos para derivar o erro de predición. Xera unha variable índice interna que indica se a observación esta incluída (1) ou excluída (0) do conxunto de proba.
id: Pilih persentase untuk mengambil sampel secara acak dari data Anda untuk mendapatkan kesalahan prediksi. Menghasilkan variabel indikator internal yang mengindikasikan apakah pengamatan termasuk (1) atau tidak termasuk (0) dalam set pengujian.
nl: Kies een percentage om willekeurig te steken van je gegevens om een voorspellingsfout te verkrijgen. Genereert een interne indicator variabele welke aangeeft of de observatie is inbegrepen (1) is of uitgesloten (0) van de testset.
pt: Escolha uma porcentagem para amostrar aleatoriamente seus dados e derivar o erro de previsão. Gera uma variável indicadora interna que indica se a observação é incluída (1) ou excluída (0) do conjunto de teste.
ta: முன்கணிப்பு பிழையைப் பெற உங்கள் தரவிலிருந்து தோராயமாக மாதிரியாக ஒரு சதவீதத்தைத் தேர்வுசெய்க. சோதனை தொகுப்பிலிருந்து அவதானிப்பு சேர்க்கப்பட்டுள்ளதா அல்லது விலக்கப்பட்டுள்ளதா என்பதைக் குறிக்கும் உள் காட்டி மாறியை உருவாக்குகிறது.

# DataSplit|
source: The percentage of observations to use for the test set.
de: Der Prozentsatz der Beobachtungen, die für die Testmenge verwendet werden sollen.
es: El porcentaje de observaciones a usar en el conjunto de contraste.
gl: A porcentaxe de observacións a usar no conxunto de proba.
id: Persentase pengamatan yang akan digunakan untuk set pengujian.
nl: Het percentage van observaties om te gebruiken voor de test set.
pt: A porcentagem de observações a serem usadas no conjunto de teste.
ta: சோதனை தொகுப்பிற்கு பயன்படுத்த அவதானிப்புகளின் விழுக்காடு.

# DataSplit|
source: Add the generated test set indicator from the option above to your data set.
de: Fügen Sie den erzeugten Testsatz-Indikator von der obigen Option zu Ihrem Datensatz hinzu.
es: Añadir el índice generado del conjunto de contraste de la opción anterior, a tu conjunto de datos.
gl: Engadir o índice xerado de conxunto de proba da opción anterior ao teu conxunto de datos.
id: Tambahkan indikator set pengujian yang dihasilkan dari opsi di atas ke set data Anda.
nl: Voeg de gegenereerde testset indicator toe aan je data set.
pt: Adicione o indicador do conjunto de teste gerado da opção acima ao seu conjunto de dados.
ta: மேலே உள்ள விருப்பத்திலிருந்து உங்கள் தரவு தொகுப்பில் உருவாக்கப்பட்ட சோதனை தொகுப்பு குறிகாட்டியைச் சேர்க்கவும்.

# DataSplit|
source: The column name for the generated test set indicator.
de: Der Spaltenname für den erzeugten Testsatzindikator.
es: El nombre de columna para el índice generado del conjunto de contraste.
gl: O nome de columna para o índice xerado de conxunto de proba.
id: Nama kolom untuk indikator set pengujian yang dihasilkan.
nl: De kolomnaam voor de gegenereerde testset indicator.
pt: O nome da coluna para o indicador do conjunto de teste gerado.
ta: உருவாக்கப்பட்ட சோதனை தொகுப்பு குறிகாட்டிக்கான நெடுவரிசை பெயர்.

# DataSplit|
source: The variable in the data set that is used as the test set indicator.
de: Die Variable in dem Datensatz, die als Testsatzindikator verwendet wird.
es: La variable del conjunto de datos que se utiliza como índice del conjunto de contraste.
gl: A variable do conxunto de datos que se utiliza como índice do conxunto de proba.
id: Variabel dalam set data yang digunakan sebagai indikator set pengujian.
nl: De variabele in de data set die gebruikt wordt als de testset indicator.
pt: A variável no conjunto de dados que é usada como indicador do conjunto de teste.
ta: சோதனை தொகுப்பு குறிகாட்டியாகப் பயன்படுத்தப்படும் தரவு தொகுப்பில் உள்ள மாறி.

# DataSplit|
source: Choose how to create the validation set.
de: Wählen Sie, wie die Validierungsmenge erstellt wird.
es: Elegir como crear el conjunto de validación.
gl: Elixir como crear o conxunto de validación.
id: Pilih cara membuat set validasi.
nl: Kies hoe de validatie set gemaakt moet worden.
pt: Escolha como criar o conjunto de validação.
ta: சரிபார்ப்பு தொகுப்பை எவ்வாறு உருவாக்குவது என்பதைத் தேர்வுசெய்க.

# DataSplit|
source: Randomly sample a percentage from the remaining training data (after selecting the test set).
de: Zufälliges Ziehen eines Prozentsatzes aus den übrigen Trainingsdaten (nach Auswahl des Testsatzes).
es: Tomar una muestra aleatoria con un porcentaje de los datos de adiestramiento restantes (después de seleccionar el conjunto de contraste).
gl: Tomar unha mostra aleatoria cunha porcentaxe dos datos de ensaio restantes (despois de seleccionar o conxunto de proba).
id: Secara acak mengambil sampel persentase dari data pelatihan yang tersisa (setelah memilih set pengujian).
nl: Kies willekeurig een percentage van de resterende training data (nadat de test set is geselecteerd).
pt: Amostragem aleatória de uma porcentagem dos dados de treinamento restantes (após selecionar o conjunto de teste).
ta: மீதமுள்ள பயிற்சி தரவுகளிலிருந்து தோராயமாக ஒரு சதவீதத்தை மாதிரி செய்யுங்கள் (சோதனை தொகுப்பைத் தேர்ந்தெடுத்த பிறகு).

# DataSplit|
source: The percentage of observations to use for the validation set.
de: Der Prozentsatz an Beobachtungen für die Validierungsmenge.
es: El porcentaje de observaciones a usar para el conjunto de validación.
gl: A porcentaxe de observacións a usar para o conxunto de validación.
id: Persentase pengamatan yang akan digunakan untuk set validasi.
nl: Het percentage observaties wat gebruikt wordt voor de validatie set.
pt: A porcentagem de observações a serem usadas para o conjunto de validação.
ta: சரிபார்ப்பு தொகுப்பிற்கு பயன்படுத்த அவதானிப்புகளின் விழுக்காடு.

# DataSplit|
source: Partition the remaining data in *k* parts.
de: Die restlichen Daten in *k* Teile aufteilen.
es: Partir los datos restantes en *k* partes.
gl: Partir os datos restantes en *k* partes.
id: Pisahkan data yang tersisa menjadi beberapa bagian *k*.
nl: Deel de overige data op in *k* delen.
pt: Particione os dados restantes em *k* partes.
ta: மீதமுள்ள தரவை * K * பகுதிகளில் பகிரவும்.

# DataSplit|
source: The number of folds to be used.
es: El número de pliegues a usar.
gl: O número de pregos a usar.
id: Jumlah lipatan yang akan digunakan.
nl: Het aantal vouwen wat gebruikt wordt.
pt: O número de dobras a serem usadas.
ta: பயன்படுத்த வேண்டிய மடிப்புகளின் எண்ணிக்கை.

# DataSplit|
source: Partition the remaining data in *n* parts.
de: Die restlichen Daten in *n* Teile aufteilen.
es: Partir los datos restantes en *n* partes.
gl: Partir os datos restantes en *n* partes.
id: Pisahkan data yang tersisa dalam *n* bagian.
nl: Deel de overige data op in *n* delen.
pt: Particione os dados restantes em *n* partes.
ta: மீதமுள்ள தரவை * n * பகுதிகளில் பகிரவும்.

# ExportResults|
source: Generates a new column in your dataset with the values of your regression result. This gives you the option to inspect, cluster, or predict the generated values.
de: Erstellt eine neue Spalte in Ihrem Datensatz mit den Werten Ihres Regressionsergebnisses. Damit können Sie die erzeugten Werte inspizieren, clustern oder vorhersagen.
es: Genera una nueva columna en tu conjunto de datos con los valores del resultado de tu regresión. Esto te da la opción de inspeccionar, agrupar o predecir los valores generados.
gl: Xera unha nova columna no teu conxunto de datos cos valores do resultado da túa regresión. Isto dáche a opción de inspeccionar, agrupar ou predicir os valores xerados.
id: Menghasilkan kolom baru dalam set data Anda dengan nilai hasil regresi Anda. Hal ini memberikan Anda opsi untuk memeriksa, mengelompokkan, atau memprediksi nilai yang dihasilkan.
nl: Genereert een nieuwe kolom in je dataset met de waarden van je regressieresultaat. Dit geeft u de optie om de gegenereerde waarden te inspecteren, te clusteren of te voorspellen.
pt: Gera uma nova coluna no seu conjunto de dados com os valores do resultado da regressão. Isso lhe dá a opção de inspecionar, agrupar ou prever os valores gerados.
ta: உங்கள் பின்னடைவு முடிவின் மதிப்புகளுடன் உங்கள் தரவுத்தொகுப்பில் புதிய நெடுவரிசையை உருவாக்குகிறது. உருவாக்கப்பட்ட மதிப்புகளை ஆய்வு செய்ய, கொத்து அல்லது கணிக்க இது உங்களுக்கு விருப்பத்தை வழங்குகிறது.

# ExportResults|
source: The column name for the predicted values.
de: Der Spaltenname für die vorhergesagten Werte.
es: El nome de la columna para los valores predichos.
gl: O nome da columna para os valores preditos.
id: Nama kolom untuk nilai yang diprediksi.
nl: De kolomnaam voor de voorspelde waarden.
pt: O nome da coluna para os valores previstos.
ru: Имя столбца, добавляемого для предсказанных значений.
ta: கணிக்கப்பட்ட மதிப்புகளுக்கான நெடுவரிசை பெயர்.

# ExportResults|
source: The file path for the saved model.
de: Der Dateipfad für das gespeicherte Modell.
es: La ruta de archivo para el modelo guardado.
gl: A ruta de ficheiro para o modelo gardado.
id: Jalur file untuk model yang disimpan.
nl: Het bestandspad voor het opgeslagen model.
pt: O caminho do arquivo para o modelo salvo.
ru: Путь к файлу для сохранения модели.
ta: சேமித்த மாதிரிக்கான கோப்பு பாதை.

# ExportResults|
source: When clicked, the model is exported to the specified file path.
de: Beim Anklicken wird das Modell in den angegebenen Dateipfad exportiert.
es: Cuando se hace clic, el modelo se exporta a la ruta de archivo especificada.
gl: Cando se fai clic, o modelo expórtase á ruta de ficheiro especificada.
id: Apabila diklik, model diekspor ke jalur file yang ditentukan.
nl: Als hierop geklikt wordt, wordt het model geëxporteerd naar het gespecificeerde bestandspad.
pt: Quando clicado, o modelo é exportado para o caminho de arquivo especificado.
ru: При выборе этой опции модель экспортируется по заданному пути к файлу.
ta: சொடுக்கு செய்யும் போது, மாதிரி குறிப்பிட்ட கோப்பு பாதைக்கு ஏற்றுமதி செய்யப்படுகிறது.

# ScaleVariables|
source: Scale features
de: Merkmale skalieren
es: Características de la escala
gl: Características da escala
id: Fitur skala
nl: Schaal kenmerken
pt: Características da escala
ru: Стандартизировать признаки
ta: அளவிலான நற்பொருத்தங்கள்

# ScaleVariables|
source: Standardizes the continuous features in the dataset. Standardization ensures that values of features from different scales range into a specific similar scale. As a result, standardizing provides numerical stability. JASP uses the Z-score standardization of a mean of 0 and a standard deviation of 1. This option is selected by default.
de: Standardisiert die kontinuierlichen Merkmale im Datensatz. Die Standardisierung stellt sicher, dass Werte von Merkmalen mit unterschiedlichen Skalen in eine bestimmte ähnliche Skala passen. Dadurch trägt die Standardisierung zur numerische Stabilität bei. JASP verwendet die Z-Score-Standardisierung mit dem Mittelwert von 0 und einer Standardabweichung von 1. Diese Option wird standardmäßig ausgewählt.
es: Tipifica las características continuas en el conjunto de datos. La tipificación asegura que valores de las características de distintas escalas fluctúen en una escala específica similar. Como resultado, la tipificación proporciona estabilidad numérica. JASP utiliza la tipificación de las puntuaciones Z con una media de 0 y una desviación típica de 1. Esta opción se selecciona por defecto.
gl: Tipifica as características continuas no conxunto de datos. A tipificación asegura que valores das características de distintas escalas fluctúen nunha escala específica similar. Como resultado, a tipificación prporciona estabilidade numérica. JASP utiliza a tipificación das puntuacións Z cunha media de 0 e un desvío padrón de 1. Esta opción se selecciona por defecto.
id: Menstandarkan fitur kontinu dalam kumpulan data. Standarisasi memastikan bahwa nilai fitur dari rentang skala yang berbeda masuk ke dalam skala tertentu yang serupa. Hasilnya, standarisasi memberikan stabilitas numerik. JASP menggunakan standarisasi Z-score dengan nilai rata-rata 0 dan deviasi standar 1. Opsi ini dipilih secara default.
nl: Standaardiseert de continue kenmerken in de dataset. Standaardisatie zorgt ervoor dat waarden van kenmerken van verschillende schalen in een specifieke vergelijkbare schaal vallen. Standaardisatie zorgt dus voor numerieke stabiliteit. JASP gebruikt de Z-score standaardisatie van een gemiddelde van 0 en een standaardafwijking van 1. Deze optie is standaard geselecteerd.
pt: Padroniza as características contínuas no conjunto de dados. A padronização garante que os valores das características de diferentes escalas se relacionem a uma escala similar específica. Como resultado, a padronização proporciona estabilidade numérica. O JASP utiliza a padronização do escore Z com média 0 e desvio padrão 1. Esta opção é selecionada por padrão.
ru: Стандартизирует непрерывные переменные-признаки в наборе данных. Стандартизация обеспечивает приведение значений признаков разных масштабов к одному определенному масштабу. Таким образом, стандартизация дает численную стабильность. JASP использует стандартизацию по Z-оценке со средним значением 0 и стандартным отклонением 1. Эта опция выбрана по умолчанию.
ta: தரவுத்தொகுப்பில் தொடர்ச்சியான அம்சங்களை தரப்படுத்துகிறது. வெவ்வேறு அளவீடுகளிலிருந்து அம்சங்களின் மதிப்புகள் ஒரு குறிப்பிட்ட ஒத்த அளவில் இருப்பதை தரநிலைப்படுத்தல் உறுதி செய்கிறது. இதன் விளைவாக, தரநிலைப்படுத்தல் எண் ச்திரத்தன்மையை வழங்குகிறது. JASP 0 இன் சராசரி Z- மதிப்பெண் தரப்படுத்தல் மற்றும் 1 இன் நிலையான விலகல் ஆகியவற்றைப் பயன்படுத்துகிறது. இந்த விருப்பம் இயல்பாகவே தேர்ந்தெடுக்கப்படுகிறது.

source: Set seed
de: Startwert für Zufallszahlen setzen
es: Establecer semilla
gl: Establecer a semente
nl: Gebruik toevalsgenerator beginwaarde
pt: Definir semente
ru: Затравка ГСЧ
ta: விதை அமைக்கவும்

# SetSeed|
source: Gives the option to set a seed for your analysis. Setting a seed will exclude random processes influencing an analysis. For example, setting a seed makes it possible to re-run analyses with the same data splits.
de: Gibt die Möglichkeit, einen Zufallszahlen-Startwert für Ihre Analyse einzustellen. Durch das Setzen eines Startwerts werden zufällige Einflüsse einer Analyse ausgeschlossen. Beispielsweise ermöglicht die Einstellung eines Startwerts eine wiederholte Analyse mit denselben Datenaufteilungen.
es: Permite la opción de establecer una semilla para su análisis. Establecer una semilla va a evitar que procesos aleatorios influyan en un análisis. Por ejemplo, establecer una semilla hace posible volver a ejecutar análisis con las mismas divisiones de datos.
gl: Permite a opción de establecer unha semente para a túa análise. Establecer unha semente vai evitar que procesos aleatorios inflúan nunha análise. Por exemplo, establecer unha semente fai posible volver a executar análises coas mesmas divisións de datos.
nl: Geeft de optie om de beginwaarde van de toevalsgenerator in te stellen voor je analyse. Door een beginwaarde in te stellen worden willekeurige processen die een analyse beïnvloeden uitgesloten. Het instellen van een beginwaarde maakt het bijvoorbeeld mogelijk om analyses met dezelfde gegevenssplitsingen opnieuw uit te voeren.
pt: Oferece a opção de definir uma semente para sua análise. Definir uma semente excluirá processos aleatórios que influenciam uma análise. Por exemplo, definir uma semente permite reexecutar análises com as mesmas divisões de dados.
ru: Позволяет задать затравку для данного анализа. Затравка исключает случайные процессы, оказывающие влияние на анализ. К примеру, установка затравки делает возможным перезапуск анализа с тем же самым разбиением данных.
ta: உங்கள் பகுப்பாய்விற்கு ஒரு விதை அமைப்பதற்கான விருப்பத்தை வழங்குகிறது. ஒரு விதை அமைப்பது ஒரு பகுப்பாய்வை பாதிக்கும் சீரற்ற செயல்முறைகளை விலக்கும். எடுத்துக்காட்டாக, ஒரு விதை அமைப்பது அதே தரவு பிளவுகளுடன் பகுப்பாய்வுகளை மீண்டும் இயக்க முடியும்.

# SetSeed|
source: The value of the seed.
de: Der Wert des Startwerts.
es: El valor de la semilla.
gl: O valor da semente.
nl: De waarde van de toevalsgenerator beginwaarde.
pt: O valor da semente.
ru: Значение затравки.
ta: விதையின் மதிப்பு.

# VariablesFormClassification|
source: Target
de: Ziel
es: Objetivo
gl: Obxectivo
id: Sasaran
nl: Doelvariabele
pt: Alvo
ru: Целевая переменная
ta: இலக்கு

# VariablesFormClassification|
source: In this box, the variable that needs to be predicted should be entered.
de: In diesem Feld sollte die Variable eingegeben werden, die vorhergesagt werden muss.
es: En esta caja debe introducirse la variable que se necesita predecir.
gl: Nesta caixa debe introducirse a variable que se necesita predicir.
id: Di dalam kotak ini, variabel yang perlu diprediksi harus dimasukkan.
nl: In dit veld moet de variabele ingevuld worden die voorspeld moet worden.
pt: Nesta caixa, você deve inserir a variável que precisa ser prevista.
ru: В это поле вносится переменная, которая будет содержать предсказания модели.
ta: இந்த பெட்டியில், கணிக்க வேண்டிய மாறி உள்ளிடப்பட வேண்டும்.

# VariablesFormClassification|
source: Features
de: Merkmale
es: Características
gl: Características
id: Fitur
nl: Kenmerken
pt: Características
ta: நற்பொருத்தங்கள்

# VariablesFormClassification|
source: In this box, the variables that provide information about the target variable should be entered.
de: In diesem Feld sollten die Variablen eingegeben werden, die Informationen über die Zielvariable liefern.
es: En esta caja deben introducirse las variables que proporcionan información sobre la variable objetivo.
gl: Nesta caixa deben introducirse as variables que proporcionan información sobre a variable obxectivo.
id: Pada kotak ini, variabel-variabel yang memberikan informasi mengenai variabel sasaran harus dimasukkan.
nl: In dit veld moeten de kenmerken worden ingevoerd die informatie geven over de doelvariabele.
pt: Nesta caixa, devem ser inseridas as variáveis que fornecem informações sobre a variável alvo.
ru: В это поле вносится переменная, содержащая информацию о целевых значениях.
ta: இந்த பெட்டியில், இலக்கு மாறியைப் பற்றிய தகவல்களை வழங்கும் மாறிகள் உள்ளிடப்பட வேண்டும்.

# VariablesFormClustering|
source: Features
de: Merkmale
es: Características
gl: Características
id: Fitur
nl: Kenmerken
pt: Características
ru: Признаки
ta: நற்பொருத்தங்கள்

# VariablesFormClustering|
source: In this box, the variables are need to be considered by the clustering algorithm should be entered.
de: In diesem Feld sollten die Variablen eingegeben werden, die vom Clustering-Algorithmus berücksichtigt werden sollen.
es: En esta caja deben introducirse las variables que necesita considerar el algoritmo de conglomeración.
gl: Nesta caixa deben introducirse as variables que necesita considerar o algoritmo de conglomeración.
id: Pada kotak ini, variabel-variabel yang perlu dipertimbangkan oleh algoritma pengelompokan harus dimasukkan.
nl: Voer in dit vak de variabelen in waarmee het clusteralgoritme rekening moet houden.
pt: Nesta caixa, devem ser inseridas as variáveis que precisam ser consideradas pelo algoritmo de agrupamento.
ru: В этот список заносятся переменные, которые должны использоваться алгоритмом кластеризации в качестве признаков.
ta: இந்த பெட்டியில், கிளச்டரிங் வழிமுறையால் மாறிகள் கருத்தில் கொள்ளப்பட வேண்டும்.

# VariablesFormRegression|
source: Target
de: Ziel
es: Objetivo
gl: Obxectivo
id: Sasaran
nl: Doelvariabele
pt: Alvo
ru: Целевая переменная
ta: இலக்கு

# VariablesFormRegression|
source: In this box, the variable that needs to be predicted should be entered.
de: In diesem Feld sollte die Variable eingegeben werden, die vorhergesagt werden muss.
es: En esta caja debe introducirse la variable que se necesita predecir.
gl: Nesta caixa debe introducirse a variable que se necesita predicir.
id: Di dalam kotak ini, variabel yang perlu diprediksi harus dimasukkan.
nl: In dit veld moet de variabele die voorspeld moet worden ingevuld worden.
pt: Nesta caixa, você deve inserir a variável que precisa ser prevista.
ru: В это поле вносится переменная, которая будет содержать предсказания модели.
ta: இந்த பெட்டியில், கணிக்க வேண்டிய மாறி உள்ளிடப்பட வேண்டும்.

# VariablesFormRegression|
source: Features
de: Merkmale
es: Características
gl: Características
id: Fitur
nl: Kenmerken
pt: Características
ta: நற்பொருத்தங்கள்

# VariablesFormRegression|
source: In this box, the variables that provide information about the target variable should be entered.
de: In diesem Feld sollten die Variablen eingegeben werden, die Informationen über die Zielvariable liefern.
es: En esta caja deben introducirse las variables que proporcionan información sobre la variable objetivo.
gl: Nesta caixa deben introducirse as variables que proporcionan información sobre a variable obxectivo.
id: Pada kotak ini, variabel-variabel yang memberikan informasi mengenai variabel target harus dimasukkan.
nl: In dit vak moeten de kenmerken worden ingevoerd die informatie geven over de doelvariabele.
pt: Nesta caixa, devem ser inseridas as variáveis que fornecem informações sobre a variável alvo.
ru: В это поле вносится переменная, содержащая информацию о целевых значениях.
ta: இந்த பெட்டியில், இலக்கு மாறியைப் பற்றிய தகவல்களை வழங்கும் மாறிகள் உள்ளிடப்பட வேண்டும்.
