Repository: jasp-stats/jaspMachineLearning
Catalog: po/QML-*.po
Languages: de, es, gl, id, nl, pt, ru, ta

# AlgorithmicSettings|
source: The distance metric to be used when determining the similarity between nearest neighbors. Can be either Euclidean or Manhattan distance.
de: Die verwendete Distanzmetrik zur Bestimmung der Ähnlichkeit zwischen nächsten Nachbarn. Kann entweder Euklidische oder Manhattan-Distanz sein.
es: La métrica de la distancia que se va a utilizar cuando se determine la similitud entre los vecinos más cercanos. Puede ser la distancia Euclídea o Manhattan.
gl: A métrica da distancia que se vai utilizar cando se determine a semellanza entre os veciños máis próximos. Pode ser a distancia Euclídea ou Manhattan.
id: Metrik jarak yang akan digunakan saat menentukan kemiripan antara tetangga terdekat. Dapat berupa jarak Euclidean atau Manhattan.
nl: De afstandsmaat die gebruikt wordt voor het bepalen van de overeenkomst tussen de dichtstbijzijnde buren. Kan Euclidische of Manhattan afstand zijn.
pt: Métrica de distância a ser usada para determinar a similaridade entre vizinhos mais próximos. Pode ser a distância euclidiana ou de Manhattan.
ru: Метрика расстояния, используемая для определения сходства между ближайшими соседями. Может быть выбрана евклидова метрика или городских кварталов.
ta: அருகிலுள்ள அண்டை நாடுகளுக்கு இடையிலான ஒற்றுமையை தீர்மானிக்கும்போது பயன்படுத்தப்பட வேண்டிய தூர மெட்ரிக். யூக்ளிடியன் அல்லது மன்ஆட்டன் தூரமாக இருக்கலாம்.

# ModelOptimization|
source: Number of Nearest Neighbors
de: Anzahl von nächsten Nachbarn
es: Número de Vecinos Más Cercanos
gl: Número de Veciños Máis Próximos
nl: Aantal Dichtstbijzijnde Buren
pt: Número de vizinhos próximos
ru: Количество ближайших соседей
ta: அருகிலுள்ள அண்டை நாடுகளின் எண்ணிக்கை

# ModelOptimization|
source: Enables you to use a user-specified number of nearest neighbors.
de: Ermöglicht Ihnen die Verwendung einer benutzerdefinierte Anzahl von nächsten Nachbarn.
es: Te permite utilizar un número especificado por el usuario, para los vecinos más cercanos.
gl: Te permite utilizar un número especificado polo usuario, para os veciños máis próximos.
nl: Stelt je in staat om een zelf-gespecificeerd aantal dichtstbijzijnde buren te gebruiken.
pt: Permite que você use um número especificado pelo usuário de vizinhos mais próximos.
ru: Позволяет задать определенное пользователем количество ближайших соседей.
ta: பயனர் குறிப்பிட்ட எண்ணிக்கையிலான அருகிலுள்ள அண்டை நாடுகளைப் பயன்படுத்த உங்களுக்கு உதவுகிறது.

# ModelOptimization|
source: Nearest neighbors
de: Nächste Nachbarn
es: Vecinos más próximos
gl: Veciños máis próximos
nl: Dichtstbijzijnde buren
pt: Vizinhos mais próximos
ru: Ближайших соседей
ta: அருகிலுள்ள அயலவர்கள்

# ModelOptimization|
source: The number of nearest neighbors to be used.
de: Die Anzahl der verwendeten nächsten Nachbarn.
es: El número de vecinos más cercanos que se va a utilizar.
gl: O número de veciños máis próximos que se vai utilizar.
nl: Het aantal dichtstbijzijnde buren wat gebruikt wordt.
pt: O número de vizinhos mais próximos a ser usado.
ru: Количество ближайших соседей для использования в модели.
ta: பயன்படுத்த வேண்டிய அருகிலுள்ள அண்டை நாடுகளின் எண்ணிக்கை.

# ModelOptimization|
source: Enables you to optimize the prediction error on a validation data set with respect to the number of nearest neighbors.
de: Ermöglicht Ihnen, den Vorhersagefehler auf einem Validierungsdatensatz hinsichtlich der Anzahl der nächsten Nachbarn zu optimieren.
es: Te permite optimizar el error de predicción en un conjunto de datos de comprobación, respecto al número de vecinos más cercanos.
gl: Te permite optimizar o erro de predición nun conxunto de datos de comprobación, respecto ao número de veciños máis próximos.
nl: Stelt je in staat om de voorspellingsfout te optimaliseren op een validatie data set op basis van het aantal dichtstbijzijnde buren.
pt: Permite otimizar o erro de previsão em um conjunto de dados de validação em relação ao número de vizinhos mais próximos.
ru: Позволяет оптимизировать ошибку предсказания на валидационной выборке путем изменения количества ближайших соседей.
ta: அருகிலுள்ள அண்டை நாடுகளின் எண்ணிக்கையைப் பொறுத்து சரிபார்ப்பு தரவுகளில் கணிப்பு பிழையை மேம்படுத்த உங்களுக்கு உதவுகிறது.

# ModelOptimization|
source: Max. nearest neighbors
de: Max. nächste Nachbarn
es: Máx. vecinos más cercanos
gl: Máx. veciños máis próximos
nl: Max. dichtstbijzijnde buren
pt: Máx. vizinhos mais próximos
ru: Макс. ближайших соседей
ta: அதிகபட்சம். அருகிலுள்ள அயலவர்கள்

# ModelOptimization|
source: Sets the maximum number of possible nearest neighbors to be considered. At default, this is set to 10.
de: Setzt die maximale Anzahl möglicher nächster Nachbarn, die in Betracht gezogen wird. Standardmäßig ist dies auf 10 gesetzt.
es: Establece el número máximo de posibles vecinos más cercanos a considerar. Por defecto, se establece en 10.
gl: Establece o número máximo de posibles veciños máis próximos a considerar. Por defecto, establécese en 10.
nl: Zet het maximale aantal mogelijke dichtstbijzijnde buren. Standaard is dit 10.
pt: Define o número máximo de vizinhos mais próximos possíveis a serem considerados. Por padrão, é definido como 10.
ru: Задает максимальное количество ближайших соседей для рассмотрения при формировании модели. По умолчанию выбрано значение 10.
ta: கருத்தில் கொள்ள வேண்டிய அருகிலுள்ள அண்டை நாடுகளின் அதிகபட்ச எண்ணிக்கையை அமைக்கிறது. இயல்பாக, இது 10 ஆக அமைக்கப்பட்டுள்ளது.

# OptimPlot|
source: Mean squared error
de: Mittlerer quadratischer Fehler
es: Error cuadrado medio
gl: Erro cadrado medio
id: Rata-rata kesalahan kuadrat
nl: Gemiddelde kwadraatfout
pt: Erro quadrado médio
ru: Среднеквадратичная ошибка
ta: சராசரி சதுர பிழை

# OptimPlot|
source: Classification accuracy
de: Klassifikations-Genauigkeit
es: Precisión de la clasificación
gl: Precisión da clasificación
id: Akurasi klasifikasi
nl: Classificatie nauwkeurigheid
pt: Precisão da classificação
ru: Точность классификации
ta: வகைப்பாடு துல்லியம்

# OptimPlot|
source: For regression, Plots the number of nearest neighbors against the MSE of the model. Accuracy is assessed for the training (and validation) set. For classification, plots the number of nearest neighbors against the classification accuracy of the model. Accuracy is assessed for the training (and validation) set.
de: Für Regression, Zeigt die Anzahl der nächsten Nachbarn gegen den MSE des Modells. Die Genauigkeit wird für den Trainings- (und Validierungs)-satz bewertet. Für Klassifikation, Zeigt die Anzahl der nächsten Nachbarn gegen die Klassifikationsgenauigkeit des Modells. Die Genauigkeit wird für den Trainings- (und Validierungs)-satz bewertet.
es: Para la regresión, representa gráficamente el número de vecinos más cercanos frente al ECM (MSE) del modelo; y se evalúa la precisión del conjunto de adiestramiento (y validación). Para la clasificación, representa gráficamente el número de vecinos más cercanos frente a la precisión en la clasificación del modelo; y se evalúa la precisión del conjunto de adiestramiento (y validación).
gl: Para a regresión, representa graficamente o número de veciños máis próximos fronte ao ECM (MSE) do modelo; e avalíase a precisión do conxunto de ensaio (e validación). Para a clasificación, representa graficamente o número de veciños máis próximos fronte á precisión na clasificación do modelo; e avalíase a precisión do conxunto de ensaio (e validación).
id: Untuk regresi, memplot jumlah tetangga terdekat terhadap MSE model. Akurasi dinilai untuk set pelatihan (dan validasi). Untuk klasifikasi, memplot jumlah tetangga terdekat terhadap akurasi klasifikasi model. Akurasi dinilai untuk set pelatihan (dan validasi).
nl: Voor regressie, plot het aantal dichtstbijzijnde buren tegen de MSE van het model. Nauwkeurigheid wordt beoordeeld voor de training (en validatie) set. Voor classificatie, plot het aantal dichtstbijzijnde buren tegen de classificatie nauwkeurigheid van het model. Nauwkeurigheid wordt beoordeeld voor de training (en validatie) set.
pt: Para regressão, plota o número de vizinhos mais próximos em relação ao EQM do modelo. A precisão é avaliada para o conjunto de treinamento (e validação). Para classificação, plota o número de vizinhos mais próximos em relação à exatidão de classificação do modelo. A exatidão é avaliada para o conjunto de treinamento (e validação).
ru: При выполнении регрессии для каждого количества ближайших соседей выводит суммарное значение среднеквадратичной ошибки модели. При выполнении классификации выводит значение точности, оцененной по обучающей и валидационной выборкам.
ta: பின்னடைவைப் பொறுத்தவரை, மாதிரியின் MSE க்கு எதிராக அருகிலுள்ள அண்டை நாடுகளின் எண்ணிக்கையை திட்டமிடுகிறது. பயிற்சி (மற்றும் சரிபார்ப்பு) தொகுப்பிற்கு துல்லியம் மதிப்பிடப்படுகிறது. வகைப்பாட்டிற்கு, மாதிரியின் வகைப்பாடு துல்லியத்திற்கு எதிராக அருகிலுள்ள அண்டை நாடுகளின் எண்ணிக்கையை திட்டமிடுகிறது. பயிற்சி (மற்றும் சரிபார்ப்பு) தொகுப்பிற்கு துல்லியம் மதிப்பிடப்படுகிறது.

source: Weight function
de: Gewichtungsfunktion
es: Función de ponderación
gl: Función de ponderación
id: Fungsi berat badan
nl: Gewichtsfunctie
pt: Função de ponderação
ru: Функция весов
ta: எடை செயல்பாடு

# WeightFunction|
source: Shows how the weights are assigned as a function of the distance.
de: Zeigt, wie die Gewichte als Funktion der Distanz zugeordnet werden.
es: Muestra cómo se asignan las ponderaciones como una función de la distancia.
gl: Amosa como se asignan as ponderacións como unha función da distancia.
id: Menunjukkan bagaimana bobot ditetapkan sebagai fungsi jarak.
nl: Laat zien hoe de gewichten worden toegewezen als een functie van de afstand.
pt: Mostra como os pesos são atribuídos em função da distância.
ru: Показывает зависимость весов от расстояния.
ta: தூரத்தின் செயல்பாடாக எடைகள் எவ்வாறு ஒதுக்கப்படுகின்றன என்பதைக் காட்டுகிறது.

# ActivationFunctionPlot|
source: Activation function
de: Aktivierungsfunktion
es: Función de activación
gl: Función de activación
id: Fungsi aktivasi
nl: Activatiefunctie
pt: Função de ativação
ru: Функция активации
ta: செயல்படுத்தும் செயல்பாடு

# ActivationFunctionPlot|
source: Creates a plot of the activation function.
de: Erstellt ein Diagramm der Aktivierungsfunktion.
es: Genera un gráfico de la función de activación.
gl: Xera unha gráfica da función de activación.
id: Membuat plot fungsi aktivasi.
nl: Creëert een figuur van de activatiefunctie.
pt: Cria um gráfico da função de ativação.
ru: Строит график функции активации.
ta: செயல்படுத்தும் செயல்பாட்டின் சதித்திட்டத்தை உருவாக்குகிறது.

# AlgorithmicSettings|
source: Activation function
de: Aktivierungsfunktion
es: Función de activación
gl: Función de activación
id: Fungsi aktivasi
nl: Activatiefunctie
pt: Função de ativação
ru: Функция активации
ta: செயல்படுத்தும் செயல்பாடு

# AlgorithmicSettings|
source: Linear
es: Lineal
id: Linier
nl: Lineair
ta: நேரியல்

# AlgorithmicSettings|
source: Binary
de: Binär
es: Binario
gl: Binario
id: Biner
nl: Binair
pt: Binário
ru: Двоичная
ta: இருமம்

# AlgorithmicSettings|
source: Logistic sigmoid
de: Logistische Sigmoid
es: Sigmoide logística
gl: Sigmoide loxística
id: Sigmoid logistik
nl: Logistische sigmoïde
pt: Sigmoide logístico
ru: Сигмоидная
ta: லாசிச்டிக் சிக்மாய்டு

# AlgorithmicSettings|
source: Sine
de: Sinus
es: Seno
gl: Seno
id: Sinus
nl: Sinus
pt: Seno
ru: Синус
ta: செவ்வளை

# AlgorithmicSettings|
source: Inverse tangent
de: Arkustangens
es: Tangente inversa
gl: Tanxente inversa
id: Garis singgung terbalik
nl: Inverse tangens
pt: Tangente inversa
ru: Арктангенс
ta: தலைகீழ் தொடுகோடு

# AlgorithmicSettings|
source: Hyperbolic tangent
de: Hyperbolischer Tangens
es: Tangente hiperbólica
gl: Tanxente hiperbólica
id: Garis singgung hiperbolik
nl: Hyperbolische tangens
pt: Tangente hiperbólica
ru: Гиперб. тангенс
ta: ஐபர்போலிக் தொடுகோடு

# AlgorithmicSettings|
source: ReLU
ta: மீண்டும் தொடங்குங்கள்

# AlgorithmicSettings|
source: Softplus
ta: மென்பொருள்

# AlgorithmicSettings|
source: Softsign
ta: சாஃப்டைன்

# AlgorithmicSettings|
source: ELU
ta: எலு

# AlgorithmicSettings|
source: SiLU
ta: சக்தியின் ஆற்றல்

# AlgorithmicSettings|
source: Mish
ta: மிச்

# AlgorithmicSettings|
source: GeLU
ta: சேவ்

# AlgorithmicSettings|
source: Sets the activation function for the signal in each hidden layer. Available options are: - linear: *f(x) = x* - Binary: *f(x) = 0 if x < 0, 1 if x > 0 - Logistic sigmoid: *f(x) = 1 / (1 + e^(-x))* - Sine: *f(x) = sin(x)* - Cosine: *f(x) = cos(x)* - Inverse tangent: *f(x) = arctan(x)* - Hyperbolic tangent: *f(x) = tanh(x)* - ReLU: *f(x) = 0 if x < 0, x if x > 0* - Softplus: *f(x) = log(1 + e^x)* - Softsign: *f(x) = x / (abs(x) + 1)* - ELU: *f(x) = e^x - 1 if x <= 0, x if x > 0* - LReLU: *f(x) = 0.01 * x if x < 0, x if x > 0* - SiLU: *f(x) = x / (1 + e^(-x))* - Mish: *f(x) = x * tanh(log(1 + e^x))* - Gaussian: *f(x) = e * (-x^2)* - GeLU: *f(x) = 0.5 * x * (1 + tanh(sqrt(2 / pi) * (x + 0.044715 * x^3)))*
de: Setzt die Aktivierungsfunktion für das Signal in jeder verdeckten Schicht. Verfügbare Optionen sind: - Linear: *f(x) = x* - Binär: *f(x) = 0 falls x < 0, 1 falls x > 0 - Logistisches Sigmoid: *f(x) = 1 / (1 + e^(-x))* - Sinus: *f(x) = sin(x)* - Kosinus: *f(x) = cos(x)* - Arkustangens: *f(x) = arctan(x)* - Hyperbolischer Tangens: *f(x) = tanh(x)* - ReLU: *f(x) = 0 falls x < 0, x falls x > 0* - Softplus: *f(x) = log(1 + e^x)* - Softsign: *f(x) = x / (abs(x) + 1)* - ELU: *f(x) = e^x - 1 falls x <= 0, x falls x > 0* - LReLU: *f(x) = 0.01 * x falls x < 0, x falls x > 0* - SiLU: *f(x) = x / (1 + e^(-x))* - Mish: *f(x) = x * tanh(log(1 + e^x))* - Gaußsch: *f(x) = e * (-x^2)* - GeLU: *f(x) = 0,5 * x * (1 + tanh(sqrt(2 / pi) * (x + 0,044715 * x^3))*
es: Establece la función de activación para la señal en cada estrato oculto. Las opciones disponibles son: - Lineal: *f(x) = x* - Binaria: *f(x) = 0 if x < 0, 1 if x > 0 - Sigmoide logística: *f(x) = 1 / (1 + e^(-x))* - Seno: *f(x) = sin(x)* - Coseno: *f(x) = cos(x)* - Tangente inversa: *f(x) = arctan(x)* - Tangente hiperbólica: *f(x) = tanh(x)* - ReLU: *f(x) = 0 if x < 0, x if x > 0* - Softplus: *f(x) = log(1 + e^x)* - Softsign: *f(x) = x / (abs(x) + 1)* - ELU: *f(x) = e^x - 1 if x <= 0, x if x > 0* - LReLU: *f(x) = 0.01 * x if x < 0, x if x > 0* - SiLU: *f(x) = x / (1 + e^(-x))* - Mish: *f(x) = x * tanh(log(1 + e^x))* - Normal: *f(x) = e * (-x^2)* - GeLU: *f(x) = 0.5 * x * (1 + tanh(sqrt(2 / pi) * (x + 0.044715 * x^3)))*
gl: Establece a función de activación para o sinal en cada estrato oculto. As opcións dispoñibles son: - Linear: *f(x) = x* - Binaria: *f(x) = 0 if x < 0, 1 if x > 0 - Sigmoide loxística: *f(x) = 1 / (1 + e^(-x))* - Seno: *f(x) = sin(x)* - Coseno: *f(x) = cos(x)* - Tanxente inversa: *f(x) = arctan(x)* - Tanxente hiperbólica: *f(x) = tanh(x)* - ReLU: *f(x) = 0 if x < 0, x if x > 0* - Softplus: *f(x) = log(1 + e^x)* - Softsign: *f(x) = x / (abs(x) + 1)* - ELU: *f(x) = e^x - 1 if x <= 0, x if x > 0* - LReLU: *f(x) = 0.01 * x if x < 0, x if x > 0* - SiLU: *f(x) = x / (1 + e^(-x))* - Mish: *f(x) = x * tanh(log(1 + e^x))* - Normal: *f(x) = e * (-x^2)* - GeLU: *f(x) = 0.5 * x * (1 + tanh(sqrt(2 / pi) * (x + 0.044715 * x^3)))*
id: Mengatur fungsi aktivasi untuk sinyal di setiap lapisan tersembunyi. Opsi yang tersedia adalah: - linier: *f(x) = x* - Biner: *f(x) = 0 jika x < 0, 1 jika x > 0 - Sigmoid logistik: *f(x) = 1 / (1 + e^(-x))* - Sinus *f(x) = sin(x)* - Cosinus: *f(x) = cos(x)* - Garis singgung terbalik: *f(x) = arctan(x)* - Garis singgung hiperbolik: *f(x) = tanh(x)* - ReLU: *f(x) = 0 jika x < 0, x jika x > 0* - Softplus: *f(x) = log(1 + e^x)* - Softsign: *f(x) = x / (abs(x) + 1)* - ELU: *f(x) = e^x - 1 jika x <= 0, x jika x > 0* - LReLU: *f(x) = 0.01 * x jika x < 0, x jika x > 0* - SiLU: *f(x) = x / (1 + e^(-x))* - Mish: *f(x) = x * tanh(log(1 + e^x))* - Gaussian: *f(x) = e * (-x^2)* - GeLU: *f(x) = 0.5 * x * (1 + tanh(sqrt(2 / pi) * (x + 0.044715 * x^3)))))
nl: Stelt de activeringsfunctie in voor het signaal in elke verborgen laag. Beschikbare opties zijn: - lineair: *f(x) = x* - Binair: *f(x) = 0 als x < 0, 1 als x > 0 - Logistische sigmoïde: *f(x) = 1 / (1 + e^(-x))* - Sinus: *f(x) = sin(x)* - Cosinus: *f(x) = cos(x)* - Inverse tangens: *f(x) = arctan(x)* - Hyperbolische tangens: *f(x) = tanh(x)* - ReLU: *f(x) = 0 als x < 0, x als x > 0* - Softplus: *f(x) = log(1 + e^x)* - Softsign: *f(x) = x / (abs(x) + 1)* - ELU: *f(x) = e^x - 1 als x <= 0, x als x > 0* - LReLU: *f(x) = 0,01 * x als x < 0, x als x > 0* - SiLU: *f(x) = x / (1 + e^(-x))* - Mish: *f(x) = x * tanh(log(1 + e^x))* - Gaussisch: *f(x) = e * (-x^2)* - GeLU: *f(x) = 0,5 * x * (1 + tanh(sqrt(2 / pi) * (x + 0,044715 * x^3)))*
pt: Define a função de ativação do sinal em cada camada oculta. As opções disponíveis são: - Linear: *f(x) = x* - Binária: *f(x) = 0 se x < 0, 1 se x > 0 - Sigmóide logística: *f(x) = 1 / (1 + e^(-x))* - Seno: *f(x) = sen(x)* - Cosseno: *f(x) = cos(x)* - Tangente inversa: *f(x) = arctan(x)* - Tangente hiperbólica: *f(x) = tanh(x)* - ReLU: *f(x) = 0 se x < 0, x se x > 0* - Softplus: *f(x) = log(1 + e^x)* - Softsign: *f(x) = x / (abs(x) + 1)* - ELU: *f(x) = e^x - 1 se x <= 0, x se x > 0* - LReLU: *f(x) = 0,01 * x se x < 0, x se x > 0* - SiLU: *f(x) = x / (1 + e^(-x))* - Mish: *f(x) = x * tanh(log(1 + e^x))* - Gaussiana: *f(x) = e * (-x^2)* - GeLU: *f(x) = 0,5 * x * (1 + tanh(sqrt(2 / pi) * (x + 0,044715 * x^3)))*
ru: Задает функцию активации для сигнала в каждом скрытом слое. Доступные варианты: - Линейная: *f(x) = x* - Двоичная: *f(x) = 0 if x < 0, 1 if x > 0 - Сигмоидная: *f(x) = 1 / (1 + e^(-x))* - Синус: *f(x) = sin(x)* - Косинус: *f(x) = cos(x)* - Арктангенс: *f(x) = arctan(x)* - Гиперб. тангенс: *f(x) = tanh(x)* - ReLU: *f(x) = 0 if x < 0, x if x > 0* - Softplus: *f(x) = log(1 + e^x)* - Softsign: *f(x) = x / (abs(x) + 1)* - ELU: *f(x) = e^x - 1 if x <= 0, x if x > 0* - LReLU: *f(x) = 0.01 * x if x < 0, x if x > 0* - SiLU: *f(x) = x / (1 + e^(-x))* - Mish: *f(x) = x * tanh(log(1 + e^x))* - Гауссова: *f(x) = e * (-x^2)* - GeLU: *f(x) = 0.5 * x * (1 + tanh(sqrt(2 / pi) * (x + 0.044715 * x^3)))*
ta: ஒவ்வொரு மறைக்கப்பட்ட அடுக்கிலும் சமிக்ஞைக்கான செயல்படுத்தும் செயல்பாட்டை அமைக்கிறது. கிடைக்கும் விருப்பங்கள்: - நேரியல்: *f (x) = ஃச் * - பைனரி: *f (x) = 0 என்றால் ஃச் <0, 1 என்றால் x> 0 என்றால் - லாசிச்டிக் சிக்மாய்டு: *f (x) = 1 / (1 + e^(- x)) * - sine: *f (x) = ஊழ்கம் (x) * - கொசைன்: *f (x) = cos (x) * - தலைகீழ் தொடுகோடு: *f (x) = arctan (x) * - ஐபர்போலிக் தொடுகோடு: *f (x) = tanh (x) * - relu: *f (x) = 0 என்றால் ஃச் <0, ஃச் என்றால் x> 0 * - சாப்ட்ப்ளச்: *f (x) = பதிவு (1 + e^x) * - softsign: *f (x) = ஃச் / (abs (x) + 1) * - ELU: *f (x) = e^x - 1 என்றால் ஃச் <= 0, ஃச் என்றால் x> 0 * - lrelu: * f (x) = 0.01 * ஃச் என்றால் ஃச் <0, ஃச் என்றால் x> 0 * - சிலு: *f (x) = ஃச் / (1 + e^(- x)) * - மிச்: * f (x) = ஃச் * tanh (பதிவு (1 + e^x)) * - காசியன்: * f (x) = இ * (-x^2) * .

# AlgorithmicSettings|
source: Algorithm
de: Algorithmus
es: Algoritmo
gl: Algoritmo
id: Algoritma
nl: Algoritme
pt: Algoritmo
ta: படிமுறை

# AlgorithmicSettings|
source: Backpropagation
es: Propagación hacia atrás
gl: Propagación cara atrás
nl: Terugwaartse propagatie
pt: Retropropagação
ru: Обратное распространение
ta: பின்வாங்கல்

# AlgorithmicSettings|
source: grprop-sag
ta: க்ரோப் கேச்

# AlgorithmicSettings|
source: Sets the algorithm for the network training. The backpropagation option is standard for training neural networks, but other options are `rprop+` (default) for resilient backpropagation with backtracing, `rprop-` for resilient backpropagation without backtracing, `gprop-sag` for the globally convergent algorithm that modifies the learning rate associated with the smallest absolute gradient, or `gprop-slr` for the globally convergent algorithm that modifies the learning rate associated with the smallest learning rate itself.
es: Establece el algoritmo para el adiestramiento de la red. La opción de propagación hacia atrás es la típica de las redes neuronales de adiestramiento, pero otras opciones son `rprop+` (predeterminada) para la propagación hacia atrás resiliente con trazado hacia atrás, `rprop-` para la propagación hacia atrás resiliente sin trazado hacia atrás, `gprop-sag` para el algoritmo globalmente convergente que modifica la tasa de aprendizaje asociada al gradiente absoluto más pequeño, o `gprop-slr` para el algoritmo globalmente convergente que modifica la tasa de aprendizaje asociada a la propia tasa de aprendizaje más pequeña.
gl: Establece o algoritmo para o ensaio da rede. A opción de propagación cara atrás é a típica das redes neuronais de ensaio, pero outras opcións son `rprop+` (predeterminada) para a propagación cara atrás resiliente con trazado cara atrás, `rprop-` para a propagación cara atrás resiliente sen trazado cara atrás, `gprop-sag` para o algoritmo globalmente converxente que modifica a taxa de aprendizaxe asociada ao gradiente absoluto máis pequeno, ou `gprop-slr` para o algoritmo globalmente converxente que modifica a taxa de aprendizaxe asociada á propia taxa de aprendizaxe máis pequena.
nl: Stelt het algoritme voor de netwerktraining in. De backpropagation optie is standaard voor het trainen van neurale netwerken, maar andere opties zijn `rprop+` (standaard) voor veerkrachtige backpropagation met backtracing, `rprop-` voor veerkrachtige backpropagation zonder backtracing, `gprop-sag` voor het globaal convergente algoritme dat de leersnelheid wijzigt die geassocieerd is met de kleinste absolute gradiënt, of `gprop-slr` voor het globaal convergente algoritme dat de leersnelheid wijzigt die geassocieerd is met de kleinste leersnelheid zelf.
pt: Define o algoritmo para o treinamento da rede. A opção de retropropagação é padrão para o treinamento de redes neurais, mas outras opções são `rprop+` (padrão) para retropropagação resiliente com retrotraçamento, `rprop-` para retropropagação resiliente sem retrotraçamento, `gprop-sag` para o algoritmo globalmente convergente que modifica a taxa de aprendizado associada ao menor gradiente absoluto, ou `gprop-slr` para o algoritmo globalmente convergente que modifica a taxa de aprendizado associada à própria menor taxa de aprendizado.
ru: Задает алгоритм обучения нейронной сети. Стандартным для нейронных сетей является алгоритм обратного распространения ошибки, но также доступны опции "rprop+" (выбрана по умолчанию) для устойчивого обратного распространения с возвратом, "rprop-" для устойчивого обратного распространения без возврата, "gprop-sag" для глобально сходимого алгоритма, изменяющего скорость обучения в соответствии с наименьшим абсолютным значением градиента, и "gprop-slr" для глобально сходимого алгоритма, изменяющего скорость обучения в соответствии с наименьшим значением скорости обучения как таковым.
ta: பிணைய பயிற்சிக்கான வழிமுறையை அமைக்கிறது. நரம்பியல் நெட்வொர்க்குகளுக்கு பயிற்சியளிப்பதற்கான பேக்ரோபாகேசன் விருப்பம் தரமானது, ஆனால் பிற விருப்பங்கள் `rprop+` (இயல்புநிலை) ஆகும், அவை பின்னடைவுடன் நெகிழக்கூடிய பின்னடைவு, `rprop-` பின்னடைவு இல்லாமல் நெகிழக்கூடிய பின்னடைவு,` சிபிஆர்ஓபி-சாக்` மிகச்சிறிய முழுமையான சாய்வுடன் தொடர்புடைய விகிதம் அல்லது உலகளவில் ஒன்றிணைந்த வழிமுறைக்கு `சிபிஆர்ஓபி-எச்.எல்.ஆர்.

# AlgorithmicSettings|
source: Learning rate
de: Lernrate
es: Tasa de aprendizaje
gl: Taxa de aprendizaxe
id: Tingkat pembelajaran
nl: Leertempo
pt: Taxa de aprendizado
ru: Скорость обучения
ta: கற்றல் வீதம்

# AlgorithmicSettings|
source: The learning rate used by the backpropagation algorithm.
de: Die vom Backpropagation-Algorithmus verwendete Lernrate.
es: La tasa de aprendizaje que utiliza el algoritmo de propagación hacia atrás.
gl: A taxa de aprendizaxe que utiliza o algoritmo de propagación cara atrás.
id: Laju pembelajaran yang digunakan oleh algoritma backpropagation.
nl: Het leertempo van het terugwaartse propagatie algoritme.
pt: A taxa de aprendizado usada pelo algoritmo de retropropagação.
ru: Скорость обучения, используемая алгоритмом обратного распространения ошибки.
ta: பேக்ரோபாகேசன் வழிமுறை பயன்படுத்தும் கற்றல் விகிதம்.
