Repository: jasp-stats/jaspMachineLearning
Catalog: po/QML-*.po
Languages: de, es, gl, id, nl, pt, ru, ta

# mlClusteringFuzzyCMeans|
source: Fuzzy c-means clustering is a soft partitioning method that provides an output that contains the degree of association for each observation to each cluster. This makes it possible for data observations to be partially assigned to multiple clusters and give a degree of confidence about cluster membership. Fuzzy c-means' approach is quite similar to that of k-means clustering, apart from its soft approach. ### Assumptions - The data consists of continuous variables. - (Normally distributed data aids the clustering process).
es: La Conglomeración de Medias C Borrosas es un fino método de partición que proporciona un resultado que contiene el grado de asociación de cada observación a cada conglomerado. Esto hace posible que las observaciones de los datos sean asignadas parcialmente a múltiples conglomerados, y que se les dé un grado de confianza sobre su pertenencia a un conglomerado. El enfoque de las medias C borrosas es bastante similar al de la conglomeración de medias K, aparte de su fino enfoque. ### Supuestos - Los datos consisten en variables continuas. - (Datos con distribución de probabilidad Normal ayudan en el proceso de conglomeración).
gl: A Conglomeración de Medias C Borrosas é un fino método de partición que proporciona un resultado que contén o grao de asociación de cada observación a cada conglomerado. Isto fai posible que as observacións dos datos sexan asignadas parcialmente a múltiples conglomerados, e que se lles dea un grao de confianza sobre a súa pertenza a un conglomerado. O enfoque das medias C borrosas é bastante similar ao da conglomeración de medias K, aparte do seu fino enfoque. ### Supostos - Os datos consisten en variables continuas. - (Datos con distribución de probabilidade Normal axudan no proceso de conglomeración).
id: Fuzzy c-means clustering adalah metode soft partitioning yang memberikan output yang berisi derajat asosiasi untuk setiap observasi ke setiap cluster. Hal ini memungkinkan observasi data untuk ditugaskan sebagian ke beberapa klaster dan memberikan tingkat kepercayaan tentang keanggotaan klaster. Pendekatan Fuzzy c-means sangat mirip dengan k-means clustering, selain dari pendekatannya yang lebih lunak. ### Asumsi-asumsi - Data terdiri dari variabel kontinu. - (Data yang terdistribusi secara normal akan membantu proses pengelompokan).
nl: Fuzzy c-means clustering is een zachte partitioneringsmethode die een output oplevert die de mate van associatie voor elke observatie met elk cluster bevat. Dit maakt het mogelijk om gegevenswaarnemingen gedeeltelijk toe te wijzen aan meerdere clusters en een mate van vertrouwen te geven over het clustermodel. De benadering van Fuzzy c-means lijkt veel op die van k-means clustering, afgezien van de zachte benadering. ### Aannames - De data bestaan uit continue variabelen. - (Normaal verdeelde gegevens helpen bij het clusteren).
pt: O agrupamento c-mpédias difuso é um método de particionamento suave que fornece uma saída contendo o grau de associação de cada observação a cada agrupamento. Isso possibilita que observações de dados sejam parcialmente atribuídas a múltiplos clusters e fornece um grau de confiança sobre a associação a agrupamentos. A abordagem do agrupamento c-médias difuso é bastante semelhante à do agrupamento k-médias, exceto por sua abordagem suave. ### Suposições - Os dados consistem em variáveis contínuas. - (Dados com distribuição normal auxiliam no processo de agrupamento).
ta: தெளிவற்ற சி-மெீன்ச் கிளச்டரிங் என்பது ஒரு மென்மையான பகிர்வு முறையாகும், இது ஒவ்வொரு கிளச்டருக்கும் ஒவ்வொரு அவதானிப்பிற்கும் சங்கத்தின் அளவைக் கொண்ட ஒரு வெளியீட்டை வழங்குகிறது. இது தரவு அவதானிப்புகள் பல கொத்துக்களுக்கு ஓரளவு ஒதுக்கப்படுவதை சாத்தியமாக்குகிறது மற்றும் கிளச்டர் உறுப்பினர் குறித்த நம்பிக்கையை அளிக்கிறது. தெளிவற்ற சி-மெீன்ச் அணுகுமுறை அதன் மென்மையான அணுகுமுறையைத் தவிர, கே-ஐன்ச் கிளச்டரிங் உடன் மிகவும் ஒத்திருக்கிறது. ### அனுமானங்கள் - தரவு தொடர்ச்சியான மாறிகள் கொண்டது. - (பொதுவாக விநியோகிக்கப்பட்ட தரவு கிளச்டரிங் செயல்முறைக்கு உதவுகிறது).

# mlClusteringHierarchical|
source: Hierarchical clustering is a hard partitioning algorithm which aims to partition data into several clusters, where each observation belongs to only one group. The data is divided in such a way that the degree of similarity between two data observations is maximal if they belong to the same group and minimal if not. ### Assumptions - The data consists of continuous variables. - (Normally distributed data aids the clustering process).
es: El de Conglomeración Jerárquica es un difícil algoritmo de partición que ayuda a dividir los datos en varios conglomerados, en el que cada observación pertenece solo a un grupo. Los datos se dividen de tal modo que el grado de similitud entre dos observaciones de los datos sea máxima si pertenecen al mismo grupo, y mínima si no. ### Supuestos - Los datos consisten en variables continuas. - (Datos con distribución de probabilidad Normal ayudan en el proceso de conglomeración).
gl: O de Conglomeración Xerárquica é un difícil algoritmo de partición que axuda a dividir os datos en varios conglomerados, no que cada observación pertence só a un grupo. Os datos divídense de tal xeito que o grao de semellanza entre dúas observacións dos datos sexa máxima se pertencen ao mesmo grupo, e mínima se non. ### Supostos - Os datos consisten en variables continuas. - (Datos con distribución de probabilidade Normal axudan no proceso de conglomeración).
id: Hierarchical clustering adalah algoritma hard partitioning yang bertujuan untuk mempartisi data ke dalam beberapa cluster, di mana setiap observasi hanya menjadi bagian dari satu kelompok. Data dibagi sedemikian rupa sehingga tingkat kemiripan antara dua pengamatan data adalah maksimal jika mereka termasuk dalam kelompok yang sama dan minimal jika tidak. ### Asumsi - Data terdiri dari variabel kontinu. - (Data yang terdistribusi secara normal akan membantu proses pengelompokan).
nl: Hiërarchisch clusteren is een hard partitioneringsalgoritme dat erop gericht is gegevens te verdelen in verschillende clusters, waarbij elke observatie slechts tot één groep behoort. De gegevens worden zo verdeeld dat de mate van gelijkenis tussen twee gegevenswaarnemingen maximaal is als ze tot dezelfde groep behoren en minimaal als dat niet het geval is. ### Aannames - De data bestaan uit continue variabelen. - (Normaal verdeelde gegevens helpen bij het clusteren).
pt: O agrupamento hierárquico é um algoritmo de particionamento rígido que visa particionar os dados em vários grupos, onde cada observação pertence a apenas um grupo. Os dados são divididos de forma que o grau de similaridade entre duas observações seja máximo se pertencerem ao mesmo grupo e mínimo se não pertencerem. ### Suposições - Os dados consistem em variáveis contínuas. - (Dados com distribuição normal auxiliam no processo de agrupamento).
ta: படிநிலை கிளச்டரிங் என்பது ஒரு கடினமான பகிர்வு வழிமுறையாகும், இது தரவை பல கிளச்டர்களாகப் பிரிப்பதை நோக்கமாகக் கொண்டுள்ளது, அங்கு ஒவ்வொரு அவதானிப்பும் ஒரே ஒரு குழுவிற்கு மட்டுமே சொந்தமானது. இரண்டு தரவு அவதானிப்புகளுக்கிடையேயான ஒற்றுமையின் அளவு ஒரே குழுவைச் சேர்ந்தால் அதிகபட்சம் மற்றும் இல்லையென்றால் குறைந்தது என தரவு பிரிக்கப்பட்டுள்ளது. ### அனுமானங்கள் - தரவு தொடர்ச்சியான மாறிகள் கொண்டது. - (பொதுவாக விநியோகிக்கப்பட்ட தரவு கிளச்டரிங் செயல்முறைக்கு உதவுகிறது).

# mlClusteringKMeans|
source: Neighborhood-Based clustering methods are a set of hard partitioning algorithm which aims to partition data into several clusters, where each observation belongs to only one group. The data is divided in such a way that the degree of similarity between two data observations is maximal if they belong to the same group and minimal if not. ### Assumptions - The data consists of continuous variables. - (Normally distributed data aids the clustering process).
es: Los métodos de Conglomeración Basada en la Vecindad son un conjunto de difíciles algoritmos de partición que ayudan a dividir los datos en varios conglomerados, en los que cada observación pertenece solo a un grupo. Los datos se dividen de tal modo que el grado de similitud entre dos observaciones de los datos sea máxima si pertenecen al mismo grupo, y mínima si no. ### Supuestos - Los datos consisten en variables continuas. - (Datos con distribución de probabilidad Normal ayudan en el proceso de conglomeración).
gl: Os métodos de Conglomeración Baseada na Veciñanza son un conxunto de difíciles algoritmos de partición que axudan a dividir os datos en varios conglomerados, nos que cada observación pertence só a un grupo. Os datos divídense de tal xeito que o grao de semellanza entre dúas observacións dos datos sexa máxima se pertencen ao mesmo grupo, e mínima se non. ### Supostos - Os datos consisten en variables continuas. - (Datos con distribución de probabilidade Normal axudan no proceso de conglomeración).
id: Metode pengelompokan berbasis lingkungan adalah sekumpulan algoritma hard partitioning yang bertujuan untuk mempartisi data ke dalam beberapa cluster, di mana setiap observasi hanya menjadi bagian dari satu kelompok. Data dibagi sedemikian rupa sehingga tingkat kemiripan antara dua pengamatan data adalah maksimal jika mereka termasuk dalam kelompok yang sama dan minimal jika tidak. ### Asumsi - Data terdiri dari variabel kontinu. - (Data yang terdistribusi secara normal akan membantu proses pengelompokan).
nl: Op nabijheid gebaseerde clustermethoden zijn een reeks harde partitioneringsalgoritmen die tot doel hebben gegevens te verdelen in verschillende clusters, waarbij elke observatie slechts tot één groep behoort. De gegevens worden zo verdeeld dat de mate van gelijkenis tussen twee gegevenswaarnemingen maximaal is als ze tot dezelfde groep behoren en minimaal als dat niet het geval is. ### Aannames - De data bestaan uit continue variabelen. - (Normaal verdeelde gegevens helpen bij het clusteren).
pt: Métodos de agrupamento baseados em vizinhança são um conjunto de algoritmos de particionamento rígido que visam particionar os dados em vários grupos, onde cada observação pertence a apenas um grupo. Os dados são divididos de tal forma que o grau de similaridade entre duas observações de dados é máximo se elas pertencem ao mesmo grupo e mínimo se não pertencem. ### Suposições - Os dados consistem em variáveis contínuas. - (Dados com distribuição normal auxiliam no processo de agrupamento).
ru: Кластеризация, основанная на соседстве - это набор алгоритмов четкого разделения, дробящих исходные данные на несколько кластеров, при этом каждое из наблюдений приписывается строго к одному из этих кластеров. Выборка разделяется так, чтобы степень сходства между двумя наблюдениями, относящимися к одному и тому же кластеру, была максимальной, а к разным кластерам - минимальной. ### Допущения - Выборка состоит из непрерывных переменных. - (Процесс кластеризации проходит наилучшим образом при нормально распределенных данных).
ta: அண்டை அடிப்படையிலான கிளச்டரிங் முறைகள் கடினமான பகிர்வு வழிமுறையின் தொகுப்பாகும், இது தரவை பல கிளச்டர்களாகப் பிரிப்பதை நோக்கமாகக் கொண்டுள்ளது, அங்கு ஒவ்வொரு அவதானிப்பும் ஒரே ஒரு குழுவிற்கு மட்டுமே சொந்தமானது. இரண்டு தரவு அவதானிப்புகளுக்கிடையேயான ஒற்றுமையின் அளவு ஒரே குழுவைச் சேர்ந்தால் அதிகபட்சம் மற்றும் குறைந்தது இல்லையென்றால் தரவு பிரிக்கப்பட்டுள்ளது. ### அனுமானங்கள் - தரவு தொடர்ச்சியான மாறிகள் கொண்டது. - (பொதுவாக விநியோகிக்கப்பட்ட தரவு கிளச்டரிங் செயல்முறைக்கு உதவுகிறது).

# mlClusteringRandomForest|
source: Random Forest clustering is a hard partitioning algorithm which aims to partition data into several clusters, where each observation belongs to only one group. This clustering method uses the Random Forest algorithm in an unsupervised way, with the outcome variable 'y' set to NULL. The Random Forest algorithm generates a proximity matrix which gives an estimate of the distance between observations based on the frequency of observations ending up in the same leaf node. ### Assumptions - The data consists of continuous variables. - (Normally distributed data aids the clustering process).
es: La Conglomeración en Bosques Aleatorios es un difícil algoritmo de partición que ayuda a dividir los datos en varios conglomerados, en los que cada observación pertenece solo a un grupo. Este método de conglomeración usa el algoritmo de Bosques Aleatorios de modo no supervisado, con la variable de resultado 'y' fijada en NULL. El algoritmo de Bosques Aleatorios genera una matriz de proximidad que proporciona una estimación de la distancia entre las observaciones basada en la frecuencia de las observaciones que acaban en el mismo nodo de la hoja. ### Supuestos - Los datos consisten en variables continuas. - (Datos con distribución de probabilidad Normal ayudan en el proceso de conglomeración).
gl: A Conglomeración en Bosques Aleatorios é un difícil algoritmo de partición que axuda a dividir os datos en varios conglomerados, nos que cada observación pertence só a un grupo. Este método de conglomeración usa o algoritmo de Bosques Aleatorios de xeito non supervisado, coa variable de resultado 'y' fixada en NULL. O algoritmo de Bosques Aleatorios xera unha matriz de proximidade que proporciona unha estimación da distancia entre as observacións baseada na frecuencia das observacións que rematan no mesmo nodo da folla. ### Supostos - Os datos consisten en variables continuas. - (Datos con distribución de probabilidade Normal axudan no proceso de conglomeración).
id: Clustering Random Forest adalah algoritma hard partitioning yang bertujuan untuk mempartisi data ke dalam beberapa cluster, di mana setiap observasi hanya menjadi bagian dari satu kelompok. Metode pengelompokan ini menggunakan algoritma Random Forest dengan cara yang tidak terawasi, dengan variabel hasil 'y' diatur ke NULL. Algoritma Random Forest menghasilkan matriks kedekatan yang memberikan estimasi jarak antar observasi berdasarkan frekuensi observasi yang berakhir pada leaf node yang sama. ### Asumsi-asumsi - Data terdiri dari variabel-variabel kontinu. - (Data yang terdistribusi normal akan membantu proses pengelompokan).
nl: Random Forest-clustering is een hard partitioneringsalgoritme dat erop gericht is gegevens te verdelen in verschillende clusters, waarbij elke observatie slechts tot één groep behoort. Deze clustermethode gebruikt het Random Forest-algoritme zonder toezicht, waarbij de uitkomstvariabele 'y' is ingesteld op NULL. Het Random Forest-algoritme genereert een nabijheidsmatrix die een schatting geeft van de afstand tussen waarnemingen op basis van de frequentie waarmee waarnemingen in dezelfde bladknoop terechtkomen. ### Aannames - De data bestaan uit continue variabelen. - (Normaal verdeelde gegevens helpen bij het clusteren).
pt: O agrupamento Floresta Aleatória é um algoritmo de particionamento rígido que visa particionar os dados em vários agrupamentos, onde cada observação pertence a apenas um grupo. Este método de agrupamento utiliza o algoritmo Random Forest de forma não supervisionada, com a variável de resultado 'y' definida como NULL. O algoritmo Random Forest gera uma matriz de proximidade que fornece uma estimativa da distância entre as observações com base na frequência das observações que terminam no mesmo nó-folha. ### Suposições - Os dados consistem em variáveis contínuas. - (Dados com distribuição normal auxiliam no processo de agrupamento).
ta: ரேண்டம் ஃபாரச்ட் கிளச்டரிங் என்பது ஒரு கடினமான பகிர்வு வழிமுறையாகும், இது தரவை பல கிளச்டர்களாகப் பிரிப்பதை நோக்கமாகக் கொண்டுள்ளது, அங்கு ஒவ்வொரு அவதானிப்பும் ஒரே ஒரு குழுவிற்கு மட்டுமே சொந்தமானது. இந்த கிளச்டரிங் முறை சீரற்ற வன வழிமுறையை மேற்பார்வை செய்யப்படாத வழியில் பயன்படுத்துகிறது, விளைவு மாறி 'ஒய்' ஐ பூச்யமாக அமைக்கவும். சீரற்ற வன வழிமுறை ஒரு அருகிலுள்ள மேட்ரிக்சை உருவாக்குகிறது, இது ஒரே இலை முனையில் முடிவடையும் அவதானிப்புகளின் அதிர்வெண்ணின் அடிப்படையில் அவதானிப்புகளுக்கு இடையிலான தூரத்தை மதிப்பிடுகிறது. ### அனுமானங்கள் - தரவு தொடர்ச்சியான மாறிகள் கொண்டது. - (பொதுவாக விநியோகிக்கப்பட்ட தரவு கிளச்டரிங் செயல்முறைக்கு உதவுகிறது).

# mlPrediction|
source: Cases
de: Fälle
es: Casos
gl: Casos
id: Kasus
nl: Gevallen
pt: Casos
ru: Случаи от
ta: வழக்குகள்

# mlPrediction|
source: Add features
de: Merkmale hinzufügen
es: Añadir características
gl: Engadir características
id: Menambahkan fitur
nl: Voeg kenmerken toe
pt: Adicionar características
ru: Добавить признаки
ta: அம்சங்களைச் சேர்க்கவும்

# mlPrediction|
source: Explain predictions
de: Vorhersagen erklären
es: Explicar las predicciones
gl: Explicar as predicións
id: Menjelaskan prediksi
nl: Verklaar voorspellingen
pt: Explicar previsões
ru: Объяснить предсказания
ta: கணிப்புகளை விளக்குங்கள்

# mlRegressionBoosting|
source: Boosting works by sequentially adding features to an decision tree ensemble, each one correcting its predecessor. Boosting tries to fit the new feature to the residual errors made by the previous feature. ### Assumptions - The target variable is a continuous variable. - The feature variables consist of continuous, nominal, or ordinal variables.
es: La Potenciación (Boosting) funciona añadiendo secuencialmente características a un conjunto de árboles de decisión, cada una corrigiendo a su predecesora. La Potenciación trata de ajustar la nueva característica a los errores residuales cometidos por la característica previa. ### Supuestos - La variable objetivo es una variable continua. - Las variables de características consisten en variables continuas, nominales u ordinales.
gl: A Potenciación (Boosting) funciona engadindo secuencialmente características a un conxunto de árbores de decisión, cada unha corrixindo a súa predecesora. A Potenciación trata de axustar a nova característica aos erros residuais cometidos pola característica previa. ### Supostos - A variable obxectivo é unha variable continua. - As variables de características consisten en variables continuas, nominais ou ordinais.
id: Boosting bekerja dengan menambahkan fitur secara berurutan ke dalam ansambel pohon keputusan, masing-masing fitur mengoreksi fitur sebelumnya. Boosting mencoba menyesuaikan fitur baru dengan sisa kesalahan yang dibuat oleh fitur sebelumnya. ### Asumsi-asumsi - Variabel target adalah variabel kontinu. - Variabel fitur terdiri dari variabel kontinu, nominal, atau ordinal.
nl: Boosting werkt door achtereenvolgens kenmerken toe te voegen aan een beslissingsboomensemble, waarbij elk kenmerk zijn voorganger corrigeert. Boosting probeert het nieuwe kenmerk aan te passen aan de resterende fouten die door het vorige kenmerk zijn gemaakt. ### Aannames - De doelvariabele is een continue variabele. - De kenmerken bestaan uit continue, nominale of ordinale variabelen.
pt: O Boosting funciona adicionando características sequencialmente a um conjunto de árvores de decisão, cada uma corrigindo a anterior. O Boosting tenta ajustar a nova característica aos erros residuais cometidos pela característica anterior. ### Suposições - A variável alvo é uma variável contínua. - As variáveis de característica consistem em variáveis contínuas, nominais ou ordinais.
ru: Метод бустинга работает путем добавления признаков в ансамбль деревьев решений, который каждый раз корректирует своего предшественника. Бустинг пытается подогнать новый признак к остаточной ошибке, сделанной предыдущим признаком. ### Допущения - Целевая переменная является непрерывной. - Признаки могут быть непрерывными, номинальными или порядковыми переменными.
ta: ஒரு முடிவு மர குழுமத்திற்கு தொடர்ச்சியாக அம்சங்களைச் சேர்ப்பதன் மூலம் அதிகரிக்கும் பணிகள், ஒவ்வொன்றும் அதன் முன்னோடிகளை சரிசெய்கின்றன. முந்தைய அம்சத்தால் செய்யப்பட்ட எஞ்சிய பிழைகளுக்கு புதிய அம்சத்தை பொருத்த முயற்சிக்கிறது. ### அனுமானங்கள் - இலக்கு மாறி தொடர்ச்சியான மாறி. - அம்ச மாறிகள் தொடர்ச்சியான, பெயரளவு அல்லது சாதாரண மாறிகள் கொண்டவை.

# mlRegressionBoosting|
source: The loss function used.
de: Die verwendete Verlustfunktion.
es: La función de pérdida utilizada.
gl: A función de perda utilizada.
id: Fungsi kehilangan yang digunakan.
nl: De gebruikte verliesfunctie.
pt: A função de perda usada.
ta: பயன்படுத்தப்படும் இழப்பு செயல்பாடு.
