Repository: jasp-stats/jaspMachineLearning
Catalog: po/QML-*.po
Languages: de, es, gl, id, nl, pt, ru, ta

# mlClassificationBoosting|
source: Boosting works by sequentially adding features to an decision tree ensemble, each one correcting its predecessor. However, instead of changing the weights for every incorrect classified observation at every iteration, Boosting method tries to fit the new feature to the residual errors made by the previous feature. ### Assumptions - The target variable is a nominal or ordinal variable. - The feature variables consist of continuous, nominal, or ordinal variables.
de: Boosting funktioniert durch sequentielles Hinzufügen von Merkmalen zu einem Entscheidungsbaum-Ensemble; jedes verbessert seinen Vorgänger. Anstatt die Gewichte für jede falsch klassifizierte Beobachtung bei jeder Iteration zu ändern, versucht die Boosting-Methode, das neue Merkmal anhand der residuellen Fehler des vorherigen Merkmals anzupassen. ### Annahmen - Die Zielvariable ist eine nominale oder ordinale Variable. - Die Merkmalsvariablen bestehen aus kontinuierlichen, nominalen oder ordinalen Variablen.
es: La Potenciación (Boosting) funciona añadiendo secuencialmente características a un conjunto de árboles de decisión, cada una corrigiendo a su predecesora. Sin embargo, en lugar de cambiar las ponderaciones para cada observación clasificada incorrectamente en cada iteración, el método de Potenciación trata de ajustar la nueva característica a los errores residuales cometidos por la característica previa. ### Supuestos - La variable objetivo es una variable nominal u ordinal. - Las variables de características consisten en variables continuas, nominales u ordinales.
gl: A Potenciación (Boosting) funciona engadindo secuencialmente características a un conxunto de árbores de decisión, cada unha corrixindo a súa predecesora. Porén, en troques de cambiar as ponderacións para cada observación clasificada incorrectamente en cada iteración, o método de Potenciación trata de axustar a nova característica aos erros residuais cometidos pola característica previa. ### Supostos - A variable obxectivo é unha variable nominal ou ordinal. - As variables de características consisten en variables continuas, nominais ou ordinais.
id: Boosting bekerja dengan menambahkan fitur secara berurutan ke dalam ansambel pohon keputusan, masing-masing fitur mengoreksi fitur sebelumnya. Namun, alih-alih mengubah bobot untuk setiap observasi yang diklasifikasikan secara salah pada setiap iterasi, metode Boosting mencoba menyesuaikan fitur baru dengan sisa kesalahan yang dibuat oleh fitur sebelumnya. ### Asumsi - Variabel target adalah variabel nominal atau ordinal. - Variabel fitur terdiri dari variabel kontinu, nominal, atau ordinal.
nl: Boosting werkt door achtereenvolgens kenmerken toe te voegen aan een beslissingsboomensemble, waarbij elk kenmerk zijn voorganger corrigeert. Maar in plaats van de gewichten voor elke onjuist geclassificeerde observatie bij elke iteratie te wijzigen, probeert de boostmethode de nieuwe eigenschap aan te passen aan de resterende fouten die door de vorige eigenschap zijn gemaakt. ### Aannames - De doelvariabele is een nominale of ordinale variabele. - De kenmerken bestaan uit continue, nominale of ordinale variabelen.
pt: O método Boosting funciona adicionando características sequencialmente a um conjunto de árvores de decisão, cada uma corrigindo a sua antecessora. No entanto, em vez de alterar os pesos para cada observação classificada incorretamente a cada iteração, o método Boosting tenta ajustar a nova característica aos erros residuais cometidos pela característica anterior. ### Suposições - A variável alvo é uma variável nominal ou ordinal. - As variáveis de característica consistem em variáveis contínuas, nominais ou ordinais.
ru: Метод бустинга работает путем добавления признаков в ансамбль деревьев решений, который каждый раз корректирует своего предшественника. Но вместо того, чтобы изменять веса для неверно классифицированных наблюдений на каждой итерации, бустинг пытается подогнать новый признак к остаточной ошибке, сделанной предыдущим признаком. ### Допущения - Целевая переменная является номинальной или порядковой. - Признаки могут быть непрерывными, номинальными или порядковыми переменными.
ta: ஒரு முடிவு மர குழுமத்திற்கு தொடர்ச்சியாக அம்சங்களைச் சேர்ப்பதன் மூலம் அதிகரிக்கும் பணிகள், ஒவ்வொன்றும் அதன் முன்னோடிகளை சரிசெய்கின்றன. இருப்பினும், ஒவ்வொரு மறு செய்கையிலும் ஒவ்வொரு தவறான வகைப்படுத்தப்பட்ட அவதானிப்பிற்கும் எடைகளை மாற்றுவதற்குப் பதிலாக, அதிகரிக்கும் முறை புதிய அம்சத்தை முந்தைய அம்சத்தால் செய்யப்பட்ட எஞ்சிய பிழைகளுக்கு பொருத்த முயற்சிக்கிறது. ### அனுமானங்கள் - இலக்கு மாறி ஒரு பெயரளவு அல்லது சாதாரண மாறி. - அம்ச மாறிகள் தொடர்ச்சியான, பெயரளவு அல்லது சாதாரண மாறிகள் கொண்டவை.

# mlClassificationDecisionTree|
source: Decision Trees is a supervised learning algorithm that uses a decision tree as a predictive model to go from observations about an item (represented in the roots of the tree) to conclusions about the item's target value (represented in the endpoints of the tree). ### Assumptions - The target is a nominal or ordinal variable. - The feature variables consist of continuous, nominal, or ordinal variables.
de: Entscheidungsbäume ist ein überwachter Lernalgorithmus, der einen Entscheidungsbaum als vorhersagendes Modell verwendet, um von Beobachtungen von einem Datenobjekt (repräsentiert in den Wurzeln des Baums) auf den Zielwert des Datenobjekts (repräsentiert in den Endpunkten des Baums) zu schließen. ### Annahmen - Die Zielvariable ist eine nominale oder ordinale Variable. - Die Merkmalsvariablen bestehen aus kontinuierlichen, nominalen oder ordinalen Variablen.
es: Los Árboles de Decisión son un algoritmo de aprendizaje supervisado que utiliza un árbol de decisión como modelo predictivo para ir desde las observaciones sobre un elemento (representado por las raíces del árbol) hasta conclusiones sobre el valor del objetivo de los elementos (representado por los puntos finales del árbol). ### Supuestos - El objetivo es una variable nominal u ordinal. - Las variables de características consisten en variables continuas, nominales u ordinales.
gl: As Árbores de Decisión son un algoritmo de aprendizaxe supervisado que utiliza unha árbore de decisión como modelo preditivo para ir desde as observacións sobre un elemento (representado polas raíces da árbore) ata conclusións sobre o valor do obxectivo dos elementos (representado polos puntos finais da árbore). ### Supostos - O obxectivo é unha variable nominal ou ordinal. - As variables de características consisten en variables continuas, nominais ou ordinais.
id: Decision Trees adalah algoritma pembelajaran terawasi yang menggunakan pohon keputusan sebagai model prediktif untuk beralih dari pengamatan tentang sebuah item (direpresentasikan di akar pohon) ke kesimpulan tentang nilai target item tersebut (direpresentasikan di titik akhir pohon). ### Asumsi - Target adalah variabel nominal atau ordinal. - Variabel fitur terdiri dari variabel kontinu, nominal, atau ordinal.
nl: Een beslisboom is een algoritme voor leren onder toezicht dat een beslissingsboom gebruikt als een voorspellend model om van waarnemingen over een item (weergegeven in de wortels van de boom) naar conclusies over de doelwaarde van het item te gaan (weergegeven in de eindpunten van de boom). ### Aannames - De doelvariabele is een nominale of ordinale variabele. - De kenmerken bestaan uit continue, nominale of ordinale variabelen.
pt: Árvores de Decisão são um algoritmo de aprendizado supervisionado que utiliza uma árvore de decisão como modelo preditivo para partir de observações sobre um item (representadas nas raízes da árvore) até conclusões sobre o valor-alvo do item (representado nas extremidades da árvore). ### Suposições - O alvo é uma variável nominal ou ordinal. - As variáveis de característica consistem em variáveis contínuas, nominais ou ordinais.
ru: Деревья решений - это алгоритм, который через отраженную в корнях дерева комбинацию признаков наблюдения приходит к выводам об отраженном в листьях дерева значении целевой переменной для данного наблюдения. ### Допущения - Целевая переменная является номинальной или порядковой. - Признаки могут быть непрерывными, номинальными или порядковыми переменными.
ta: முடிவு மரங்கள் என்பது ஒரு மேற்பார்வையிடப்பட்ட கற்றல் வழிமுறையாகும், இது ஒரு முடிவை ஒரு முன்கணிப்பு மாதிரியாகப் பயன்படுத்துகிறது, இது ஒரு பொருளைப் பற்றிய அவதானிப்புகளிலிருந்து (மரத்தின் வேர்களில் குறிப்பிடப்படுகிறது) உருப்படியின் இலக்கு மதிப்பைப் பற்றிய முடிவுகளுக்கு (மரத்தின் இறுதிப் புள்ளிகளில் குறிப்பிடப்படுகிறது). ### அனுமானங்கள் - இலக்கு ஒரு பெயரளவு அல்லது சாதாரண மாறி. - அம்ச மாறிகள் தொடர்ச்சியான, பெயரளவு அல்லது சாதாரண மாறிகள் கொண்டவை.

# mlClassificationKnn|
source: K-nearest neighbors is a method of classification that looks at the *k* number of feature observations that are most similar to new observations to make a prediction for their class assignments. The number of nearest neighbors is intrinsincly linked to model complexity, as small numbers increase the flexibility of the model. ### Assumptions - The target is a nominal or ordinal variable. - The feature variables consist of continuous, nominal, or ordinal variables.
de: K-nächste-Nachbarn ist eine Klassifikationsmethode, welche die Anzahl *k* von Merkmalsbeobachtungen anschaut, die neuen Beobachtungen am ähnlichsten sind, um eine Vorhersage für ihre Klassenzuweisungen zu machen. Die Anzahl der nächsten Nachbarn ist intrinsisch mit der Modellkomplexität verbunden, da kleine Zahlen die Flexibilität des Modells erhöhen. ### Annahmen - Das Ziel ist eine nominale oder ordinale Variable. - Die Merkmalsvariablen bestehen aus kontinuierlichen, nominalen oder ordinalen Variablen.
es: El de los K Vecinos Más Cercanos es un método de clasificación que examina el número *k* de observaciones características que son más parecidas a nuevas observaciones para hacer una predicción para sus asignaciones a clases. El número de vecinos más cercanos está vinculado intrínsecamente a la complejidad del modelo, puesto que números pequeños aumentan la flexibilidad del modelo. ### Supuestos - El objetivo es una variable nominal u ordinal. - Las variables de características consisten en variables continuas, nominales u ordinales.
gl: O dos K Veciños Máis Próximos é un método de clasificación que examina o número *k* de observacións características que son máis semellantes a novas observacións para facer unha predición para as súas asignacións a clases. O número de veciños máis próximos está vencellado intrinsecamente á complexidade do modelo, posto que números pequenos aumentan a flexibilidade do modelo. ### Supostos - O obxectivo é unha variable nominal ou ordinal. - As variables de características consisten en variables continuas, nominais ou ordinais.
id: K-nearest neighbors adalah metode klasifikasi yang melihat *k* jumlah pengamatan fitur yang paling mirip dengan pengamatan baru untuk membuat prediksi penetapan kelasnya. Jumlah tetangga terdekat secara intrinsik terkait dengan kompleksitas model, karena jumlah yang kecil meningkatkan fleksibilitas model. ### Asumsi - Target adalah variabel nominal atau ordinal. - Variabel fitur terdiri dari variabel kontinu, nominal, atau ordinal.
nl: K-dichtsbijzijnde buren is een classificatiemethode die kijkt naar het *k* aantal kenmerkwaarnemingen dat het meest lijkt op nieuwe waarnemingen om een voorspelling te doen voor hun klassetoewijzing. Het aantal dichtstbijzijnde buren is nauw verbonden met de complexiteit van het model, omdat kleine aantallen de flexibiliteit van het model vergroten. ### Aannames - De doelvariabele is een nominale of ordinale variabele. - De kenmerken bestaan uit continue, nominale of ordinale variabelen.
pt: K-vizinhos mais próximos é um método de classificação que analisa o número *k* de observações de características que são mais semelhantes a novas observações para fazer uma previsão para suas atribuições de classe. O número de vizinhos mais próximos está intrinsecamente ligado à complexidade do modelo, pois números pequenos aumentam a flexibilidade do modelo. ### Suposições - O alvo é uma variável nominal ou ordinal. - As variáveis de características consistem em variáveis contínuas, nominais ou ordinais.
ru: К-ближайших соседей - это метод классификации, который ищет *k* размеченных наблюдений, наиболее близких к новым наблюдениям для того, чтобы сделать предсказание их класса. Количество ближайших соседей внутренне связано со сложностью модели, и маленькие его значения повышают гибкость. ### Допущения - Целевая переменная является номинальной или порядковой. - Признаки могут быть непрерывными, номинальными или порядковыми переменными.
ta: கே-நெரிசலான அண்டை நாடுகள் என்பது வகைப்பாட்டின் ஒரு முறையாகும், இது * கே * அம்ச அவதானிப்புகளின் எண்ணிக்கையைப் பார்க்கிறது, அவை புதிய அவதானிப்புகளுக்கு மிகவும் ஒத்தவை. சிறிய எண்கள் மாதிரியின் நெகிழ்வுத்தன்மையை அதிகரிப்பதால், அருகிலுள்ள அண்டை நாடுகளின் எண்ணிக்கை மாதிரி சிக்கலுடன் உள்ளார்ந்த முறையில் இணைக்கப்பட்டுள்ளது. ### அனுமானங்கள் - இலக்கு ஒரு பெயரளவு அல்லது சாதாரண மாறி. - அம்ச மாறிகள் தொடர்ச்சியான, பெயரளவு அல்லது சாதாரண மாறிகள் கொண்டவை.

# mlClassificationLda|
source: Linear Discriminant Analysis (LDA) is a method of classification that aims to find *p - 1* components that discriminate best between the classes in the target variable. LDA is a linear classifier, meaning that the decision boundaries between classes are linear. ### Assumptions - The target variable is a nominal or ordinal variable. - The feature variables consist of continuous, nominal, or ordinal variables. - Equality of class means: The class means should be equal, can be checked with the corresponding table. - Equality of covariance matrices: The covariance matrices should be equal, can be checked with the corresponding table. - Multicollinearity: The classes should not correlate within each other, can be checked with the corresponding table.
de: Die lineare Diskriminanzanalyse (LDA) ist eine Klassifizierungsmethode mit dem Ziel, *p - 1* Komponenten zu finden, die am besten zwischen den Klassen in der Zielvariablen unterscheiden. LDA ist ein linearer Klassifikator, was bedeutet, dass die Entscheidungsgrenzen zwischen den Klassen linear sind. ### Annahmen - Die Zielvariable ist eine nominale oder ordinale Variable. - Die Merkmalsvariablen bestehen aus kontinuierlichen, nominalen oder ordinalen Variablen. - Gleichheit der Klassenmittelwerte: Die Klassenmittelwerte sollten gleich sein, was mit der entsprechenden Tabelle überprüfbar ist. - Gleichheit der Kovarianzmatrizen: Die Kovarianzmatrizen sollten gleich sein, was mit der entsprechenden Tabelle überprüfbar ist. - Multikollinearität: Die Klassen sollten nicht miteinander korrelieren, was mit der entsprechenden Tabelle überprüfbar ist.
es: El Análisis Discriminante Lineal (ADL, LDA) es un método de clasificación que ayuda a encontrar las *p - 1* componentes que mejor discriminan entre las clases de la variable objetivo. ADL es un clasificador lineal, lo que significa que las fronteras de decisión entre las clases son lineales. ### Supuestos - La variable objetivo es una variable nominal u ordinal. - Las variables de características consisten en variables continuas, nominales u ordinales. - Igualdad de las medias de clase: Las medias de clase deben ser iguales; lo que puede comprobarse con la tabla correspondiente. - Igualdad de las matrices de covarianzas: Las matrices de covarianzas deben ser iguales; lo que puede comprobarse con la tabla correspondiente. - No multicolinealidad: Cada clase no debe estar correlacionadas con las demás; lo que puede comprobarse con la tabla correspondiente.
gl: A Análise Discriminante Linear (ADL, LDA) é un método de clasificación que axuda a atopar as *p - 1* compoñentes que mellor discriminan entre as clases da variable obxectivo. ADL é un clasificador linear, o que significa que as fronteiras de decisión entre as clases son lineais. ### Supostos - A variable obxectivo é unha variable nominal ou ordinal. - As variables de características consisten en variables continuas, nominais ou ordinais. - Igualdade das medias de clase: As medias de clase deben ser iguais; o que pode comprobarse coa táboa correspondente. - Igualdade das matrices de covarianzas: As matrices de covarianzas deben ser iguais; o que pode comprobarse coa táboa correspondente. - Non multicolinearidade: Cada clase non debe estar correlacionadas coas demais; o que pode comprobarse coa táboa correspondente.
id: Linear Discriminant Analysis (LDA) adalah metode klasifikasi yang bertujuan untuk menemukan *p - 1* komponen yang membedakan dengan baik antara kelas-kelas dalam variabel target. LDA adalah pengklasifikasi linier, yang berarti bahwa batas keputusan antara kelas-kelas adalah linier. ### Asumsi - Variabel target adalah variabel nominal atau ordinal. - Variabel fitur terdiri dari variabel kontinu, nominal, atau ordinal. - Kesetaraan rata-rata kelas: Rata-rata kelas harus sama, dapat diperiksa dengan tabel yang sesuai. - Kesetaraan matriks kovarians: Matriks kovarians harus sama, dapat diperiksa dengan tabel yang sesuai. - Multikolinearitas: Kelas-kelas tidak boleh berkorelasi satu sama lain, dapat diperiksa dengan tabel yang sesuai.
nl: Lineaire Discriminantanalyse (LDA) is een classificatiemethode die tot doel heeft *p - 1* componenten te vinden die het beste discrimineren tussen de klassen in de doelvariabele. LDA is een lineaire classificeerder, wat betekent dat de beslissingsgrenzen tussen klassen lineair zijn. ### Aannames - De doelvariabele is een nominale of ordinale variabele. - De kenmerken bestaan uit continue, nominale of ordinale variabelen. - Gelijkheid van klassengemiddelden: De klassegemiddelden moeten gelijk zijn, kan gecontroleerd worden met de bijbehorende tabel. - Gelijkheid van covariantiematrices: De covariantiematrices moeten gelijk zijn, kan worden gecontroleerd met de bijbehorende tabel. - Multicollineariteit: De klassen mogen niet binnen elkaar correleren, kan gecontroleerd worden met de bijbehorende tabel.
pt: A Análise Discriminante Linear (ADL) é um método de classificação que visa encontrar componentes *p - 1* que melhor discriminem entre as classes na variável alvo. A ADL é um classificador linear, o que significa que os limites de decisão entre as classes são lineares. ### Suposições - A variável alvo é uma variável nominal ou ordinal. - As variáveis de característica consistem em variáveis contínuas, nominais ou ordinais. - Igualdade das médias das classes: As médias das classes devem ser iguais, o que pode ser verificado com a tabela correspondente. - Igualdade das matrizes de covariância: As matrizes de covariância devem ser iguais, o que pode ser verificado com a tabela correspondente. - Multicolinearidade: As classes não devem se correlacionar entre si, o que pode ser verificado com a tabela correspondente.
ru: Линейный дискриминантный анализ (LDA) - это метод классификации, нацеленный на нахождение *p - 1* компонент, обеспечивающих наилучшее различение между классами целевой переменной. LDA - это линейный классификатор, то есть границы между классами являются линейными. ### Допущения - Целевая переменная является номинальной или порядковой. - Признаки могут быть непрерывными, номинальными или порядковыми переменными. - Равенство средних по классам: Средние значения по классам должны быть равными, это может быть проверено с помощью соответствующей таблицы. - Равенство матриц ковариаций: Матрицы ковариаций должны быть равными, это может быть проверено с помощью соответствующей таблицы. - Мультиколлинеарность: Классы не должны коррелировать друг с другом, это может быть проверено с помощью соответствующей таблицы.
ta: நேரியல் பாகுபாடு பகுப்பாய்வு (எல்.டி.ஏ) என்பது வகைப்பாட்டின் ஒரு முறையாகும், இது இலக்கு மாறியில் வகுப்புகளுக்கு இடையில் சிறந்த பாகுபாடு காட்டும் * பி - 1 * கூறுகளைக் கண்டுபிடிப்பதை நோக்கமாகக் கொண்டுள்ளது. எல்.டி.ஏ என்பது ஒரு நேரியல் வகைப்படுத்தி, அதாவது வகுப்புகளுக்கு இடையிலான முடிவு எல்லைகள் நேரியல். ### அனுமானங்கள் - இலக்கு மாறி ஒரு பெயரளவு அல்லது சாதாரண மாறி. - அம்ச மாறிகள் தொடர்ச்சியான, பெயரளவு அல்லது சாதாரண மாறிகள் கொண்டவை. - வர்க்கத்தின் ஒரு நிகர் என்றால்: வர்க்க வழிகள் சமமாக இருக்க வேண்டும், தொடர்புடைய அட்டவணையுடன் சரிபார்க்கப்படலாம். - கோவாரன்ச் மெட்ரிக்குகளின் சமத்துவம்: கோவாரன்ச் மெட்ரிக்குகள் சமமாக இருக்க வேண்டும், தொடர்புடைய அட்டவணையுடன் சரிபார்க்கலாம். - மல்டிகோலினரிட்டி: வகுப்புகள் ஒருவருக்கொருவர் தொடர்புபடுத்தக்கூடாது, தொடர்புடைய அட்டவணையுடன் சரிபார்க்கப்படலாம்.

# mlClassificationLda|
source: Multivariate normality
de: Multivariate Normalverteilung
es: Normalidad multivariante
gl: Normalidade multivariante
id: Normalitas multivariat
nl: Multivariate normaliteit
pt: Normalidade multivariada
ru: Многомерная нормальность
ta: பன்முக இயல்புநிலை
