Repository: jasp-stats/jaspMachineLearning
Catalog: po/QML-*.po
Languages: de, es, gl, id, nl, pt, ru, ta

# mlClassificationNeuralNetwork|
source: Feedforward neural networks are predictive algorithms inspired by the biological neural networks that constitute brains. A neuron (node) that receives a signal then processes it and can send signals to neurons connected to it. The signal at a node is a real number, and the output of each node is computed by sending the signal trough the activation function. The number of layers and nodes in the network is intrinsincly linked to model complexity, as high numbers increase the flexibility of the model. ### Assumptions - The target is a nominal or ordinal variable. - The feature variables consist of continuous variables.
de: Feedforward Neuronale Netze sind Vorhersage-Algorithmen, die sich an biologischen neuronalen Netzen orientieren, aus denen Gehirne bestehen. Ein Neuron (Knoten), das ein Signal empfängt, verarbeitet dieses und kann Signale an mit ihm verbundene Neuronen senden. Das Signal eines Knotens ist eine reelle Zahl, und die Ausgabe eines jeden Knotens wird berechnet, indem das Signal durch die Aktivierungsfunktion geschickt wird. Die Anzahl der Schichten und Knoten im Netz ist untrennbar mit der Komplexität des Modells verbunden, da eine hohe Anzahl die Flexibilität des Modells erhöht. ### Annahmen - Das Ziel ist eine nominale oder ordinale Variable. - Die Merkmalsvariablen bestehen aus kontinuierlichen Variablen.
es: Las Redes Neuronales Feedforward son algoritmos predictivos inspirados en las redes neuronales biológicas que forman los cerebros. Una neurona (nodo) que recibe una señal, a continuación la procesa y puede enviar señales a neuronas conectadas con ella. La señal en un nodo es un número real, y el resultado de cada nodo se calcula enviando la señal a través de la función de activación. El número de estratos y nodos de la red está vinculado intrínsecamente a la complejidad del modelo, puesto que números grandes aumentan la flexibilidad del modelo. ### Supuestos - El objetivo es una variable nominal u ordinal. - Las variables de características consisten en variables continuas.
gl: As Redes Neuronais Feedforward son algoritmos preditivos inspirados nas redes neuronais biolóxicas que forman os cerebros. Unha neurona (nodo) que recibe un sinal, a continuación o procesa e pode enviar sinais a neuronas conectadas con ela. O sinal nun nodo é un número real, e o resultado de cada nodo calcúlase enviando o sinal a través da función de activación. O número de estratos e nodos da rede está vencellado intrinsecamente á complexidade do modelo, posto que números grandes aumentan a flexibilidade do modelo. ### Supostos - O obxectivo é unha variable nominal ou ordinal. - As variables de características consisten en variables continuas.
id: Jaringan saraf feedforward adalah algoritme prediktif yang terinspirasi oleh jaringan saraf biologis yang membentuk otak. Sebuah neuron (simpul) yang menerima sinyal kemudian memprosesnya dan dapat mengirim sinyal ke neuron yang terhubung dengannya. Sinyal pada sebuah node adalah bilangan real, dan output dari setiap node dihitung dengan mengirimkan sinyal melalui fungsi aktivasi. Jumlah lapisan dan node dalam jaringan secara intrinsik terkait dengan kompleksitas model, karena jumlah yang tinggi meningkatkan fleksibilitas model. ### Asumsi - Target adalah variabel nominal atau ordinal. - Variabel fitur terdiri dari variabel kontinu.
nl: Feedforward neurale netwerken zijn voorspellende algoritmen die geïnspireerd zijn op de biologische neurale netwerken waaruit hersenen bestaan. Een neuron (knooppunt) dat een signaal ontvangt, verwerkt het en kan signalen sturen naar neuronen die ermee verbonden zijn. Het signaal op een knooppunt is een reëel getal en de output van elk knooppunt wordt berekend door het signaal door de activeringsfunctie te sturen. Het aantal lagen en knooppunten in het netwerk is onlosmakelijk verbonden met de complexiteit van het model, aangezien hoge aantallen de flexibiliteit van het model vergroten. ### Aannames - De doelvariabele is een nominale of ordinale variabele. - De kenmerken bestaan uit continue variabelen.
pt: Redes neurais feedforward são algoritmos preditivos inspirados nas redes neurais biológicas que constituem o cérebro. Um neurônio (nó) recebe um sinal e o processa, podendo enviar sinais aos neurônios conectados a ele. O sinal em um nó é um número real, e a saída de cada nó é calculada enviando o sinal através da função de ativação. O número de camadas e nós na rede está intrinsecamente ligado à complexidade do modelo, visto que números altos aumentam a flexibilidade do modelo. ### Suposições - O alvo é uma variável nominal ou ordinal. - As variáveis de característica consistem em variáveis contínuas.
ru: Нейронные сети с прямой связью - это предсказательный алгоритм, вдохновленный представлениями о биологических нейронных сетях, из которых состоит мозг. Нейрон (узел) принимает сигнал, обрабатывает его и посылает результат другим нейронам, которые с ним соединены. Сигнал каждого узла - это вещественное число, а выход узла вычисляется путем прохождения сигнала через функцию активации. Количество слоев и узлов в сети внутренне связано со сложностью модели, и большие их значения повышают гибкость. ### Допущения - Целевая переменная является номинальной или порядковой. - Признаки являются непрерывными переменными.
ta: ஃபீட்ஃபோர்டு நியூரல் நெட்வொர்க்குகள் மூளைகளை உருவாக்கும் உயிரியல் நரம்பியல் நெட்வொர்க்குகளால் ஈர்க்கப்பட்ட முன்கணிப்பு வழிமுறைகள். ஒரு சிக்னலைப் பெறும் ஒரு நியூரானை (முனை) பின்னர் அதை செயலாக்குகிறது மற்றும் அதனுடன் இணைக்கப்பட்ட நியூரான்களுக்கு சமிக்ஞைகளை அனுப்ப முடியும். ஒரு முனையில் உள்ள சமிக்ஞை ஒரு உண்மையான எண், மற்றும் ஒவ்வொரு முனையின் வெளியீடும் சமிக்ஞை தொட்டியை செயல்படுத்தும் செயல்பாட்டை அனுப்புவதன் மூலம் கணக்கிடப்படுகிறது. நெட்வொர்க்கில் உள்ள அடுக்குகள் மற்றும் முனைகளின் எண்ணிக்கை மாதிரி சிக்கலுடன் உள்ளார்ந்த முறையில் இணைக்கப்பட்டுள்ளது, ஏனெனில் அதிக எண்கள் மாதிரியின் நெகிழ்வுத்தன்மையை அதிகரிக்கின்றன. ### அனுமானங்கள் - இலக்கு ஒரு பெயரளவு அல்லது சாதாரண மாறி. - அம்ச மாறிகள் தொடர்ச்சியான மாறிகள் கொண்டவை.

# mlClassificationRandomForest|
source: Random Forest is a method of classification that creates a set of decision trees that consists of a large number of individual trees which operate as an ensemble. Each individual tree in the random forest returns a class prediction and the class with the most votes becomes the model's prediction. ### Assumptions - The target variable is a nominal or ordinal variable. - The feature variables consist of continuous, nominal, or ordinal variables.
de: Random Forest ist eine Klassifizierungsmethode, bei der eine Menge von Entscheidungsbäumen erstellt wird, die aus einer großen Anzahl von Einzelbäumen bestehen, die als Ensemble arbeiten. Jeder einzelne Baum im Random Forest liefert eine Klassenvorhersage, und die Klasse mit den meisten Stimmen bildet die Vorhersage des Modells. ### Annahmen - Die Zielvariable ist eine nominale oder ordinale Variable. - Die Merkmalsvariablen bestehen aus kontinuierlichen, nominalen oder ordinalen Variablen.
es: El de Bosques Aleatorios es un método de clasificación que genera un conjunto de árboles de decisión, que consiste en un número grande de árboles individuales que funcionan como un conjunto. Cada árbol de decisión individual en el bosque aleatorio devuelve una predicción de clase, y la clase con más votos se convierte en la predicción del modelo. ### Supuestos - La variable objetivo es una variable nominal u ordinal. - Las variables de características consisten en variables continuas, nominales u ordinales.
gl: O de Bosques Aleatorios é un método de clasificación que xera un conxunto de árbores de decisión, que consiste nun número grande de árbores individuais que funcionan como un conxunto. Cada árbore de decisión individual no bosque aleatorio devolve unha predición de clase, e a clase con máis votos convértese na predición do modelo. ### Supostos - A variable obxectivo é unha variable nominal ou ordinal. - As variables de características consisten en variables continuas, nominais ou ordinais.
id: Random Forest adalah metode klasifikasi yang menciptakan sekumpulan pohon keputusan yang terdiri dari sejumlah besar pohon individu yang beroperasi sebagai ansambel. Setiap pohon individu dalam random forest menghasilkan prediksi kelas dan kelas dengan suara terbanyak menjadi prediksi model. ### Asumsi - Variabel target adalah variabel nominal atau ordinal. - Variabel fitur terdiri dari variabel kontinu, nominal, atau ordinal.
nl: Random Forest is een classificatiemethode die een set beslissingsbomen creëert die bestaat uit een groot aantal individuele bomen die werken als een ensemble. Elke individuele boom in het random forest geeft een klassevoorspelling en de klasse met de meeste stemmen wordt de voorspelling van het model. ### Aannames - De doelvariabele is een nominale of ordinale variabele. - De kenmerken bestaan uit continue, nominale of ordinale variabelen.
pt: Floresta Aleatória é um método de classificação que cria um conjunto de árvores de decisão composto por um grande número de árvores individuais que operam como um conjunto. Cada árvore individual na floresta aleatória retorna uma previsão de classe, e a classe com mais votos se torna a previsão do modelo. ### Suposições - A variável alvo é uma variável nominal ou ordinal. - As variáveis de característica consistem em variáveis contínuas, nominais ou ordinais.
ru: Случайный лес - это метод классификации, создающий большое количество отдельных деревьев решений, которые работают вместе как ансамбль. Каждое отдельное дерево в случайном лесу выдает свое предсказание класса, и класс с наибольшим количеством голосов становится предсказанием всей модели в целом. ### Допущения - Целевая переменная является номинальной или порядковой. - Признаки могут быть непрерывными, номинальными или порядковыми переменными.
ta: ரேண்டம் ஃபாரச்ட் என்பது வகைப்பாட்டின் ஒரு முறையாகும், இது ஒரு குழுவாக செயல்படும் ஏராளமான தனிப்பட்ட மரங்களைக் கொண்ட ஒரு முடிவு மரங்களின் தொகுப்பை உருவாக்குகிறது. சீரற்ற வனப்பகுதியில் உள்ள ஒவ்வொரு மரமும் ஒரு வர்க்க கணிப்பைத் தருகிறது, மேலும் அதிக வாக்குகளுடன் வகை மாதிரியின் கணிப்பாக மாறும். ### அனுமானங்கள் - இலக்கு மாறி ஒரு பெயரளவு அல்லது சாதாரண மாறி. - அம்ச மாறிகள் தொடர்ச்சியான, பெயரளவு அல்லது சாதாரண மாறிகள் கொண்டவை.

# mlClassificationSvm|
source: Support Vector Machines is a supervised learning algorithm that maps training examples to points in space so as to maximise the width of the gap between the two categories. New examples are then mapped into that same space and predicted to belong to a category based on which side of the gap they fall. ### Assumptions - The target is a nominal or ordinal variable. - The feature variables consist of continuous, nominal, or ordinal variables.
de: Support Vector Machines ist ein überwachter Lernalgorithmus, der Trainingsbeispiele auf Punkte im Raum abbildet, um die Breite des Bereichs zwischen den beiden Kategorien zu maximieren. Neue Beispiele werden dann demselben Raum zugeordnet und je nachdem, auf welche Seite des Bereichs sie fallen, zu einer Kategorie zugehörig vorhergesagt. ### Annahmen - Das Ziel ist eine nominale oder ordinale Variable. - Die Merkmalsvariablen bestehen aus kontinuierlichen, nominalen oder ordinalen Variablen.
es: El de Máquinas de Vectores de Soporte es un algoritmo de aprendizaje supervisado que cartografía ejemplos de adiestramiento a puntos del espacio, de modo que se maximice la amplitud de la brecha entre las dos categorías. Los nuevos ejemplos se cartografían entonces en ese mismo espacio, y se predice que pertenecerán a una categoría en base a cual es el lado de la brecha en el que caen. ### Supuestos - El objetivo es una variable nominal u ordinal. - Las variables de características consisten en variables continuas, nominales u ordinales.
gl: O de Máquinas de Vectores de Soporte é un algoritmo de aprendizaxe supervisado que cartografa exemplos de ensaio ata puntos do espazo, de xeito que se maximice a amplitude da fenda entre as dúas categorías. Os novos exemplos se cartografan entón nese mesmo espazo, e se predí que pertencerán a unha categoría en base a cal é o lado da fenda no que caen. ### Supostos - O obxectivo é unha variable nominal ou ordinal. - As variables de características consisten en variables continuas, nominais ou ordinais.
id: Support Vector Machines adalah algoritme pembelajaran terawasi yang memetakan contoh-contoh pelatihan ke titik-titik dalam ruang untuk memaksimalkan lebar kesenjangan antara dua kategori. Contoh-contoh baru kemudian dipetakan ke dalam ruang yang sama dan diprediksi masuk ke dalam kategori berdasarkan sisi mana dari kesenjangan tersebut. ### Asumsi - Target adalah variabel nominal atau ordinal. - Variabel fitur terdiri dari variabel kontinu, nominal, atau ordinal.
nl: Support Vector Machines is een algoritme voor leren onder toezicht dat trainingsvoorbeelden in kaart brengt in punten in de ruimte om de kloof tussen de twee categorieën zo breed mogelijk te maken. Nieuwe voorbeelden worden vervolgens in diezelfde ruimte geplaatst en er wordt voorspeld dat ze bij een categorie horen op basis van de kant van de kloof waarin ze vallen. ### Aannames - De doelvariabele is een nominale of ordinale variabele. - De kenmerken bestaan uit continue, nominale of ordinale variabelen.
pt: Máquinas de Vetores de Suporte são um algoritmo de aprendizado supervisionado que mapeia exemplos de treinamento em pontos no espaço, de modo a maximizar a largura da lacuna entre as duas categorias. Novos exemplos são então mapeados nesse mesmo espaço e prevê-se que pertençam a uma categoria com base em qual lado da lacuna se encontram. ### Suposições - O alvo é uma variável nominal ou ordinal. - As variáveis de característica consistem em variáveis contínuas, nominais ou ordinais.
ru: Метод опорных векторов - это алгоритм обучения с учителем, который представляет обучающую выборку в виде точек в пространстве таким образом, чтобы максимизировать ширину зазора между двумя категориями. Новые наблюдения проецируются в то же самое пространство, и категории, к которым они будут принадлежать, предсказываются на основе стороны данного зазора, на которой они находятся. ### Допущения - Целевая переменная является номинальной или порядковой. - Признаки могут быть непрерывными, номинальными или порядковыми переменными.
ta: உதவி திசையன் இயந்திரங்கள் ஒரு மேற்பார்வையிடப்பட்ட கற்றல் வழிமுறையாகும், இது இரண்டு வகைகளுக்கிடையேயான இடைவெளியின் அகலத்தை அதிகரிக்க விண்வெளியில் உள்ள புள்ளிகளுக்கு பயிற்சி எடுத்துக்காட்டுகளை வரைபடமாக்குகிறது. புதிய எடுத்துக்காட்டுகள் பின்னர் அதே இடத்தில் வரைபடமாக்கப்பட்டு, அவை இடைவெளியின் எந்தப் பக்கத்தின் அடிப்படையில் ஒரு வகையைச் சேர்ந்தவை என்று கணிக்கப்படுகிறது. ### அனுமானங்கள் - இலக்கு ஒரு பெயரளவு அல்லது சாதாரண மாறி. - அம்ச மாறிகள் தொடர்ச்சியான, பெயரளவு அல்லது சாதாரண மாறிகள் கொண்டவை.

# mlClusteringDensityBased|
source: Density-based clustering is a soft clustering method where clusters are constructed as maximal sets of points that are connected to points whose density exceeds some threshold. The density is produced by the concept that for each point within a cluster, the neighborhood within a given radius has to contain at least a minimum amount of points, that results in the density of that neighborhood to exceed a certain threshold. A density-based cluster is recognized by points having a higher density than points outside of the cluster. The set of all high-density points is called the density level. The points that do not exceed a density level are identified as outliers. The density level influences the amount of generated clusters. ### Assumptions - The data consists of continuous variables. - (Normally distributed data aids the clustering process).
es: La Conglomeración Basada en la Densidad es un fino método de conglomeración en el que los conglomerados se construyen como conjuntos máximos de puntos que están conectados a puntos cuya densidad excede algún umbral. La densidad se produce mediante la idea de que para cada punto dentro de un conglomerado, en la vecindad dentro de un determinado radio tiene que encontrarse al menos una cantidad mínima de puntos; esto resulta en que la densidad de esa vecindad exceda cierto umbral. Un conglomerado basado en la densidad se reconoce porque los puntos tienen una densidad mayor que los puntos fuera del conglomerado. El conjunto de todos los puntos de alta densidad se denomina nivel de densidad. Los puntos que no excedan el nivel de densidad se identifican como atípicos. El nivel de densidad influye en la cantidad de conglomerados generados. ### Supuestos - Los datos consisten en variables continuas. - (Datos con distribución de probabilidad Normal ayudan en el proceso de conglomeración).
gl: A Conglomeración Baseada na Densidade é un fino método de conglomeración no que os conglomerados constrúense como conxuntos máximos de puntos que están conectados a puntos cuxa densidade excede algún limiar. A densidade prodúcese mediante a idea de que para cada punto dentro dun conglomerado, na veciñanza dentro dun determinado radio ten que atoparse cando menos unha cantidade mínima de puntos; isto resulta en que a densidade desa veciñanza exceda certo limiar. Un conglomerado baseado na densidade recoñécese porque os puntos teñen unha densidade maior que os puntos fóra do conglomerado. O conxunto de todos os puntos de alta densidade denomínase nivel de densidade. Os puntos que non excedan o nivel de densidade se identifican como atípicos. O nivel de densidade inflúe na cantidade de conglomerados xerados. ### Supostos - Os datos consisten en variables continuas. - (Datos con distribución de probabilidade Normal axudan no proceso de conglomeración).
id: Pengelompokan berbasis kepadatan adalah metode pengelompokan lunak di mana cluster dibangun sebagai kumpulan titik maksimum yang terhubung ke titik-titik yang kepadatannya melebihi ambang batas tertentu. Kepadatan dihasilkan oleh konsep bahwa untuk setiap titik dalam sebuah cluster, lingkungan dalam radius tertentu harus mengandung setidaknya jumlah minimum titik, yang menghasilkan kepadatan lingkungan tersebut melebihi ambang batas tertentu. Cluster berbasis kepadatan dikenali dari titik-titik yang memiliki kepadatan yang lebih tinggi daripada titik-titik di luar cluster. Kumpulan semua titik dengan kepadatan tinggi disebut tingkat kepadatan. Titik-titik yang tidak melebihi tingkat kepadatan diidentifikasi sebagai pencilan. Tingkat kepadatan mempengaruhi jumlah cluster yang dihasilkan. ### Asumsi - Data terdiri dari variabel kontinu. - (Data yang terdistribusi secara normal akan membantu proses pengelompokan).
nl: Clusteren op basis van dichtheid is een zachte clustermethode waarbij clusters worden geconstrueerd als maximale sets van punten die verbonden zijn met punten waarvan de dichtheid groter is dan een bepaalde drempel. De dichtheid wordt geproduceerd door het concept dat voor elk punt binnen een cluster, de buurt binnen een bepaalde straal ten minste een minimum aantal punten moet bevatten, waardoor de dichtheid van die buurt een bepaalde drempel overschrijdt. Een op dichtheid gebaseerd cluster wordt herkend door punten met een hogere dichtheid dan punten buiten het cluster. De verzameling van alle punten met een hoge dichtheid wordt het dichtheidsniveau genoemd. De punten die een dichtheidsniveau niet overschrijden, worden geïdentificeerd als uitschieters. Het dichtheidsniveau beïnvloedt het aantal gegenereerde clusters. ### Aannames - De data bestaan uit continue variabelen. - (Normaal verdeelde gegevens helpen bij het clusteren).
pt: O agrupamento baseado em densidade é um método de agrupamento suave, no qual os agrupamentos são construídos como conjuntos máximos de pontos conectados a pontos cuja densidade excede um determinado limite. A densidade é produzida pelo conceito de que, para cada ponto dentro de um agrupamento, a vizinhança dentro de um determinado raio deve conter pelo menos uma quantidade mínima de pontos, o que resulta em uma densidade dessa vizinhança excedendo um determinado limite. Um agrupamento baseado em densidade é reconhecido por pontos que possuem uma densidade maior do que pontos fora do agrupamento. O conjunto de todos os pontos de alta densidade é chamado de nível de densidade. Os pontos que não excedem um nível de densidade são identificados como valores atípicos. O nível de densidade influencia a quantidade de agrupamentos gerados. ### Suposições - Os dados consistem em variáveis contínuas. - (Dados com distribuição normal auxiliam no processo de agrupamento).
ta: அடர்த்தி அடிப்படையிலான கிளச்டரிங் என்பது ஒரு மென்மையான கிளச்டரிங் முறையாகும், அங்கு கொத்துகள் அதிகபட்ச புள்ளிகளின் தொகுப்புகளாக கட்டமைக்கப்படுகின்றன, அவை புள்ளிகளுடன் இணைக்கப்பட்டுள்ளன, அதன் அடர்த்தி சில வரம்புகளை மீறுகிறது. ஒரு கிளச்டருக்குள் ஒவ்வொரு புள்ளிக்கும், கொடுக்கப்பட்ட சுற்றளவில் உள்ள அக்கம் குறைந்தது குறைந்தபட்ச அளவு புள்ளிகளைக் கொண்டிருக்க வேண்டும் என்ற கருத்தினால் அடர்த்தி தயாரிக்கப்படுகிறது, இதன் விளைவாக அந்த சுற்றுப்புறத்தின் அடர்த்தி ஒரு குறிப்பிட்ட வாசலை மீறுகிறது. கொத்துக்கு வெளியே உள்ள புள்ளிகளை விட அதிக அடர்த்தி கொண்ட புள்ளிகளால் அடர்த்தி அடிப்படையிலான கிளச்டர் அங்கீகரிக்கப்படுகிறது. அனைத்து உயர் அடர்த்தி கொண்ட புள்ளிகளின் தொகுப்பும் அடர்த்தி நிலை என்று அழைக்கப்படுகிறது. அடர்த்தி அளவைத் தாண்டாத புள்ளிகள் வெளிநாட்டவர்களாக அடையாளம் காணப்படுகின்றன. அடர்த்தி நிலை உருவாக்கப்பட்ட கிளச்டர்களின் அளவை பாதிக்கிறது. ### அனுமானங்கள் - தரவு தொடர்ச்சியான மாறிகள் கொண்டது. - (பொதுவாக விநியோகிக்கப்பட்ட தரவு கிளச்டரிங் செயல்முறைக்கு உதவுகிறது).
