Repository: jasp-stats/jaspMachineLearning
Catalog: po/QML-*.po
Languages: de, es, gl, id, nl, pt, ru, ta

# AlgorithmicSettings|
source: Loss function
de: Verlustfunktion
es: Función de pérdida
gl: Función de perda
id: Fungsi kerugian
nl: Verliesfunctie
pt: Função de perda
ta: இழப்பு செயல்பாடு

# AlgorithmicSettings|
source: Sum of squares
de: Quadratsummen
es: Suma de cuadrados
gl: Suma de cadrados
id: Jumlah kuadrat
nl: Kwadratensom
pt: Soma dos quadrados
ru: Сумма квадратов
ta: சதுரங்களின் தொகை

# AlgorithmicSettings|
source: Cross-entropy
de: Kreuzentropie
es: Entropía cruzada
gl: Entropía cruzada
id: Entropi silang
nl: Cross-entropie
pt: Entropia cruzada
ru: Кросс-энтропия
ta: குறுக்கு நெறிமுறை

# AlgorithmicSettings|
source: The loss function used.
de: Die verwendete Verlustfunktion.
es: La función de pérdida utilizada.
gl: A función de perda utilizada.
id: Fungsi kehilangan yang digunakan.
nl: De gebruikte verliesfunctie.
pt: A função de perda usada.
ru: Используемая функция потерь.
ta: பயன்படுத்தப்படும் இழப்பு செயல்பாடு.

# AlgorithmicSettings|
source: Stopping criteria loss function
de: Abbruchkriterien Fehlerfunktion
es: Criterio de parada de la función de pérdida
gl: Criterio de parada da función de perda
id: Menghentikan fungsi kehilangan kriteria
nl: Stopcriteria verliesfunctie
pt: Critérios de parada para a função de perda
ru: Критерий останова функции потерь
ta: அளவுகோல் இழப்பு செயல்பாட்டை நிறுத்துகிறது

# AlgorithmicSettings|
source: The threshold for the partial derivatives of the error function as stopping criteria.
de: Die Schwelle für die partiellen Ableitungen der Fehlerfunktion als Stoppkriterien.
es: El umbral para las derivadas parciales de la función de error como criterio de parada.
gl: O limiar para as derivadas parciais da función de erro como criterio de parada.
id: Ambang batas untuk turunan parsial dari fungsi kesalahan sebagai kriteria penghentian.
nl: De drempel voor de gedeeltelijke derivaten van de foutfunctie als stopcriterium.
pt: O limiar para as derivadas parciais da função de erro como critério de parada.
ru: Пороговое значение частных производных функции потерь, служащее в качестве критерия останова.
ta: பிழையின் பகுதி வழித்தோன்றல்களுக்கான நுழைவு அளவுகோல்களை நிறுத்துகிறது.

# AlgorithmicSettings|
source: Max. training repetitions
de: Max. Trainingswiederholungen
es: Máx. repeticiones de adiestramiento
gl: Máx. repeticións de ensaio
id: Maks. pengulangan pelatihan
nl: Max. trainingsherhalingen
pt: Máx. de repetições de treinamento
ru: Макс. проходов обучения
ta: அதிகபட்சம். பயிற்சி மறுபடியும்

# AlgorithmicSettings|
source: The maximum number of repetitions used in training the network.
de: Die maximale Anzahl von Wiederholungen, die beim Training des Netzes verwendet werden.
es: El número máximo de repeticiones utilizadas en adiestrar la red.
gl: O número máximo de repeticións utilizadas en ensaiar a rede.
id: Jumlah pengulangan maksimum yang digunakan dalam melatih jaringan.
nl: Het maximale aantal herhalingen gebruikt in het trainen van het netwerk.
pt: O número máximo de repetições usadas no treinamento da rede.
ru: Максимальное количество проходов цикла обучения нейронной сети.
ta: நெட்வொர்க்கைப் பயிற்றுவிப்பதில் அதிகபட்ச மறுபடியும் மறுபடியும் பயன்படுத்தப்படுகிறது.

# Coefficients|
source: Network weights
de: Netzwerkgewichte
es: Ponderaciones de red
gl: Ponderacións de rede
id: Bobot jaringan
nl: Netwerkgewichten
pt: Ponderações da rede
ru: Веса нейронной сети
ta: பிணையம் எடைகள்

# Coefficients|
source: Shows the connections in the neural network together with their weights.
de: Zeigt die Verbindungen im neuronalen Netz zusammen mit ihren Gewichten.
es: Muestra las conexiones en la red neuronal junto con sus ponderaciones.
gl: Amosa as conexións na rede neuronal xunto coas súas ponderacións.
id: Menunjukkan koneksi dalam jaringan saraf bersama dengan bobotnya.
nl: Toont de connecties in het neurale netwerk samen met hun gewichten.
pt: Mostra as conexões na rede neural juntamente com seus pesos.
ru: Показывает ребра между нейронами вместе с их весами.
ta: நரம்பியல் நெட்வொர்க்கில் உள்ள இணைப்புகளை அவற்றின் எடையுடன் காட்டுகிறது.

# ModelOptimization|
source: Network Topology
de: Netzwerktopologie
es: Topología de la Red
gl: Topoloxía da Rede
id: Topologi Jaringan
nl: Netwerktopologie
pt: Topologia da Rede
ru: Топология нейронной сети
ta: பிணையம் இடவியல்

# ModelOptimization|
source: Manual
de: Manuell
nl: Handmatig
ru: Ручная
ta: கையேடு

# ModelOptimization|
source: Specify the nodes in each hidden layer of the neural network.
de: Geben Sie die Knoten in jeder verdeckten Schicht des neuronalen Netzes an.
es: Especifica los nodos en cada estrato oculto de la red neuronal.
gl: Especifica os nodos en cada estrato oculto da rede neuronal.
id: Tentukan node di setiap lapisan tersembunyi jaringan saraf.
nl: Specificeer de knopen in elke verborgen laag van het neurale netwerk.
pt: Especifique os nós em cada camada oculta da rede neural.
ru: Задать узлы каждого скрытого слоя нейронной сети.
ta: நரம்பியல் நெட்வொர்க்கின் ஒவ்வொரு மறைக்கப்பட்ட அடுக்கிலும் முனைகளைக் குறிப்பிடவும்.

# ModelOptimization|
source: Nodes
de: Knoten
es: Nodos
gl: Nodos
id: Simpul
nl: Knopen
pt: Nós
ru: Узлы
ta: முனைகள்

# ModelOptimization|
source: Hidden layer
de: Verdeckte Schicht
es: Estrato oculto
gl: Estrato oculto
id: Lapisan tersembunyi
nl: Verborgen laag
pt: Camada oculta
ru: Скрытый слой
ta: மறைக்கப்பட்ட அடுக்கு

# ModelOptimization|
source: Optimize the topology of the network using a genetic algorithm.
de: Optimieren Sie die Topologie des Netzwerks mithilfe eines genetischen Algorithmus.
es: Optimiza la topología de la red usando un algoritmo genético.
gl: Optimiza a topoloxía da rede usando un algoritmo xenético.
id: Mengoptimalkan topologi jaringan menggunakan algoritma genetika.
nl: Optimaliseer de topologie van het netwerk met een genetisch algoritme.
pt: Otimize a topologia da rede usando um algoritmo genético.
ru: Оптимизировать топологию нейронной сети с использованием генетического алгоритма.
ta: மரபணு வழிமுறையைப் பயன்படுத்தி பிணையத்தின் இடவியல் மேம்படுத்தவும்.

# ModelOptimization|
source: Population size
de: Größe der Grundgesamtheit
es: Tamaño de la población
gl: Tamaño da poboación
id: Ukuran populasi
nl: Populatiegrootte
pt: Tamanho populacional
ru: Размер популяции
ta: மக்கள்தொகை அளவு

# ModelOptimization|
source: Size of population used in genetic optimization.
de: Größe der bei der genetischen Optimierung verwendeten Grundgesamtheit.
es: Tamaño de la población usada en la optimización genética.
gl: Tamaño da poboación usada na optimización xenética.
id: Ukuran populasi yang digunakan dalam optimasi genetik.
nl: Grootte van de populatie gebruikt in de genetische optimalisatie.
pt: Tamanho da população usada na otimização genética.
ru: Размер популяции, используемый в генетической оптимизации.
ta: மரபணு தேர்வுமுறையில் பயன்படுத்தப்படும் மக்கள்தொகையின் அளவு.

# ModelOptimization|
source: Generations
de: Generationen
es: Generaciones
gl: Xeracións
id: Generasi
nl: Generaties
pt: Gerações
ru: Поколений
ta: தலைமுறைகள்

# ModelOptimization|
source: Number of generations used in genetic optimization.
de: Anzahl der bei der genetischen Optimierung verwendeten Generationen.
es: Número de generaciones usadas en la optimización genética.
gl: Número de xeracións usadas na optimización xenética.
id: Jumlah generasi yang digunakan dalam optimasi genetik.
nl: Aantal generaties gebruikt in de genetische optimalisatie.
pt: Número de gerações usado na otimização genética.
ru: Количество поколений, используемое в генетической оптимизации.
ta: மரபணு தேர்வுமுறையில் பயன்படுத்தப்படும் தலைமுறைகளின் எண்ணிக்கை.

# ModelOptimization|
source: Max. number of layers
de: Max. Anzahl der Schichten
es: Máx. número de estratos
gl: Máx. número de estratos
id: Maks. jumlah lapisan
nl: Max. aantal lagen
pt: Máx. número de camadas
ru: Макс. количество слоев
ta: அதிகபட்சம். அடுக்குகளின் எண்ணிக்கை

# ModelOptimization|
source: Max. nodes in each layer
de: Max. Knoten in jeder Schicht
es: Máx. nodos en cada estrato
gl: Máx. nodos en cada estrato
id: Maks. node di setiap lapisan
nl: Max. knopen in elke laag
pt: Máx. nós em cada camada
ru: Макс. узлов на слой
ta: அதிகபட்சம். ஒவ்வொரு அடுக்கிலும் முனைகள்

# ModelOptimization|
source: Parent selection
de: Elternauswahl
es: Selección de progenitor
gl: Selección de proxenitor
id: Pemilihan induk
nl: Ouder selectie
pt: Seleção de pai
ru: Отбор родителей
ta: பெற்றோர் தேர்வு

# ModelOptimization|
source: Roulette wheel
de: Roulette-Rad
es: Rueda de ruleta
gl: Roda de ruleta
id: Roda roulette
nl: Roulette wiel
pt: Roda de roleta
ru: Колесом рулетки
ta: சில்லி சக்கரம்

# ModelOptimization|
source: Universal
nl: Universeel
ru: Универсальный
ta: உலகளாவிய

# ModelOptimization|
source: Rank
de: Rang
es: Rango
gl: Rango
id: Peringkat
nl: Rang
pt: Ranque
ru: Ранговый
ta: தரவரிசை

# ModelOptimization|
source: Tournament
de: Turnier
es: Torneo
gl: Torneo
id: Turnamen
nl: Toernooi
pt: Torneio
ru: Турнирный
ta: போட்டி

# ModelOptimization|
source: Random
de: Zufällig
es: Aleatorio
gl: Aleatorio
id: Acak
nl: Willekeurig
pt: Aleatório
ru: Случайный
ta: சீரற்ற

# ModelOptimization|
source: How to select suviving networks.
de: Wie die überlebenden Netzwerke ausgewählt werden.
es: Cómo elegir las redes supervivientes.
gl: Como elixir as redes superviventes.
id: Cara memilih jaringan yang selamat.
nl: Hoe overlevende netwerken geselecteerd moeten worden.
pt: Como selecionar redes sobreviventes.
ru: Как отбирать выжившие сети.
ta: சூவீவிங் நெட்வொர்க்குகளை எவ்வாறு தேர்ந்தெடுப்பது.

# ModelOptimization|
source: Candidates
de: Kandidaten
es: Candidatos
gl: Candidatos
id: Kandidat
nl: Kandidaten
pt: Candidatos
ru: Кандидаты
ta: வேட்பாளர்கள்

# ModelOptimization|
source: Number of candidates for tournament selection
de: Anzahl der Kandidaten für Turnierauswahl
es: Número de candidatos para la selección de torneo
gl: Número de candidatos para a selección de torneo
id: Jumlah kandidat untuk pemilihan turnamen
nl: Aantal kandidaten voor de toernooiselectie
pt: Número de candidatos para seleção do torneio
ru: Количество кандидатов при турнирном отборе
ta: போட்டி தேர்வுக்கான வேட்பாளர்களின் எண்ணிக்கை

# ModelOptimization|
source: Crossover method
de: Crossover-Methode
es: Método cruzado
gl: Método cruzado
id: Metode persilangan
nl: Kruismethode
pt: Método de crossover
ru: Метод скрещивания
ta: குறுக்குவழி முறை

# ModelOptimization|
source: Uniform
de: Gleichverteilung
es: Uniforme
gl: Uniforme
id: Seragam
pt: Uniforme
ru: Равномерный
ta: சீரான

# ModelOptimization|
source: One-point
es: Punto-Único
gl: Punto-Único
id: Satu poin
nl: Eenpunts
pt: Um ponto
ru: Одноточечный
ta: ஒரு புள்ளி

# ModelOptimization|
source: Multi-point
es: Punto-Múltiple
gl: Punto-Múltiple
id: Multi-poin
nl: Meerpunts
pt: Multiponto
ru: Многоточечный
ta: மல்டி-பாயிண்ட்

# ModelOptimization|
source: How to crossover two candidate networks.
de: Wie zwei Kandidatennetzwerke gekreuzt werden.
es: Cómo cruzar dos redes candidatas.
gl: Como cruzar dúas redes candidatas.
id: Cara menyilangkan dua jaringan kandidat.
nl: Hoe twee kandidaat netwerken gekruist moeten worden.
pt: Como cruzar duas redes candidatas.
ru: Как скрещивать две сети-кандидата.
ta: இரண்டு வேட்பாளர் நெட்வொர்க்குகள் குறுக்குவழி.

# ModelOptimization|
source: Mutations
de: Mutationen
es: Mutaciones
gl: Mutacións
id: Mutasi
nl: Mutaties
pt: Mutações
ru: Мутации
ta: பிறழ்வுகள்

# ModelOptimization|
source: Reset
de: Zurücksetzen
es: Restablecer
gl: Restablecer
id: Atur ulang
pt: Reiniciar
ru: Сброс
ta: மீட்டமை

# ModelOptimization|
source: Swap
de: Tausch
es: Intercambio
gl: Intercambio
id: Tukar
nl: Wissel
pt: Trocar
ru: Обмен
ta: இடமாற்றம்

# ModelOptimization|
source: Scramble
es: Disputa
gl: Disputa
nl: Hussel
pt: Mistura
ru: Перемешивание
ta: துருவல்

# ModelOptimization|
source: Inversion
de: Umkehrung
es: Inversión
gl: Inversión
id: Pembalikan
nl: Inversie
pt: Inversão
ru: Инверсия
ta: நேர்மாறல்

# ModelOptimization|
source: How to mutate a network.
de: Wie ein Netzwerk mutiert wird.
es: Cómo mutar una red.
gl: Como mutar unha rede.
id: Cara melakukan mutasi jaringan.
nl: Hoe een netwerk gemuteerd moet worden.
pt: Como mutar uma rede.
ru: Как проводить мутацию сети.
ta: நெட்வொர்க்கை எவ்வாறு மாற்றுவது.

# ModelOptimization|
source: Probability
de: Wahrscheinlichkeit
es: Probabilidad
gl: Probabilidade
id: Probabilitas
nl: Kans
pt: Probabilidade
ru: Вероятность
ta: நிகழ்தகவு

# ModelOptimization|
source: The mutation probability of a random network in each generation.
de: Die Mutationswahrscheinlichkeit eines zufälligen Netzwerks in jeder Generation.
es: La probabilidad de mutación de una red aleatoria, en cada generación.
gl: A probabilidade de mutación dunha rede aleatoria, en cada xeración.
id: Probabilitas mutasi dari jaringan acak di setiap generasi.
nl: De kans dat een willekeurig netwerk in elke generatie muteert.
pt: A probabilidade de mutação de uma rede aleatória em cada geração.
ru: Вероятность мутации случайно взятой сети из каждого поколения.
ta: ஒவ்வொரு தலைமுறையிலும் ஒரு சீரற்ற நெட்வொர்க்கின் பிறழ்வு நிகழ்தகவு.

# ModelOptimization|
source: Survival method
de: Überlebensmethode
es: Método de supervivencia
gl: Método de supervivencia
id: Metode bertahan hidup
nl: Overlevingsmethode
pt: Método de sobrevivência
ru: Метод выживания
ta: உயிர்வாழும் முறை

# ModelOptimization|
source: Fitness-based
de: Fitness-basiert
es: Basado en el ajuste
gl: Baseado no axuste
id: Berbasis kebugaran
nl: Fitness-gebaseerd
pt: Baseado no ajuste
ru: По качеству
ta: உடற்பயிற்சி அடிப்படையிலான

# ModelOptimization|
source: Age-based
de: Altersabhängig
es: Basado en la edad
gl: Baseado na idade
id: Berdasarkan usia
nl: Leeftijdsgebaseerd
pt: Baseado na idade
ru: По возрасту
ta: அகவை அடிப்படையிலான

# ModelOptimization|
source: How to choose which networks survive and die in a generation.
de: Wie ausgewählt wird, welche Netzwerke in einer Generation überleben und sterben.
es: Como escoger qué redes sobreviven o mueren en una generación.
gl: Como escoller que redes sobreviven ou morren nunha xeración.
id: Bagaimana memilih jaringan mana yang bertahan dan mati dalam satu generasi.
nl: Hoe gekozen moet worden welke netwerken overleven en sterven in elke generatie.
pt: Como escolher quais redes sobrevivem e morrem em uma geração.
ru: По какому принципу осуществляется выбор между выживанием и вымиранием сетей в каждом поколении.
ta: ஒரு தலைமுறையில் எந்த நெட்வொர்க்குகள் தப்பிப்பிழைக்கின்றன மற்றும் இறப்பதை எவ்வாறு தேர்வு செய்வது.

# ModelOptimization|
source: Elitism
de: Elitismus
es: Elitismo
gl: Elitismo
id: Elitisme
nl: Elitisme
pt: Elitismo
ru: Элитизм
ta: உயரடுக்கு

# ModelOptimization|
source: Keep top networks from dying out.
de: Die Top-Netzwerke vor dem Aussterben beschützen.
es: Evitar que las redes superiores se extingan.
gl: Evitar que as redes superiores se extingan.
id: Jaga agar jaringan teratas tidak mati.
nl: Voorkom dat de beste netwerken afsterven.
pt: Evite que as principais redes desapareçam.
ru: Уберегать лучшие сети от вымирания.
ta: சிறந்த நெட்வொர்க்குகள் இறப்பதைத் தடுக்கவும்.

# ModelOptimization|
source: Percentage of top networks to keep.
de: Prozentsatz der zu behaltenden Top-Netzwerke.
es: Porcentaje de redes superiores a mantener.
gl: Porcentaxe de redes superiores a manter.
id: Persentase jaringan teratas yang harus dipertahankan.
nl: Percentage beste netwerken om te houden.
pt: Porcentagem das principais redes a serem mantidas.
ru: Процент лучших сетей, которые необходимо уберегать.
ta: வைத்திருக்க வேண்டிய சிறந்த நெட்வொர்க்குகளின் விழுக்காடு.

# NetworkPlot|
source: Network structure
de: Netzwerkstruktur
es: Estructura de la red
gl: Estrutura de rede
id: Struktur jaringan
nl: Netwerkstructuur
pt: Estrutura de rede
ru: Структура нейронной сети
ta: பிணைய அமைப்பு

# NetworkPlot|
source: Creates a plot that visualizes the structure (nodes and edges) of the network.
de: Erstellt ein Diagramm, das die Struktur (Knoten und Kanten) des Netzwerks visualisiert.
es: Crea un gráfico que visualiza la estrutura (nodos y límites) de la red.
gl: Crea unha gráfica que visualiza a estrutura (nodos e límites) da rede.
id: Membuat plot yang memvisualisasikan struktur (simpul dan tepi) jaringan.
nl: Creëert een figuur die de structuur van het netwerk (knopen en relaties) visualiseert.
pt: Cria um gráfico que visualiza a estrutura (nós e arestas) da rede.
ru: Рисует диаграмму, визуализирующую структуру сети (ее узлы и ребра).
ta: நெட்வொர்க்கின் கட்டமைப்பை (முனைகள் மற்றும் விளிம்புகள்) காட்சிப்படுத்தும் ஒரு சதித்திட்டத்தை உருவாக்குகிறது.

# OptimPlot|
source: For regression, plots the average mean squared error of the population of neural networks against the number of generations in the evoluationary optimization algorithm. For classification, plots the average classification accuracy of the population of neural networks against the number of generations in the evoluationary optimization algorithm. Accuracy is assessed for the training (and validation) set.
es: Para la regresión, representa gráficamente el promedio del error cuadrado medio de la población de redes neuronales, frente al número de generaciones en el algoritmo de optimización evolutiva. Para la clasificación, representa gráficamente el promedio de la precisión de la clasificación de la población de redes neuronales, frente al número de generaciones en el algoritmo de optimización evolutiva. La precisión se evalúa para el conjunto de adiestramiento (y validación).
gl: Para a regresión, representa graficamente a media do erro cadrado medio da poboación de redes neuronais, fronte ao número de xeracións no algoritmo de optimización evolutiva. Para a clasificación, representa graficamente a media da precisión da clasificación da poboación de redes neuronais, fronte ao número de xeracións no algoritmo de optimización evolutiva. A precisión avalíase para o conxunto de ensaio (e validación).
id: Untuk regresi, memplot rata-rata kesalahan kuadrat rata-rata dari populasi jaringan saraf terhadap jumlah generasi dalam algoritma optimasi evolusioner. Untuk klasifikasi, memplot akurasi klasifikasi rata-rata dari populasi jaringan saraf terhadap jumlah generasi dalam algoritma optimasi evolusioner. Akurasi dinilai untuk set pelatihan (dan validasi).
nl: Voor regressie, creëert een figuur met het gemiddelde van de gemiddelde kwadraatfout van de populatie neurale netwerken tegen het aantal generaties in het evolutionaire optimizatie algoritme. Voor classificatie, geeft de gemiddelde nauwkeurigheid van de populatie neurale netwerken tegen het aantal generaties in het evolutionaire optimizatie algoritme. Nauwkeurigheid wordt gemeten op de training (en validatie) set.
pt: Para regressão, plota o erro quadrático médio da população de redes neurais em relação ao número de gerações no algoritmo de otimização evolutiva. Para classificação, plota a precisão média de classificação da população de redes neurais em relação ao número de gerações no algoritmo de otimização evolutiva. A precisão é avaliada para o conjunto de treinamento (e validação).
ru: При выполнении регрессии рисует график зависимости среднеквадратичной ошибки популяции нейронных сетей от количества поколений в эволюционном алгоритме оптимизации. При выполнении классификации рисует график зависимости точности классификации. Точность оценивается по обучающей и валидационной выборкам.
ta: பின்னடைவைப் பொறுத்தவரை, நரம்பியல் நெட்வொர்க்குகளின் மக்கள்தொகையின் சராசரி சராசரி சதுர பிழையை உருவகப்படுத்துதல் தேர்வுமுறை வழிமுறையில் தலைமுறைகளின் எண்ணிக்கையில். வகைப்பாட்டைப் பொறுத்தவரை, உருவக உகப்பாக்கம் வழிமுறையில் தலைமுறைகளின் எண்ணிக்கையில் நரம்பியல் நெட்வொர்க்குகளின் மக்கள்தொகையின் சராசரி வகைப்பாடு துல்லியத்தை திட்டமிடுகிறது. பயிற்சி (மற்றும் சரிபார்ப்பு) தொகுப்பிற்கு துல்லியம் மதிப்பிடப்படுகிறது.

# AccuracyDecrease|
source: Mean decrease in accuracy
de: Mittlere Abnahme der Genauigkeit
es: Disminución media en la precisión
gl: Decrecemento medio na precisión
id: Penurunan rata-rata dalam akurasi
nl: Gemiddelde afname in nauwkeurigheid
pt: Diminuição média na exatidão
ru: Средние потери в точности
ta: துல்லியத்தில் குறைவு

# AccuracyDecrease|
source: Displays a figure with the mean decrease in accuracy per feature in the model.
de: Zeigt ein Diagramm mit der mittleren Abnahme der Genauigkeit pro Merkmal im Modell.
es: Presenta un gráfico con la disminución media en la precisión, por característica del modelo.
gl: Presenta unha gráfica co decrecemento medio na precisión, por característica do modelo.
id: Menampilkan angka dengan rata-rata penurunan akurasi per fitur dalam model.
nl: Creëert een figuur met de gemiddelde vermindering van nauwkeurigheid per kenmerk in het model.
pt: Exibe uma figura com a diminuição média na exatidão por recurso no modelo.
ru: Отображает график, показывающий средние потери, которые претерпевает точность при исключении того или иного признака из модели.
ta: மாதிரியில் ஒரு அம்சத்திற்கு துல்லியத்தின் சராசரி குறைவு கொண்ட ஒரு உருவத்தைக் காட்டுகிறது.

# AlgorithmicSettings|
source: Features per split
de: Merkmale pro Aufteilung
es: Características por división
gl: Características por división
id: Fitur per pemisahan
nl: Kenmerken per splitsing
pt: Características por divisão
ru: Признаков на одно разделение
ta: பிளவுக்கு நற்பொருத்தங்கள்

# AlgorithmicSettings|
source: Auto
id: Otomatis
ru: Авто
ta: தானி

# AlgorithmicSettings|
source: Manual
de: Manuell
nl: Handmatig
ru: Вручную
ta: கையேடு

# AlgorithmicSettings|
source: Set the number of feature variables that is used within each split in the decision trees. Defaults to auto.
de: Setzt die Anzahl der Merkmalsvariablen, die in jeder Aufteilung in den Entscheidungsbäumen verwendet werden. Standardwert ist Auto.
es: Establece el número de variables de características que se usan en cada división en los árboles de decisión. El predeterminado es automático.
gl: Establece o número de variables de características que se usan en cada división nas árbores de decisión. O predeterminado é automático.
id: Mengatur jumlah variabel fitur yang digunakan dalam setiap pembagian dalam pohon keputusan. Nilai defaultnya adalah otomatis.
nl: Zet het aantal kenmerken die gebruikt worden in elke split in de beslissingsbomen. Standaard is auto.
pt: Define o número de variáveis de recurso usadas em cada divisão nas árvores de decisão. O padrão é automático.
ru: Задать количество переменных-признаков, используемых в каждом разделении дерева решений. По умолчанию выбрано значение "Авто".
ta: முடிவு மரங்களில் ஒவ்வொரு பிரிப்பிலும் பயன்படுத்தப்படும் அம்ச மாறிகளின் எண்ணிக்கையை அமைக்கவும். ஆட்டோவிற்கு இயல்புநிலை.

# AlgorithmicSettings|
source: The number of feature variables in each split.
de: Die Anzahl der Merkmalsvariablen in jeder Aufteilung.
es: El número de variables de características en cada división.
gl: O número de variables de características en cada división.
id: Jumlah variabel fitur dalam setiap pemisahan.
nl: Het aantal kenmerken in elke split.
pt: O número de variáveis de recurso em cada divisão.
ru: Количество переменных-признаков в каждом разделении.
ta: ஒவ்வொரு பிளவுகளிலும் அம்ச மாறிகள் எண்ணிக்கை.

# ModelOptimization|
source: The number of trees to be used.
de: Die Anzahl der zu verwendenden Bäume.
es: El número de árboles a utilizar.
gl: O número de árbores a utilizar.
id: Jumlah pohon yang akan digunakan.
nl: Het aantal bomen wat gebruikt wordt.
pt: O número de árvores a ser usado.
ru: Количество деревьев, используемых в модели.
ta: பயன்படுத்த வேண்டிய மரங்களின் எண்ணிக்கை.

# NodePurity|
source: Total increase in node purity
de: Gesamtzunahme der Knotenreinheit
es: Aumento total de la pureza del nodo
gl: Incremento total da pureza do nodo
id: Peningkatan total dalam kemurnian simpul
nl: Totale toename in knoopzuiverheid
pt: Aumento total na pureza do nó
ru: Суммарный рост чистоты узлов
ta: முனை தூய்மையின் மொத்த அதிகரிப்பு
