Repository: jasp-stats/jaspMachineLearning
Catalog: po/QML-*.po
Languages: de, es, gl, id, nl, pt, ru, ta

# mlRegressionRegularized|
source: Training Parameters
de: Trainingsparameter
es: Parámetros de adiestramiento
gl: Parámetros de ensaio
id: Parameter Pelatihan
nl: Trainingsparameters
pt: Parâmetros de treinamento
ru: Гиперпараметры модели
ta: பயிற்சி அளவுருக்கள்

# mlRegressionRegularized|
source: Algorithmic Settings
de: Algorithmus-Einstellungen
es: Configuraciones Algorítmicas
gl: Configuracións Algorítmicas
id: Pengaturan Algoritmik
nl: Algoritme-instellingen
pt: Configurações do algoritmo
ru: Настройки алгоритма
ta: வழிமுறை அமைப்புகள்

# mlRegressionRegularized|
source: Elastic net
de: Elastisches Netz
es: Red elástica
gl: Rede elástica
id: Bersih elastis
nl: Elastisch net
pt: Rede elástica
ru: Эластичная сеть
ta: மீள் நிகர

# mlRegressionRegularized|
source: Lambda (λ)
ru: Лямбда (λ)
ta: லாம்ப்டா (λ)

# mlRegressionRegularized|
source: Fixed
de: Fixiert
es: Fijo
gl: Fixo
id: Tetap
nl: Vast
pt: Fixo
ru: Фиксированная
ta: சரி

# mlRegressionRegularized|
source: Optimized
de: Optimiert
es: Optimizado
gl: Optimizado
id: Dioptimalkan
nl: Geoptimaliseerd
pt: Otimizado
ru: Оптимизированная
ta: உகந்ததாக

# Description|
source: Explore the relation between variables using data-driven methods for regression, classification, and clustering
de: Untersuche die Beziehung zwischen Variablen mithilfe datengesteuerter Methoden für Regression, Klassifizierung und Clustering
es: Explorar la relación entre las variables que utilizan métodos basados en datos para análisis de regresión, de clasificación y de conglomeración
gl: Analizar a relación entre as variables que utilizan métodos baseados en datos para análises de regresión, de clasificación e de conglomeración
id: Mengeksplorasi hubungan antar variabel menggunakan metode berbasis data untuk regresi, klasifikasi, dan pengelompokan
nl: Onderzoek de relatie tussen variabelen met behulp van datagedreven methoden voor regressie, classificatie en clustering
pt: Explorar a relação entre variáveis usando métodos baseados em dados para regressão, classificação e agrupamento
ru: Исследуйте зависимости между переменными при помощи основанных на данных методов регрессии, классификации и кластеризации
ta: பின்னடைவு, வகைப்பாடு மற்றும் கிளச்டரிங் ஆகியவற்றிற்கான தரவு உந்துதல் முறைகளைப் பயன்படுத்தி மாறிகளுக்கு இடையிலான உறவை ஆராயுங்கள்

# Description|
source: Neural Network
de: Neuronales Netz
es: Red Neuronal
gl: Rede Neuronal
nl: Neuraal Netwerk
pt: Rede Neural
ru: Нейронная сеть
ta: நரம்பியல் பிணையம்

# Description|
source: Neural Network Regression
de: Neuronale-Netzwerk-Regression
es: Regresión de Red Neuronal
gl: Regresión da Rede Neuronal
nl: Neuraal Netwerk Regressie
pt: Regressão de Redes Neurais
ru: Нейросетевая регрессия
ta: நரம்பியல் பிணையம் பின்னடைவு

# Description|
source: Neural Network Classification
de: Neuronale-Netzwerk-Klassifikation
es: Clasificación de Red Neuronal
gl: Clasificación da Rede Neuronal
nl: Neuraal Netwerk Classificatie
pt: Classificação de Redes Neurais
ru: Нейросетевая классификация
ta: நரம்பியல் பிணைய வகைப்பாடு

# Description|
source: Prediction
de: Vorhersage
es: Predicción
gl: Predición
id: Prediksi
nl: Voorspellen
pt: Previsão
ru: Предсказание
ta: கணிப்பு

source: Export Results
de: Ergebnisse exportieren
es: Exportar Resultados
gl: Exportar Resultados
id: Hasil Ekspor
nl: Exporteer resultaten
pt: Exportar Resultados
ru: Экспорт результатов
ta: ஏற்றுமதி முடிவுகள்

# ExportResults|
source: Add predictions to data
de: Vorhersagen zu Daten hinzufügen
es: Añadir las predicciones a los datos
gl: Engadir as predicións aos datos
id: Menambahkan prediksi ke data
nl: Voorspellingen toevoegen aan gegevens
pt: Adicionar previsões aos dados
ru: Добавить предсказания модели в таблицу данных
ta: தரவுக்கு கணிப்புகளைச் சேர்க்கவும்

# ExportResults|
source: Column name
de: Spaltenname
es: Nombre de columna
gl: Nome de columna
id: Nama kolom
nl: Kolom naam
pt: Nome da coluna
ru: Имя столбца
ta: நெடுவரிசை பெயர்

# ExportResults|
source: e.g., predicted
de: z. B. vorhergesagt
es: p. ej., predicho
gl: p. ex., predito
id: misalnya, diprediksi
nl: b.v., voorspeld
pt: e.g., previsto
ru: напр. predicted
ta: எ.கா., கணிக்கப்பட்டுள்ளது

# ExportResults|
source: Save as
de: Speichern als
es: Guardar como
gl: Gardar como
id: Simpan sebagai
nl: Opslaan als
pt: Salvar como
ru: Сохранить как
ta: என சேமி

# ExportResults|
source: e.g., location/model.jaspML
de: z. B. Pfad/Modell.jaspML
es: p.e., posición/modelo.jaspML
gl: p.e., posición/modelo.jaspML
id: misalnya, location/model.jaspML
nl: b.v., locatie/model.jaspML
pt: e.g., local/modelo.jaspML
ru: напр. location/model.jaspML
ta: எ.கா., இருப்பிடம்/மாடல்.சாச்ப்ம்ல்

# ExportResults|
source: Save trained model
de: Trainiertes Modell speichern
es: Guardar el modelo ensayado
gl: Gardar o modelo ensaiado
id: Menyimpan model terlatih
nl: Getraind model opslaan
pt: Salvar modelo treinado
ru: Сохранить обученную модель
ta: பயிற்சி பெற்ற மாதிரியை சேமிக்கவும்

# mlClassificationNeuralNetwork|
source: Tables
de: Tabellen
es: Tablas
gl: Táboas
id: Tabel
nl: Tabellen
pt: Tabelas
ru: Таблицы
ta: அட்டவணைகள்

# mlClassificationNeuralNetwork|
source: Plots
de: Diagramme
es: Gráficos
gl: Gráficas
id: Plot
nl: Grafieken
pt: Gráficos
ru: Графики
ta: அடுக்கு

# mlClassificationNeuralNetwork|
source: Training Parameters
de: Trainingsparameter
es: Parámetros de adiestramiento
gl: Parámetros de ensaio
id: Parameter Pelatihan
nl: Trainingsparameters
pt: Parâmetros de Treinamento
ru: Гиперпараметры модели
ta: பயிற்சி அளவுருக்கள்

# mlClassificationNeuralNetwork|
source: Algorithmic Settings
de: Algorithmus-Einstellungen
es: Configuraciones Algorítmicas
gl: Configuracións Algorítmicas
id: Pengaturan Algoritmik
nl: Algoritme Instellingen
pt: Configurações do Algoritmo
ru: Настройки алгоритма
ta: வழிமுறை அமைப்புகள்

# mlRegressionNeuralNetwork|
source: Tables
de: Tabellen
es: Tablas
gl: Táboas
id: Tabel
nl: Tabellen
pt: Tabelas
ru: Таблицы
ta: அட்டவணைகள்

# mlRegressionNeuralNetwork|
source: Plots
de: Diagramme
es: Gráficos
gl: Gráficas
id: Plot
nl: Grafieken
pt: Gráficos
ru: Графики
ta: அடுக்கு

# mlRegressionNeuralNetwork|
source: Training Parameters
de: Trainingsparameter
es: Parámetros de adiestramiento
gl: Parámetros de ensaio
id: Parameter Pelatihan
nl: Trainingsparameters
pt: Parâmetros de Treinamento
ru: Гиперпараметры модели
ta: பயிற்சி அளவுருக்கள்

# mlRegressionNeuralNetwork|
source: Algorithmic Settings
de: Algorithmus-Einstellungen
es: Configuraciones Algorítmicas
gl: Configuracións Algorítmicas
id: Pengaturan Algoritmik
nl: Algoritme Instellingen
pt: Configurações do Algoritmo
ru: Настройки алгоритма
ta: வழிமுறை அமைப்புகள்

# DataSplit|
source: Column name
de: Spaltenname
es: Nombre de columna
gl: Nome de columna
id: Nama kolom
nl: Kolom naam
pt: Nome da coluna
ru: Имя столбца
ta: நெடுவரிசை பெயர்

# DataSplit|
source: Test set indicator
de: Testset-Indikator
es: Probar el indicador de conjunto
gl: Probar o indicador de conxunto
id: Indikator set uji
pt: Testar o indicador de conjunto
ru: Выделить по индикатору
ta: சோதனை தொகுப்பு காட்டி

# mlClassificationLda|
source: Estimation method
de: Schätzmethode
es: Método de estimación
gl: Método de estimación
id: Metode estimasi
nl: Schattingsmethode
pt: Método de estimação
ru: Метод оценки
ta: மதிப்பீட்டு முறை

# mlClusteringDensityBased|
source: Epsilon neighborhood size
de: Epsilon Nachbarschaftsgröße
es: Tamaño del épsilon de vecindad
gl: Tamaño do épsilon da veciñanza
id: Ukuran lingkungan Epsilon
nl: Epsilon buurtomvang
pt: Tamanho de epsilon da vizinhança
ru: Радиус соседства epsilon
ta: எப்சிலன் அண்டை அளவு

# mlClusteringDensityBased|
source: Min. core points
de: Min. Kernpunkte
es: Mín. puntos del núcleo
gl: Mín. puntos do núcleo
id: Min. poin inti
nl: Min. kernpunten
pt: Mín. pontos do núcleo
ru: Мин. основных точек
ta: மணித்துளி. முக்கிய புள்ளிகள்

# mlClusteringDensityBased|
source: Distance
de: Distanz
es: Distancia
gl: Distancia
id: Jarak
nl: Afstand
pt: Distância
ru: Метрика расстояния
ta: தூரம்

# mlClusteringFuzzyCMeans|
source: Max. iterations
de: Max. Iterationen
es: Máx. iteraciones
gl: Máx. iteracións
id: Maks. iterasi
nl: Max. iteraties
pt: Máx. iterações
ru: Макс. итераций
ta: அதிகபட்சம். மறு செய்கைகள்

# mlClusteringFuzzyCMeans|
source: Fuzziness parameter
es: Parámetro de borrosidad
gl: Parámetro de borrosidade
id: Parameter ketidakjelasan
nl: Vaagheidsparameter
pt: Parâmetro de imprecisão
ru: Величина нечеткости
ta: தெளிவற்ற அளவுரு

# mlClusteringHierarchical|
source: Distance
de: Distanz
es: Distancia
gl: Distancia
id: Jarak
nl: Afstand
pt: Distância
ru: Метрика расстояния
ta: தூரம்

# mlClusteringHierarchical|
source: Pearson
ru: Пирсона
ta: பியர்சன்

# mlClusteringHierarchical|
source: Linkage
de: Verbundenheit
es: Enlace
gl: Enlace
id: Hubungan
nl: Koppeling
pt: Ligação
ru: Метрика связности
ta: இணைப்பு

# mlClusteringKMeans|
source: Max. iterations
de: Max. Iterationen
es: Máx. iteraciones
gl: Máx. iteracións
id: Maks. iterasi
nl: Max. iteraties
pt: Máx. iterações
ru: Макс. итераций
ta: அதிகபட்சம். மறு செய்கைகள்

# mlClusteringKMeans|
source: Random sets
de: Zufällige Mengen
es: Conjuntos aleatorios
gl: Conxuntos aleatorios
id: Set acak
nl: Willekeurige sets
pt: Conjuntos aleatórios
ru: Макс. случ. наборов
ta: சீரற்ற தொகுப்புகள்

# mlClusteringKMeans|
source: Algorithm
de: Algorithmus
es: Algoritmo
gl: Algoritmo
id: Algoritma
nl: Algoritme
pt: Algoritmo
ru: Алгоритм
ta: படிமுறை

# mlClusteringRandomForest|
source: Trees
de: Bäume
es: Árboles
gl: Árbores
nl: Bomen
pt: Árvores
ru: Деревьев
ta: மரங்கள்

# mlRegressionBoosting|
source: Loss function
de: Verlustfunktion
es: Función de pérdida
gl: Función de perda
id: Fungsi kerugian
nl: Verliesfunctie
pt: Função de perda
ru: Функция потерь
ta: இழப்பு செயல்பாடு

# mlRegressionRegularized|
source: Convergence threshold
de: Konvergenz-Grenzwert
es: Umbral de convergencia
gl: Limiar de converxencia
id: Ambang batas konvergensi
nl: Convergentiedrempel
pt: Limiar de convergência
ru: Порог сходимости
ta: குவிப்பு வாசல்

# mlRegressionRegularized|
source: Penalty
de: Strafterm
es: Penalización
gl: Penalización
id: Penalti
nl: Straf
pt: Penalidade
ru: Штрафная функция
ta: தண்டம்

# mlRegressionRegularized|
source: Lasso
ru: Лассо
ta: லாசோ

# mlRegressionRegularized|
source: Ridge
es: Cresta
gl: Crista
id: Punggungan
pt: Cume
ru: Гребень
ta: ரிட்ச்

# mlRegressionRegularized|
source: Elastic net parameter (α)
de: Parameter Elastisches Netz (α)
es: Parámetro de la red elástica (α)
gl: Parámetro da rede elástica (α)
id: Parameter bersih elastis (α)
nl: Elastische net parameter (α)
pt: Parâmetro da rede elástica (α)
ru: Параметр эластичной сети (α)
ta: மீள் நிகர அளவுரு (α)

# mlRegressionRegularized|
source: Largest λ within 1 SE of min
de: Größter λ innerhalb 1 SF des Min
es: Mayor λ dentro de 1 DT de mín
gl: O maior λ dentro de 1 ET de mín
id: λ terbesar dalam 1 SE dari min
nl: Grootste λ binnen 1 SE van min
pt: Maior λ dentro de um EP de mín
ru: Наибольшая λ в пределах 1 SE от минимума
ta: MIN இன் 1 SE க்குள் மிகப்பெரியது

# Description|
source: Decision Tree
de: Entscheidungsbaum
es: Árbol de Decisión
gl: Árbore de Decisión
nl: Beslisboom
pt: Árvore de Decisão
ru: Дерево решений
ta: முடிவு மரம்

# Description|
source: Decision Tree Regression
de: Entscheidungsbaum-Regression
es: Regresión de Árbol de Decisión
gl: Regresión de Árbore de Decisión
nl: Beslisboom Regressie
pt: Regressão de Árvore de Decisão
ru: Регрессия методом дерева решений
ta: முடிவு மரம் பின்னடைவு

# Description|
source: Support Vector Machine
es: Máquina de Vectores de Soporte
gl: Máquina de Vectores de Soporte
id: Mesin Vektor Pendukung
pt: Máquina de Vetores de Suporte
ru: Метод опорных векторов
ta: திசையன் இயந்திரத்தை ஆதரிக்கவும்

# Description|
source: Support Vector Machine Regression
es: Regresión de Máquinas de Vectores de Soporte
gl: Regresión de Máquinas de Vectores de Soporte
id: Regresi Mesin Vektor Pendukung
nl: Support Vector Machine Regressie
pt: Regressão de Máquina de Vetores de Suporte
ru: Регрессия методом опорных векторов
ta: திசையன் இயந்திர பின்னடைவை ஆதரிக்கவும்

# Description|
source: Decision Tree Classification
de: Entscheidungsbaum-Klassifizierung
es: Clasificación de Árbol de Decisión
gl: Clasificación de Árbore de Decisión
nl: Beslisboom Classificatie
pt: Classificação de Árvore de Decisão
ru: Классификация методом дерева решений
ta: முடிவு மரம் வகைப்பாடு

# Description|
source: Support Vector Machine Classification
de: Support Vector Machine-Klassifizierung
es: Clasificación de Máquinas de Vectores de Soporte
gl: Clasificación de Máquinas de Vectores de Soporte
id: Klasifikasi Mesin Vektor Pendukung
nl: Support Vector Machine Classificatie
pt: Classification de Máquina de Vetores de Suporte
ru: Классификация методом опорных векторов
ta: திசையன் இயந்திர வகைப்பாட்டை ஆதரிக்கவும்

# Description|
source: Neighborhood-Based
de: Nachbarschaftsbasiert
es: Basado en la Vecindad
gl: Baseado na Veciñanza
id: Berbasis Lingkungan
nl: Buurtgebaseerd
pt: Baseado na Vizinhança
ru: Основанная на соседстве
ta: அண்டை அடிப்படையிலான

# Description|
source: Neighborhood-Based Clustering
de: Nachbarschaftsbasiertes Clustering
es: Conglomeración Basada en la Vecindad
gl: Conglomeración Baseada na Veciñanza
id: Pengelompokan Berbasis Lingkungan
nl: Buurtgebaseerde Clustering
pt: Agrupamento Baseado na Vizinhança
ru: Кластеризация по соседству
ta: அக்கம் சார்ந்த கிளச்டரிங்

# mlClassificationDecisionTree|
source: Tables
de: Tabellen
es: Tablas
gl: Táboas
id: Tabel
nl: Tabellen
pt: Tabelas
ru: Таблицы
ta: அட்டவணைகள்

# mlClassificationDecisionTree|
source: Plots
de: Diagramme
es: Gráficos
gl: Gráficas
id: Plot
nl: Grafieken
pt: Gráficos
ru: Графики
ta: அடுக்கு

# mlClassificationDecisionTree|
source: Training Parameters
de: Trainingsparameter
es: Parámetros de adiestramiento
gl: Parámetros de ensaio
id: Parameter Pelatihan
nl: Trainingsparameters
pt: Parâmetros de treinamento
ru: Гиперпараметры модели
ta: பயிற்சி அளவுருக்கள்

# mlClassificationDecisionTree|
source: Algorithmic Settings
de: Algorithmus-Einstellungen
es: Configuraciones Algorítmicas
gl: Configuracións Algorítmicas
id: Pengaturan Algoritmik
nl: Algoritmische Instellingen
pt: Configurações do Algoritmo
ru: Настройки алгоритма
ta: வழிமுறை அமைப்புகள்

# mlClassificationSvm|
source: Tables
de: Tabellen
es: Tablas
gl: Táboas
id: Tabel
nl: Tabellen
pt: Tabelas
ru: Таблицы
ta: அட்டவணைகள்

# mlClassificationSvm|
source: Plots
de: Diagramme
es: Gráficos
gl: Gráficas
id: Plot
nl: Grafieken
pt: Gráficos
ru: Графики
ta: அடுக்கு

# mlClassificationSvm|
source: Training Parameters
de: Trainingsparameter
es: Parámetros de adiestramiento
gl: Parámetros de ensaio
id: Parameter Pelatihan
nl: Trainingsparameters
pt: Parâmetros de Treinamento
ru: Гиперпараметры модели
ta: பயிற்சி அளவுருக்கள்

# mlClassificationSvm|
source: Algorithmic Settings
de: Algorithmus-Einstellungen
es: Configuraciones Algorítmicas
gl: Configuracións Algorítmicas
id: Pengaturan Algoritmik
nl: Algoritmische Instellingen
pt: Configurações do Algoritmo
ru: Настройки алгоритма
ta: வழிமுறை அமைப்புகள்

# mlClusteringKMeans|
source: Center type
de: Zentrumstyp
es: Tipo de centro
gl: Tipo de centro
id: Tipe tengah
nl: Centrum type
pt: Tipo de centro
ru: Вычисление центров
ta: மைய வகை

# mlClusteringKMeans|
source: Distance
de: Distanz
es: Distancia
gl: Distancia
id: Jarak
nl: Afstand
pt: Distância
ru: Метрика расстояния
ta: தூரம்

# mlClusteringKMeans|
source: Euclidean
de: Euklidisch
es: Euclídea
gl: Euclídea
nl: Euclidisch
pt: Euclidiana
ru: Евклидова
ta: யூக்ளிடியன்

# mlClusteringKMeans|
source: Manhattan
ru: Городских кварталов
ta: மன்ஆட்டன்

# mlRegressionDecisionTree|
source: Tables
de: Tabellen
es: Tablas
gl: Táboas
id: Tabel
nl: Tabellen
pt: Tabelas
ru: Таблицы
ta: அட்டவணைகள்

# mlRegressionDecisionTree|
source: Plots
de: Diagramme
es: Gráficos
gl: Gráficas
id: Plot
nl: Grafieken
pt: Gráficos
ru: Графики
ta: அடுக்கு

# mlRegressionDecisionTree|
source: Training Parameters
de: Trainingsparameter
es: Parámetros de adiestramiento
gl: Parámetros de ensaio
id: Parameter Pelatihan
nl: Trainingsparameters
pt: Parâmetros de Treinamento
ru: Гиперпараметры модели
ta: பயிற்சி அளவுருக்கள்

# mlRegressionDecisionTree|
source: Algorithmic Settings
de: Algorithmus-Einstellungen
es: Configuraciones Algorítmicas
gl: Configuracións Algorítmicas
id: Pengaturan Algoritmik
nl: Algoritmische Instellingen
pt: Configurações do Algoritmo
ru: Настройки алгоритма
ta: வழிமுறை அமைப்புகள்

# mlRegressionSvm|
source: Tables
de: Tabellen
es: Tablas
gl: Táboas
id: Tabel
nl: Tabellen
pt: Tabelas
ru: Таблицы
ta: அட்டவணைகள்

# mlRegressionSvm|
source: Plots
de: Diagramme
es: Gráficos
gl: Gráficas
id: Plot
nl: Grafieken
pt: Gráficos
ru: Графики
ta: அடுக்கு

# mlRegressionSvm|
source: Training Parameters
de: Trainingsparameter
es: Parámetros de adiestramiento
gl: Parámetros de ensaio
id: Parameter Pelatihan
nl: Trainingsparameters
pt: Parâmetros de Treinamento
ru: Гиперпараметры модели
ta: பயிற்சி அளவுருக்கள்

# mlRegressionSvm|
source: Algorithmic Settings
de: Algorithmus-Einstellungen
es: Configuraciones Algorítmicas
gl: Configuracións Algorítmicas
id: Pengaturan Algoritmik
nl: Algoritmische Instellingen
pt: Configurações do Algoritmo
ru: Настройки алгоритма
ta: வழிமுறை அமைப்புகள்

# mlPrediction|
source: Trained model
de: Trainiertes Modell
es: Modelo ensayado
gl: Modelo ensaiado
id: Model terlatih
nl: Getraind model
pt: Modelo treinado
ru: Обученная модель
ta: பயிற்சி பெற்ற மாதிரி

# mlPrediction|
source: e.g., location/model.jaspML
de: z. B. Pfad/Modell.jaspML
es: p.e., posición/modelo.jaspML
gl: p.e., posición/modelo.jaspML
id: misalnya, location/model.jaspML
nl: b.v., locatie/model.jaspML
pt: e.g., localização/modelo.jaspML
ru: напр. location/model.jaspML
ta: எ.கா., இருப்பிடம்/மாடல்.சாச்ப்ம்ல்

# mlPrediction|
source: Features
de: Merkmale
es: Características
gl: Características
id: Fitur
nl: Kenmerken
pt: Características
ru: Признаки
ta: நற்பொருத்தங்கள்

# mlPrediction|
source: Algorithmic Settings
de: Algorithmus-Einstellungen
es: Configuraciones Algorítmicas
gl: Configuracións Algorítmicas
id: Pengaturan Algoritmik
nl: Algoritmische Instellingen
ta: வழிமுறை அமைப்புகள்

# mlPrediction|
source: Tables
de: Tabellen
es: Tablas
gl: Táboas
id: Tabel
nl: Tabellen
pt: Tabelas
ru: Таблицы
ta: அட்டவணைகள்

# mlPrediction|
source: to
de: bis
es: a
gl: a
id: untuk
nl: naar
pt: para
ru: до
ta: பெறுநர்

# Description|
source: Linear
es: Lineal
id: Linier
nl: Lineair
ru: Линейная
ta: நேரியல்

# Description|
source: Linear Regression
de: Lineare Regression
es: Regresión Lineal
gl: Regresión linear
id: Regresi Linier
nl: Lineare Regressie
pt: Regressão Linear
ru: Линейная регрессия
ta: நேரியல் பின்னடைவு

# AlgorithmicSettings|
source: Shrinkage
de: Schrumpfung
es: Contracción
gl: Contracción
id: Penyusutan
nl: Krimping
pt: Encolhimento
ru: Скорость обучения
ta: சுருக்கம்

# AlgorithmicSettings|
source: A shrinkage parameter applied to each tree in the expansion. Also known as the learning rate or step-size reduction 0.001 to 0.1 usually work, but a smaller learning rate typically requires more trees.
de: Ein Schrumpfparameter, angewandt auf jeden Baum in der Erweiterung. Auch bekannt als die Lernrate oder Schrittgrößenreduktion; meist funktionieren 0,001 bis 0,1, aber eine niedrigere Lernrate erfordert typischerweise mehr Bäume.
es: Un parámetro de contracción aplicado a cada árbol en la expansión. También conocido como la tasa de apredizaje o reducción del tamaño de paso, habitualmente funciona de 0.001 a 0.1, pero una tasa de aprendizaje menor requiere normalmente más árboles.
gl: Un parámetro de contracción aplicado a cada árbore na expansión. Tamén coñecido como a taxa de apredizaxe ou reducción do tamaño de paso, habitualmente funciona de 0.001 a 0.1, pero unha taxa de aprendizaxe menor require normalmente máis árbores.
id: Parameter penyusutan yang diterapkan pada setiap pohon dalam ekspansi. Juga dikenal sebagai laju pembelajaran atau pengurangan ukuran langkah 0,001 hingga 0,1 biasanya berfungsi, tetapi laju pembelajaran yang lebih kecil biasanya membutuhkan lebih banyak pohon.
nl: Een krimp parameter toegevoegd aan elke boom in de set. Ook bekend als de learning rate of reductie in stapgrootte, 0.001 naar 0.1 werkt meestal, maar een kleinere learning rate vereist meestal meer bomen.
pt: Um parâmetro de redução aplicado a cada árvore na expansão. Também conhecido como taxa de aprendizado ou redução do tamanho do passo. 0,001 a 0,1 geralmente funciona, mas uma taxa de aprendizado menor normalmente requer mais árvores.
ru: Параметр, применяемый к каждому дереву модели. Скорость обучения, или размер шага, от 0.001 до 0.1 подходит для большинства случаев, но следует иметь в виду, что меньшее значение обычно требует большего количества деревьев.
ta: விரிவாக்கத்தில் ஒவ்வொரு மரத்திற்கும் ஒரு சுருக்க அளவுரு பயன்படுத்தப்படுகிறது. கற்றல் விகிதம் அல்லது படி-அளவு குறைப்பு 0.001 முதல் 0.1 வரை பொதுவாக வேலை செய்யப்படுகிறது, ஆனால் ஒரு சிறிய கற்றல் வீதத்திற்கு பொதுவாக அதிக மரங்கள் தேவைப்படுகின்றன.

# AlgorithmicSettings|
source: Interaction depth
de: Interaktionstiefe
es: Profundidad de la interacción
gl: Profundidade da interacción
id: Kedalaman interaksi
nl: Interactie diepte
pt: Profundidade de interação
ru: Глубина дерева
ta: தொடர்பு ஆழம்

# AlgorithmicSettings|
source: Integer specifying the maximum depth of each tree (i.e., the highest level of variable interactions allowed. A value of 1 implies an additive model, a value of 2 implies a model with up to 2-way interactions, etc. Default is 1.
de: Ganze Zahl zur Angabe der maximalen Tiefe jedes Baumes (d.h. den höchsten Grad erlaubter Variablen-Interaktionen. Ein Wert von 1 impliziert ein additives Modell, ein Wert von 2 impliziert ein Modell mit bis zu 2-fach-Interaktionen, usw. Standardwert ist 1.
es: Entero que especifica la profundidad máxima de cada árbol (i.e., el mayor nivel de interacciones permitidas de las variables). El valor 1 implica un modelo aditivo, el valor 2 implica un modelo con interacciones de hasta 2 direcciones, etc. El predeterminado es 1.
gl: Enteiro que especifica a profundidade máxima de cada árbore (i.e., o maior nivel de interaccións permitidas das variables). O valor 1 implica un modelo aditivo, o valor 2 implica un modelo con interaccións de ata 2 direccións, etc. O predeterminado é 1.
id: Bilangan bulat yang menentukan kedalaman maksimum setiap pohon (yaitu, tingkat interaksi variabel tertinggi yang diperbolehkan. Nilai 1 mengimplikasikan model aditif, nilai 2 mengimplikasikan model dengan interaksi hingga 2 arah, dst. Nilai default adalah 1.
nl: Een integer die specificeert wat de maximale diepte van elke boom is (i.e., het hoogste niveau van de toegestane interacties tussen variabelen). Een waarde van 1 impliceert een additief model, een waarde van 2 impliceert een model met 2-weg interacties, enzovoort. Standaard is 1.
pt: Inteiro que especifica a profundidade máxima de cada árvore (ou seja, o nível mais alto de interações de variáveis permitido). Um valor de 1 implica um modelo aditivo, um valor de 2 implica um modelo com até interações bidirecionais, etc. O padrão é 1.
ru: Целочисленное значение, выражающее максимальную глубину деревьев (максимальный уровень взаимодействия переменных). Значение 1 подразумевает аддитивную модель, значение 2 - модель с двойными взаимодействиями и т. д. По умолчанию выбрано значение 1.
ta: ஒவ்வொரு மரத்தின் அதிகபட்ச ஆழத்தையும் குறிப்பிடும் முழு எண் (அதாவது, அனுமதிக்கப்பட்ட மாறி இடைவினைகளின் மிக உயர்ந்த நிலை. 1 இன் மதிப்பு ஒரு சேர்க்கை மாதிரியைக் குறிக்கிறது, 2 இன் மதிப்பு 2-வழி இடைவினைகள் போன்ற ஒரு மாதிரியைக் குறிக்கிறது. இயல்புநிலை 1.
