Repository: jasp-stats/jaspMachineLearning
Catalog: po/QML-*.po
Languages: de, es, gl, id, nl, pt, ru, ta

# mlRegressionSvm|
source: Support Vector Machines is a supervised learning algorithm that maps training examples to points in space so as to maximise the width of the gap between the two categories. New examples are then mapped into that same space and predicted to belong to a category based on which side of the gap they fall. ### Assumptions - The target variable is a continuous variable. - The feature variables consist of continuous, nominal, or ordinal variable
de: Support Vector Machines ist ein überwachter Lernalgorithmus, der Trainingsbeispiele auf Punkte im Raum abbildet, um die Breite des Bereichs zwischen den beiden Kategorien zu maximieren. Neue Beispiele werden dann demselben Raum zugeordnet und je nachdem, auf welche Seite des Bereichs sie fallen, zu einer Kategorie zugehörig vorhergesagt. ### Annahmen - Die Zielvariable ist eine kontinuierliche Variable. - Die Merkmalsvariablen bestehen aus kontinuierlichen, nominalen oder ordinalen Variablen
es: El de Máquinas de Vectores de Soporte es un algoritmo de aprendizaje supervisado que cartografía ejemplos de adiestramiento a puntos del espacio, de modo que se maximice la amplitud de la brecha entre las dos categorías. Los nuevos ejemplos se cartografían entonces en ese mismo espacio, y se predice que pertenecerán a una categoría en base a cual es el lado de la brecha en el que caen. ### Supuestos - La variable objetivo es una variable continua. - Las variables de características consisten en variables continuas, nominales u ordinales.
gl: O de Máquinas de Vectores de Soporte é un algoritmo de aprendizaxe supervisado que cartografa exemplos de ensaio ata puntos do espazo, de xeito que se maximice a amplitude da fenda entre as dúas categorías. Os novos exemplos se cartografan entón nese mesmo espazo, e se predí que pertencerán a unha categoría en base a cal é o lado da fenda no que caen. ### Supostos - A variable obxectivo é unha variable continua. - As variables de características consisten en variables continuas, nominais ou ordinais.
id: Support Vector Machines adalah algoritme pembelajaran terawasi yang memetakan contoh-contoh pelatihan ke titik-titik dalam ruang untuk memaksimalkan lebar kesenjangan antara dua kategori. Contoh-contoh baru kemudian dipetakan ke dalam ruang yang sama dan diprediksi masuk ke dalam kategori berdasarkan sisi mana dari kesenjangan tersebut. ### Asumsi - Variabel target adalah variabel kontinu. - Variabel fitur terdiri dari variabel kontinu, nominal, atau ordinal
nl: Support Vector Machines is een algoritme voor leren onder toezicht dat trainingsvoorbeelden in kaart brengt in punten in de ruimte om de kloof tussen de twee categorieën zo breed mogelijk te maken. Nieuwe voorbeelden worden vervolgens in diezelfde ruimte geplaatst en er wordt voorspeld dat ze bij een categorie horen op basis van de kant van de kloof waarin ze vallen. ### Aannames - De doelvariabele is een continue variabele. - De kenmerken bestaan uit continue, nominale of ordinale variabelen
pt: Máquinas de Vetores de Suporte são um algoritmo de aprendizado supervisionado que mapeia exemplos de treinamento em pontos no espaço, de modo a maximizar a largura da lacuna entre as duas categorias. Novos exemplos são então mapeados nesse mesmo espaço e prevê-se que pertençam a uma categoria com base em qual lado da lacuna se encontram. ### Suposições - A variável-alvo é uma variável contínua. - As variáveis de característica consistem em variáveis contínuas, nominais ou ordinais
ru: Метод опорных векторов - это алгоритм обучения с учителем, который представляет обучающую выборку в виде точек в пространстве таким образом, чтобы максимизировать ширину зазора между двумя категориями. Новые наблюдения проецируются в то же самое пространство, и категории, к которым они будут принадлежать, предсказываются на основе стороны данного зазора, на которой они находятся. ### Допущения - Целевая переменная является непрерывной. - Признаки могут быть непрерывными, номинальными или порядковыми переменными
ta: உதவி திசையன் இயந்திரங்கள் ஒரு மேற்பார்வையிடப்பட்ட கற்றல் வழிமுறையாகும், இது இரண்டு வகைகளுக்கிடையேயான இடைவெளியின் அகலத்தை அதிகரிக்க விண்வெளியில் உள்ள புள்ளிகளுக்கு பயிற்சி எடுத்துக்காட்டுகளை வரைபடமாக்குகிறது. புதிய எடுத்துக்காட்டுகள் பின்னர் அதே இடத்தில் வரைபடமாக்கப்பட்டு, அவை இடைவெளியின் எந்தப் பக்கத்தின் அடிப்படையில் ஒரு வகையைச் சேர்ந்தவை என்று கணிக்கப்படுகிறது. ### அனுமானங்கள் - இலக்கு மாறி தொடர்ச்சியான மாறி. - அம்ச மாறிகள் தொடர்ச்சியான, பெயரளவு அல்லது சாதாரண மாறி கொண்டவை

# Description|
source: Naive Bayes
de: Naiver Bayes
es: Bayes Ingenuo
gl: Bayes Inxenuo
pt: Bayes Ingênuo
ta: அப்பாவியாக பேயச்

# Description|
source: Naive Bayes Classification
de: Naive Bayes-Klassifizierung
es: Clasificación ingenua de Bayes
gl: Clasificación inxenua de Bayes
nl: Naive Bayes Classificatie
pt: Classificação Bayes Ingênuo
ta: அப்பாவியாக பேய்ச் வகைப்பாடு

# ModelOptimization|
source: Tree Complexity
de: Baum-Komplexität
es: Complejidad de árbol
gl: Complexidade da árbore
nl: Boomcomplexiteit
pt: Complexidade da Árvore
ta: மர சிக்கலானது

# ModelOptimization|
source: Enables you to use a user-specified complexity penalty.
es: Le permite usar una penalización indicada por el usuario, de la complejidad.
gl: Permíteche usar unha penalización indicada polo usuario, da complexidade.
id: Memungkinkan Anda menggunakan penalti kompleksitas yang ditentukan pengguna.
nl: Hiermee kunt u een door de gebruiker gespecificeerde complexiteitscorrectie gebruiken.
pt: Permite que você use uma penalidade de complexidade especificada pelo usuário.
ta: பயனர் குறிப்பிட்ட சிக்கலான அபராதத்தைப் பயன்படுத்த உங்களுக்கு உதவுகிறது.

# ModelOptimization|
source: Complexity penalty
es: Penalización de complejidad
gl: Penalización da complexidade
id: Penalti kompleksitas
nl: Straf voor complexiteit
pt: Penalidade da complexidade
ta: சிக்கலான தண்டம்

# ModelOptimization|
source: The complexity penalty to be used. Any split that does not decrease the overall lack of fit by a factor of this parameter is not attempted.
es: La penalización de la complejidad a usar. Cualquier división que no disminuya la falta global de ajuste por un factor de este parámetro, no se intenta.
gl: A penalización da complexidade a usar. Calquera división que non diminúa a falla global de axuste por un factor deste parámetro, non se intenta.
id: Penalti kompleksitas yang akan digunakan. Setiap pemisahan yang tidak mengurangi keseluruhan ketidaksesuaian dengan faktor parameter ini tidak akan dicoba.
nl: De complexiteitscorrectie die gebruikt moet worden. Elke splitsing die het algehele gebrek aan fit niet vermindert met een factor van deze parameter, wordt niet geprobeerd.
pt: A penalidade de complexidade a ser usada. Qualquer divisão que não diminua a falta geral de ajuste por um fator deste parâmetro não será tentada.
ta: பயன்படுத்த வேண்டிய சிக்கலான தண்டம். இந்த அளவுருவின் ஒரு காரணியால் பொருத்தத்தின் ஒட்டுமொத்த பற்றாக்குறையை குறைக்காத எந்தவொரு பிளவு முயற்சிக்கவில்லை.

# ModelOptimization|
source: Enables you to optimize the prediction error on a validation data set with respect to the complexity penalty.
es: Le permite optimizar el error de predicción en un conjunto de datos de validación, con respecto a la penalización de complejidad.
gl: Permíteche optimizar o erro de predición nun conxunto de datos de validación, con respecto á penalización da complexidade.
id: Memungkinkan Anda untuk mengoptimalkan kesalahan prediksi pada kumpulan data validasi sehubungan dengan penalti kompleksitas.
nl: Hiermee kun je de voorspellingsfout optimaliseren op een validatiedataset met betrekking tot de complexiteitsboete.
pt: Permite otimizar o erro de previsão em um conjunto de dados de validação com relação à penalidade de complexidade.
ta: சிக்கலான அபராதத்தைப் பொறுத்து சரிபார்ப்பு தரவுகளில் முன்கணிப்பு பிழையை மேம்படுத்த உங்களுக்கு உதவுகிறது.

# ModelOptimization|
source: Max. complexity penalty
es: Máx. penalización de la complejidad
gl: Máx. penalización da complexidade
id: Maks. penalti kompleksitas
nl: Max. straf voor complexiteit
pt: Máx. penalização de complexidade
ta: அதிகபட்சம். சிக்கலான தண்டம்

# ModelOptimization|
source: Sets the maximum value of the complexity penalty to be considered. At default, this is set to 1.
es: Establece el valor máximo de la penalización por complejidad que se tendrá en cuenta. Por defecto, se establece en 1.
gl: Establece o valor máximo da penalización da complexidade a considerar. Por defecto, fíxase en 1.
id: Menetapkan nilai maksimum penalti kompleksitas yang akan dipertimbangkan. Secara default, ini diatur ke 1.
nl: Stelt de maximumwaarde in van de complexiteitsstraf waarmee rekening moet worden gehouden. Standaard is dit ingesteld op 1.
pt: Define o valor máximo da penalidade de complexidade a ser considerada. Por padrão, é definido como 1.
ta: கருத்தில் கொள்ள வேண்டிய சிக்கலான அபராதத்தின் அதிகபட்ச மதிப்பை அமைக்கிறது. இயல்பாக, இது 1 ஆக அமைக்கப்பட்டுள்ளது.

# OptimPlot|
source: For regression, Plots the complexity penalty against the MSE of the model. Accuracy is assessed for the training (and validation) set. For classification, plots the complexity penalty against the classification accuracy of the model. Accuracy is assessed for the training (and validation) set.
es: Para la regresión, traza la penalización por complejidad frente al MSE del modelo. La precisión se evalúa para el conjunto de entrenamiento (y validación). Para la clasificación, traza la penalización por complejidad frente a la precisión de clasificación del modelo. La precisión se evalúa para el conjunto del entrenamiento (y validación).
gl: Para a regresión, representa gráficamente a penalización da complexidade fronte ao ECM (MSE) do modelo. Avalíase a precisión para o conxunto de ensaio (e validación). Para a clasificación, representa gráficamente a penalización da complexidade fronte á precisión da clasificación do modelo. Avalíase a precisión para o conxunto de ensaio (e validación).
id: Untuk regresi, memplot penalti kompleksitas terhadap MSE model. Akurasi dinilai untuk set pelatihan (dan validasi). Untuk klasifikasi, memplot penalti kompleksitas terhadap akurasi klasifikasi model. Akurasi dinilai untuk set pelatihan (dan validasi).
nl: Zet voor regressie de complexiteitsstraf uit tegen de MSE van het model. De nauwkeurigheid wordt beoordeeld voor de trainingsset (en validatieset). Zet voor classificatie de complexiteitsstraf uit tegen de classificatienauwkeurigheid van het model. De nauwkeurigheid wordt beoordeeld voor de trainingsset (en validatieset).
pt: Para regressão, plota a penalidade de complexidade em relação ao EQM do modelo. A exatidão é avaliada para o conjunto de treinamento (e validação). Para classificação, plota a penalidade de complexidade em relação à exatidão de classificação do modelo. A exatidão é avaliada para o conjunto de treinamento (e validação).
ta: பின்னடைவைப் பொறுத்தவரை, மாதிரியின் MSE க்கு எதிராக சிக்கலான அபராதத்தை வெளிப்படுத்துகிறது. பயிற்சி (மற்றும் சரிபார்ப்பு) தொகுப்பிற்கு துல்லியம் மதிப்பிடப்படுகிறது. வகைப்பாட்டிற்கு, மாதிரியின் வகைப்பாடு துல்லியத்திற்கு எதிராக சிக்கலான அபராதத்தை திட்டமிடுகிறது. பயிற்சி (மற்றும் சரிபார்ப்பு) தொகுப்பிற்கு துல்லியம் மதிப்பிடப்படுகிறது.

# ModelOptimization|
source: Costs of Contraints Violation
es: Costes del incumplimiento de las restricciones
gl: Custos do incumprimento das restricións
id: Biaya Pelanggaran terhadap Kendala
nl: Overtredingskosten
pt: Custos de Violação de Restrição
ta: தடை மீறல் செலவு

# ModelOptimization|
source: Enables you to use a user-specified cost of constraints violation.
es: Permite utilizar un coste de violación de las restricciones especificado por el usuario.
gl: Permíteche usar un custo indicado polo usuario, do incumprimento das restricións.
id: Memungkinkan Anda menggunakan biaya pelanggaran batasan yang ditentukan pengguna.
nl: Hiermee kunt u een door de gebruiker gespecificeerde kostenpost voor het schenden van beperkingen gebruiken.
pt: Permite que você use um custo de violação de restrições especificado pelo usuário.
ta: கட்டுப்பாடுகள் மீறலுக்கான பயனர் குறிப்பிட்ட செலவைப் பயன்படுத்த உங்களுக்கு உதவுகிறது.

# ModelOptimization|
source: Violation cost
de: Kosten der Verletzung
es: Coste del incumplimiento
gl: Custo do incumprimento
id: Biaya pelanggaran
nl: Overtredingskosten
pt: Custo de violação
ta: மீறல் செலவு

# ModelOptimization|
source: Enables you to optimize the prediction error on a validation data set with respect to the cost of constraints violation.
es: Le permite optimizar el error de predicción en un conjunto de datos de validación, con respecto al coste del incumplimiento de las restricciones.
gl: Permíteche optimizar o erro de predición nun conxunto de datos de validación, con respecto ao custo do incumprimento das restricións.
id: Memungkinkan Anda untuk mengoptimalkan kesalahan prediksi pada kumpulan data validasi sehubungan dengan biaya pelanggaran batasan.
nl: Hiermee kunt u de voorspellingsfout op een validatiedataset optimaliseren met betrekking tot de kosten van het schenden van beperkingen.
pt: Permite otimizar o erro de previsão em um conjunto de dados de validação com relação ao custo de violação de restrições.
ta: கட்டுப்பாடுகள் மீறல் செலவு தொடர்பாக சரிபார்ப்பு தரவுத் தொகுப்பில் முன்கணிப்பு பிழையை மேம்படுத்த உங்களுக்கு உதவுகிறது.

# ModelOptimization|
source: Max. violation cost
es: Máx. coste del incumplimiento
gl: Máx. custo do incumprimento
id: Maks. biaya pelanggaran
nl: Max. overtredingskosten
pt: Máx. custo de violação
ta: அதிகபட்சம். மீறல் செலவு

# ModelOptimization|
source: Sets the maximum value of the cost of constraints violation to be considered. At default, this is set to 5.
es: Establece el valor máximo a considerar del coste del incumplimiento de las restricciones. Por defecto, se fija en 5.
gl: Establece o valor máximo a considerar do custo do incumprimento das restricións. Por defecto, fíxase en 5.
id: Mengatur nilai maksimum dari biaya pelanggaran batasan yang akan dipertimbangkan. Secara default, ini diatur ke 5.
nl: Stelt de maximumwaarde in van de kosten van de overtreding van beperkingen die in aanmerking moeten worden genomen. Standaard is dit ingesteld op 5.
pt: Define o valor máximo do custo de violação de restrições a ser considerado. Por padrão, é definido como 5.
ta: கருத்தில் கொள்ள வேண்டிய கட்டுப்பாடுகள் மீறலின் அதிகபட்ச மதிப்பை அமைக்கிறது. இயல்பாக, இது 5 ஆக அமைக்கப்பட்டுள்ளது.

# OptimPlot|
source: For regression, Plots the cost of contraints violation against the MSE of the model. Accuracy is assessed for the training (and validation) set. For classification, plots the cost of contraints violation against the classification accuracy of the model. Accuracy is assessed for the training (and validation) set.
es: Para la regresión, representa gráficamente el coste del incumplimiento de las restricciones frente al ECM (MSE) del modelo. Se evalúa la precisión para el conjunto de adiestramiento (y validación). Para la clasificación, representa gráficamente el coste del incumplimiento de las restricciones frente a la precisión de la clasificación del modelo. Se evalúa la precisión para el conjunto de adiestramiento (y validación).
gl: Para a regresión, representa gráficamente o custo do incumprimento das restricións fronte ao ECM (MSE) do modelo. Avalíase a precisión para o conxunto de ensaio (e validación). Para a clasificación, representa gráficamente o custo do incumprimento das restricións fronte á precisión da clasificación do modelo. Avalíase a precisión para o conxunto de ensaio (e validación).
id: Untuk regresi, plot biaya pelanggaran batasan terhadap MSE model. Akurasi dinilai untuk set pelatihan (dan validasi). Untuk klasifikasi, memplot biaya pelanggaran batasan terhadap akurasi klasifikasi model. Akurasi dinilai untuk set pelatihan (dan validasi).
nl: Zet voor regressie de kosten van het schenden van beperkingen uit tegen de MSE van het model. De nauwkeurigheid wordt beoordeeld voor de trainingsset (en validatieset). Zet voor classificatie de kosten van het schenden van beperkingen uit tegen de classificatienauwkeurigheid van het model. De nauwkeurigheid wordt beoordeeld voor de trainingsset (en validatieset).
pt: Para regressão, plota o custo da violação de restrições em relação ao EQM do modelo. A exatidão é avaliada para o conjunto de treinamento (e validação). Para classificação, plota o custo da violação de restrições em relação à exatidão de classificação do modelo. A exatidão é avaliada para o conjunto de treinamento (e validação).
ta: பின்னடைவைப் பொறுத்தவரை, மாதிரியின் MSE க்கு எதிராக முரண்பாடுகளின் மீறலின் விலையை திட்டமிடுகிறது. பயிற்சி (மற்றும் சரிபார்ப்பு) தொகுப்பிற்கு துல்லியம் மதிப்பிடப்படுகிறது. வகைப்பாட்டைப் பொறுத்தவரை, மாதிரியின் வகைப்பாடு துல்லியத்திற்கு எதிராக முரண்பாடுகளின் மீறலின் விலையை திட்டமிடுகிறது. பயிற்சி (மற்றும் சரிபார்ப்பு) தொகுப்பிற்கு துல்லியம் மதிப்பிடப்படுகிறது.

# mlClassificationNaiveBayes|
source: Naive Bayes computes the conditional posterior probabilities of a categorical class variable given independent predictor variables using the Bayes rule. ### Assumptions - The target variable is a nominal or ordinal variable. - The features are independent. - The features are normally distributed given the target class.
es: Bayes Ingenuo calcula las probabilidades posteriores condicionadas de una variable de clase con categorías, dadas variables predictoras independientes, utilizando la regla de Bayes. ### Supuestos - La variable objetivo es de tipo nominal u ordinal. - Las características son independientes. - Las características tienen distribución Normal, dada la clase objetivo.
gl: Bayes Inxenuo calcula as probabilidades posteriores condicionadas dunha variable de clase con categorías, dadas variables preditivas independentes, utilizando a regra de Bayes. ### Supostos - A variable obxectivo é de tipo nominal ou ordinal. - As características son independentes. - As características teñen distribución Normal, dada a clase obxectivo.
id: Naive Bayes menghitung probabilitas posterior bersyarat dari variabel kelas kategorikal yang diberikan variabel prediktor independen menggunakan aturan Bayes. ### Asumsi - Variabel target adalah variabel nominal atau ordinal. - Fitur-fitur bersifat independen. - Fitur-fitur terdistribusi secara normal berdasarkan kelas target.
nl: Naive Bayes berekent de conditionele posterior kansen van een categorische klassenvariabele gegeven onafhankelijke voorspellende variabelen met behulp van de regel van Bayes. ### Veronderstellingen - De doelvariabele is een nominale of ordinale variabele. - De kenmerken zijn onafhankelijk. - De kenmerken zijn normaal verdeeld gegeven de doelklasse.
pt: O método Bayes Ingênuo calcula as probabilidades condicionais posteriores de uma variável de classe categórica, dadas variáveis preditoras independentes, usando a regra de Bayes. ### Suposições - A variável alvo é uma variável nominal ou ordinal. - As características são independentes. - As características são normalmente distribuídas, dada a classe-alvo.
ta: பேய்ச் விதியைப் பயன்படுத்தி சுயாதீன முன்கணிப்பு மாறிகள் கொடுக்கப்பட்ட ஒரு வகைப்படுத்தப்பட்ட வகுப்பு மாறியின் நிபந்தனை பின்புற நிகழ்தகவுகளை அப்பாவியாக பேயச் கணக்கிடுகிறது. ### அனுமானங்கள் - இலக்கு மாறி ஒரு பெயரளவு அல்லது சாதாரண மாறி. - நற்பொருத்தங்கள் சுயாதீனமானவை. - இலக்கு வகுப்பில் கொடுக்கப்பட்ட நற்பொருத்தங்கள் பொதுவாக விநியோகிக்கப்படுகின்றன.

# mlClassificationNaiveBayes|
source: Tables
de: Tabellen
es: Tablas
gl: Táboas
id: Tabel
nl: Tabellen
pt: Tabelas
ru: Таблицы
ta: அட்டவணைகள்

# mlClassificationNaiveBayes|
source: Posterior statistics
de: Posterior-Statistiken
es: Estadísticos posteriores
gl: Estatísticos posteriores
id: Statistik posterior
nl: Posterior statistieken
pt: Estatística posterior
ta: பின்புற புள்ளிவிவரங்கள்

# mlClassificationNaiveBayes|
source: Show tables with the posterior statistics. For numeric features, the table contains the mean and standard deviation of the feature given the target class. For categorical features, the table displays the conditional probabilities given the target class.
de: Tabellen mit den Posteriorstatistiken anzeigen. Für numerische Merkmale enthält die Tabelle den Mittelwert und die Standardabweichung des Merkmals, gegeben die Zielklasse. Für kategorische Merkmale zeigt die Tabelle die bedingten Wahrscheinlichkeiten gegeben der Zielklasse an.
es: Muestra tablas con estadísticos posteriores. Para características numéricas, la tabla contiene la media y la desviación típica de la característica, dada la clase objetivo. Para características con categorías, la tabla presenta las probabilidades condicionadas, dada la clase objetivo.
gl: Amosa táboas con estatísticos posteriores. Para características numéricas, a táboa contén a media e o desvío padrón da característica, dada a clase obxectivo. Para características con categorías, a táboa presenta as probabilidades condicionadas, dada a clase obxectivo.
id: Menampilkan tabel dengan statistik posterior. Untuk fitur numerik, tabel berisi rata-rata dan deviasi standar fitur yang diberikan kelas target. Untuk fitur kategorik, tabel menampilkan probabilitas bersyarat yang diberikan kelas target.
nl: Toon tabellen met de posterior statistieken. Voor numerieke kenmerken bevat de tabel het gemiddelde en de standaardafwijking van het kenmerk gegeven de doelklasse. Voor categorische kenmerken toont de tabel de conditionele kans gegeven de doelklasse.
pt: Exiba tabelas com as estatísticas posteriores. Para características numéricas, a tabela contém a média e o desvio padrão da característica, dada a classe alvo. Para características categóricas, a tabela exibe as probabilidades condicionais, dada a classe alvo.
ta: பின்புற புள்ளிவிவரங்களுடன் அட்டவணைகளைக் காட்டு. எண் அம்சங்களுக்கு, இலக்கு வகுப்பில் கொடுக்கப்பட்ட அம்சத்தின் சராசரி மற்றும் நிலையான விலகல் அட்டவணையில் உள்ளது. வகைப்படுத்தப்பட்ட அம்சங்களுக்கு, இலக்கு வகுப்பிற்கு வழங்கப்பட்ட நிபந்தனை நிகழ்தகவுகளை அட்டவணை காட்டுகிறது.

# mlClassificationNaiveBayes|
source: Plots
de: Diagramme
es: Gráficos
gl: Gráficas
id: Plot
nl: Grafieken
pt: Gráficos
ru: Графики
ta: அடுக்கு

# mlClassificationNaiveBayes|
source: Training Parameters
de: Trainingsparameter
es: Parámetros del entrenamiento
gl: Parámetros de ensaio
id: Parameter Pelatihan
pt: Parâmetros de treinamento
ru: Гиперпараметры модели
ta: பயிற்சி அளவுருக்கள்

# mlClassificationNaiveBayes|
source: Algorithmic Settings
de: Algorithmus-Einstellungen
es: Configuraciones algorítmicas
gl: Configuracións Algorítmicas
id: Pengaturan Algoritmik
nl: Algoritmische Instellingen
pt: Configurações do algoritmo
ru: Настройки алгоритма
ta: வழிமுறை அமைப்புகள்

# mlClassificationNaiveBayes|
source: Smoothing parameter
es: Parámetro del suavizado
gl: Parámetro de alisamento
id: Parameter penghalusan
nl: Afvlakparameter
pt: Parâmetro de suavização
ta: மென்மையான அளவுரு

# mlClassificationNaiveBayes|
source: A positive double controlling the amount of Laplace smoothing applied. The default (0) disables Laplace smoothing alltogether.
es: Un doble positivo que controla la cantidad del suavizado de Laplace aplicado. El valor predeterminado (0) desactiva completamente el suavizado de Laplace.
gl: Un dobre positivo que controla o grao do alisamento de Laplace que se aplica. O predeterminado (0) inhabilita totalmente o alisamento de Laplace.
id: Ganda positif mengontrol jumlah penghalusan Laplace yang diterapkan. Default (0) menonaktifkan penghalusan Laplace sama sekali.
nl: Een positief getal dat de hoeveelheid toegepaste Laplace-afvlakking regelt. De standaardwaarde (0) schakelt Laplace-afvlakken helemaal uit.
pt: Um duplo positivo que controla a quantidade de suavização de Laplace aplicada. O padrão (0) desabilita completamente a suavização de Laplace.
ta: லாப்லேச் மென்மையாக்கலின் அளவைக் கட்டுப்படுத்தும் நேர்மறையான இரட்டை கட்டுப்படுத்துதல். இயல்புநிலை (0) லாப்லேச் மென்மையானது alltogether ஐ முடக்குகிறது.
