Repository: jasp-stats/jaspMachineLearning
Catalog: po/QML-*.po
Languages: de, es, gl, id, nl, pt, ru, ta

# AlgorithmicSettings|
source: Min. observations in node
de: Min. Beobachtungen in Knoten
es: Mín. observaciones en el nodo
gl: Mín. observacións no nodo
id: Min. pengamatan dalam simpul
nl: Min. observaties per knoop
pt: Mín. observações no nó
ru: Мин. наблюдений на узел
ta: மணித்துளி. முனையில் அவதானிப்புகள்

# AlgorithmicSettings|
source: Integer specifying the minimum number of observations in the terminal nodes of the trees. Note that this is the actual number of observations, not the total weight.
de: Ganze Zahl zur Angabe der Mindestanzahl von Beobachtungen in den Endknoten der Bäume. Beachten Sie, dass dies die tatsächliche Anzahl von Beobachtungen ist, nicht das Gesamtgewicht.
es: Entero que especifica el número mínimo de observaciones en los nodos terminales de los árboles. Observa que este es el número vigente de observaciones, no la ponderación total.
gl: Enteiro que especifica o número mínimo de observacións nos nodos terminais das árbores. Cae na conta de que este é o número vixente de observacións, non a ponderación total.
id: Bilangan bulat yang menentukan jumlah minimum pengamatan pada simpul terminal pohon. Perhatikan bahwa ini adalah jumlah observasi yang sebenarnya, bukan total bobot.
nl: Een integer die specificeert wat het minimum aantal observaties in de terminale knopen van de bomen is. Dit is het echte aantal observaties, niet het totale gewicht.
pt: Número inteiro que especifica o número mínimo de observações nos nós terminais das árvores. Observe que este é o número real de observações, não o peso total.
ru: Целочисленное значение, задающее минимальное количество наблюдений на лист дерева. Следует иметь в виду, что это реальное абсолютное количество наблюдений, а не сумма весов.
ta: மரங்களின் முனைய முனைகளில் குறைந்தபட்ச அவதானிப்புகளின் எண்ணிக்கையைக் குறிப்பிடுகிறது. இது உண்மையான அவதானிப்புகளின் உண்மையான எண்ணிக்கை என்பதை நினைவில் கொள்க, மொத்த எடை அல்ல.

# AlgorithmicSettings|
source: Training data used per tree
de: Zu nutzende Trainingsdaten pro Baum
es: Datos de adiestramiento utilizados por árbol
gl: Datos de ensaio utilizados por árbore
id: Data pelatihan yang digunakan per pohon
nl: Training data gebruikt per boom
pt: Dados de treinamento usados por árvore
ru: Обучающих данных на дерево
ta: ஒரு மரத்திற்கு பயன்படுத்தப்படும் பயிற்சி தரவு

# AlgorithmicSettings|
source: Select the percentage of training data that is used to train each individual tree.
de: Wählen Sie den Prozentsatz der Trainingsdaten aus, die verwendet werden, um jeden einzelnen Baum zu trainieren.
es: Selecciona el porcentaje de datos de adiestramiento que se usa para adiestrar cada árbol individual.
gl: Selecciona a porcentaxe de datos de ensaio que se usa para ensaiar cada árbore individual.
id: Pilih persentase data pelatihan yang digunakan untuk melatih setiap pohon.
nl: Selecteer het percentage van training data die gebruikt word om elke individuele boom te trainen.
pt: Selecione a porcentagem de dados de treinamento que será usada para treinar cada árvore individual.
ru: Задает долю обучающей выборки, которая будет использована для обучения каждого отдельно взятого дерева.
ta: ஒவ்வொரு மரத்திற்கும் பயிற்சி அளிக்கப் பயன்படும் பயிற்சி தரவுகளின் சதவீதத்தைத் தேர்ந்தெடுக்கவும்.

source: Deviance
de: Devianz
es: Desviación
gl: Desviación
id: Penyimpangan
nl: Afwijking
pt: Desvio
ru: График ошибки
ta: விலகல்

# Deviance|
source: Shows the prediction error plotted against the number of trees.
de: Zeigt den Vorhersagefehler, der gegen die Anzahl der Bäume aufgetragen ist.
es: Muestra el error de predicción representado frente al número de árboles.
gl: Amosa o erro de predición representado fronte ao número de árbores.
id: Menunjukkan kesalahan prediksi yang diplot terhadap jumlah pohon.
nl: Toont de voorspellingsfout tegen het aantal bomen.
pt: Mostra o erro de previsão plotado em relação ao número de árvores.
ru: Показывает ошибку предсказания для модели, состоящей из разных количеств деревьев.
ta: மரங்களின் எண்ணிக்கையில் திட்டமிடப்பட்ட முன்கணிப்பு பிழை காட்டுகிறது.

# ModelOptimization|
source: Number of Trees
de: Anzahl Bäume
es: Número de Árboles
gl: Número de Árbores
id: Jumlah Pohon
nl: Aantal Bomen
pt: Número de Árvores
ru: Количество деревьев
ta: மரங்களின் எண்ணிக்கை

# ModelOptimization|
source: Choose how to optimize the model.
de: Wählen Sie, wie das Modell optimiert wird.
es: Escoger cómo optimizar el modelo.
gl: Escoller como optimizar o modelo.
id: Pilih cara mengoptimalkan model.
nl: Kies hoe het model geoptimaliseerd wordt.
pt: Escolha como otimizar o modelo.
ru: Управляйте оптимизацией модели.
ta: மாதிரியை எவ்வாறு மேம்படுத்துவது என்பதைத் தேர்வுசெய்க.

# ModelOptimization|
source: Fixed
de: Fest
es: Fijo
gl: Fixo
id: Tetap
nl: Vast
pt: Fixo
ru: Фиксированное
ta: சரி

# ModelOptimization|
source: Enables you to use a user-specified number of decision trees.
de: Ermöglicht es Ihnen, eine benutzerdefinierte Anzahl von Entscheidungsbäumen zu verwenden.
es: Permite utilizar un número de árboles de decisión especificado por el usuario.
gl: Permite utilizar un número de árbores de decisión especificado polo usuario.
id: Memungkinkan Anda menggunakan jumlah pohon keputusan yang ditentukan pengguna.
nl: Stelt je in staat om een zelf-gespecificeerd aantal beslissingenbomen te gebruiken.
pt: Permite que você use um número especificado pelo usuário de árvores de decisão.
ru: Позволяет задать определенное пользователем количество деревьев решений.
ta: பயனர் குறிப்பிட்ட எண்ணிக்கையிலான முடிவு மரங்களைப் பயன்படுத்த உங்களுக்கு உதவுகிறது.

# ModelOptimization|
source: Trees
de: Bäume
es: Árboles
gl: Árbores
id: Pohon
nl: Bomen
pt: Árvores
ta: மரங்கள்

# ModelOptimization|
source: The number of trees.
de: Die Anzahl der Bäume.
es: El número de árboles.
gl: O número de árbores.
id: Jumlah pohon.
nl: Het aantal bomen.
pt: O número de árvores.
ru: Количество деревьев.
ta: மரங்களின் எண்ணிக்கை.

# ModelOptimization|
source: Optimized
de: Optimiert
es: Optimizado
gl: Optimizado
id: Dioptimalkan
nl: Geoptimaliseerd
pt: Otimizado
ru: Оптимизированное
ta: உகந்ததாக

# ModelOptimization|
source: Enables you to optimize the prediction error on a validation data set with respect to the number of trees.
de: Ermöglicht Ihnen, den Vorhersagefehler auf einem Validierungsdatensatz hinsichtlich der Anzahl der Bäume zu optimieren.
es: Permite optimizar el error de predicción en un conjunto de datos de validación, con respecto al número de árboles.
gl: Permite optimizar o erro de predición nun conxunto de datos de validación, con respecto ao número de árbores.
id: Memungkinkan Anda untuk mengoptimalkan kesalahan prediksi pada kumpulan data validasi sehubungan dengan jumlah pohon.
nl: Stelt je in staat om de voorspellingsfout te optimaliseren op een validatie data set op basis van het aantal bomen.
pt: Permite otimizar o erro de previsão em um conjunto de dados de validação em relação ao número de árvores.
ru: Позволяет оптимизировать ошибку предсказания для валидационной выборки, выбрав наилучшее количество деревьев.
ta: மரங்களின் எண்ணிக்கையைப் பொறுத்து சரிபார்ப்பு தரவுகளில் கணிப்பு பிழையை மேம்படுத்த உங்களுக்கு உதவுகிறது.

# ModelOptimization|
source: Max. trees
de: Max. Bäume
es: Máx. árboles
gl: Máx. árbores
id: Maks. pohon
nl: Max. bomen
pt: Máx. árvores
ru: Макс. деревьев
ta: அதிகபட்சம். மரங்கள்

# ModelOptimization|
source: Sets the maximum number of possible decision trees to be considered. At default, this is set to 100.
de: Setzt die maximale Anzahl möglicher Entscheidungsbäume, die in Betracht gezogen wird. Standardmäßig ist dies auf 100 gesetzt.
es: Establece el número máximo de posibles árboles de decisión a considerar. Por defecto, se establece en 100.
gl: Establece o número máximo de posibles árbores de decisión a considerar. Por defecto, establécese en 100.
id: Mengatur jumlah maksimum pohon keputusan yang mungkin dipertimbangkan. Secara default, ini diatur ke 100.
nl: Geef het aantal mogelijke beslissingenbomen om beschouwd te worden aan. Standaard is dit 100.
pt: Define o número máximo de árvores de decisão possíveis a serem consideradas. Por padrão, é definido como 100.
ru: Задает максимальное количество деревьев решений для рассмотрения при формировании модели. По умолчанию выбрано значение 100.
ta: கருத்தில் கொள்ள வேண்டிய அதிகபட்ச முடிவு மரங்களின் எண்ணிக்கையை அமைக்கிறது. இயல்பாக, இது 100 ஆக அமைக்கப்பட்டுள்ளது.

# Oob|
source: Out-of-bag improvement
de: Out-of-bag Verbesserung
es: Mejora "descubierto el pastel"
gl: Mellora "descuberto o choio"
id: Peningkatan di luar kantong
nl: Out-of-bag verbetering
pt: Melhoria 'fora da bolsa'
ru: Улучшение на неотобранных
ta: பை-க்கு வெளியே முன்னேற்றம்

# Oob|
source: Plots the number of trees against the out-of-bag classification accuracy improvement of the model. Accuracy is assessed for the training set.
de: Zeigt die Anzahl der Bäume gegen die Out-of-bag Klassifizierungsgenauigkeitsverbesserung des Modells. Die Genauigkeit wird für die Trainingsmenge bewertet.
es: Representa gráficamente el número de árboles frente a la mejora en la precisión de la clasificación "descubierto el pastel" del modelo. La precisión se evalúa para el conjunto de adiestramiento.
gl: Representa graficamente o número de árbores fronte á mellora na precisión da clasificación "descuberto o choio" do modelo. A precisión avalíase para o conxunto de ensaio.
id: Memplot jumlah pohon terhadap peningkatan akurasi klasifikasi di luar kantong dari model. Akurasi dinilai untuk set pelatihan.
nl: Het aantal bomen tegen de verbetering in classificatie nauwkeurigheid van het model. Nauwkeurigheid wordt beoordeeld voor de trainingsset.
pt: Representa o número de árvores em relação à melhoria na precisão da classificação fora da bolsa do modelo. A precisão é avaliada para o conjunto de treinamento.
ru: Отображает улучшение точности классификации неотобранных наблюдений, достигаемое изменением количества деревьев в модели. Точность оценивается на обучающей выборке.
ta: மாதிரியின் பேக் வகைப்பாடு துல்லியம் மேம்பாட்டிற்கு எதிராக மரங்களின் எண்ணிக்கையைத் திட்டமிடுகிறது. பயிற்சி தொகுப்பிற்கு துல்லியம் மதிப்பிடப்படுகிறது.

source: Relative influence
de: Relativer Einfluß
es: Influencia relativa
gl: Influencia relativa
id: Pengaruh relatif
nl: Relatieve invloed
pt: Influência relativa
ru: Относительное влияние
ta: உறவினர் செல்வாக்கு

# RelativeInfluence|
source: Shows the relative influence of the features.
de: Zeigt den relativen Einfluss der Merkmale.
es: Muestra la influencia relativa de las características.
gl: Amosa a influencia relativa das características.
id: Menunjukkan pengaruh relatif dari fitur.
nl: Toont de relatieve invloed van de kenmerken.
pt: Mostra a influência relativa das características.
ru: Показывает относительные значения влияния каждого из признаков.
ta: அம்சங்களின் ஒப்பீட்டு செல்வாக்கைக் காட்டுகிறது.

# AlgorithmicSettings|
source: Min. observations for split
de: Min. Beobachtungen für Aufteilung
es: Mín. observaciones por división
gl: Mín. observacións por división
id: Min. pengamatan untuk pemisahan
nl: Min. observaties voor splitsing
pt: Mín. observações por divisão
ru: Мин. наблюдений для разделения
ta: மணித்துளி. பிளவுக்கான அவதானிப்புகள்

# AlgorithmicSettings|
source: The minimum number of observations that must exist in a node in order for a split to be attempted.
de: Die minimale Anzahl von Beobachtungen, die in einem Knoten vorhanden sein müssen, um eine Aufteilung zu probieren.
es: El número mínimo de observaciones que deben existir en un nodo para que se intente una división.
gl: O número mínimo de observacións que deben existir nun nodo para que se intente unha división.
id: Jumlah minimum observasi yang harus ada dalam sebuah node agar pemisahan dapat dilakukan.
nl: Het minimum aantal observaties die moeten bestaan in een knoop om een split te proberen.
pt: O número mínimo de observações que devem existir em um nó para que uma divisão seja tentada.
ru: Минимальное количество наблюдений, которые должны принадлежать узлу дерева для того, чтобы была сделана попытка их дальнейшего разделения.
ta: ஒரு பிளவு முயற்சிப்பதற்காக ஒரு முனையில் இருக்க வேண்டிய குறைந்தபட்ச அவதானிப்புகள்.

# AlgorithmicSettings|
source: Min. observations in terminal
de: Min. Beobachtungen am Ende
es: Mín. observaciones en el terminal
gl: Mín. observacións no terminal
id: Min. pengamatan di terminal
nl: Min. observaties in bladeren
pt: Mín. observações no terminal
ru: Мин. наблюдений на лист
ta: மணித்துளி. முனையத்தில் அவதானிப்புகள்

# AlgorithmicSettings|
source: The minimum number of observations in any terminal node.
de: Die minimale Anzahl der Beobachtungen in jedem Endknoten.
es: El número mínimo de observaciones en cualquier nodo de la terminal.
gl: O número mínimo de observacións en calquera nodo da terminal.
id: Jumlah minimum pengamatan di simpul terminal mana pun.
nl: Het minimum aantal observaties in elke eindknoop.
pt: O número mínimo de observações em qualquer nó terminal.
ru: Минимальное количество наблюдений, которые должны принадлежать каждому листу дерева.
ta: எந்த முனைய முனையிலும் குறைந்தபட்ச அவதானிப்புகள்.

# AlgorithmicSettings|
source: Max. interaction depth
de: Max. Interaktionstiefe
es: Máx. profundidad de la interacción
gl: Máx. profundidade da interacción
id: Maks. kedalaman interaksi
nl: Max. interactiediepte
pt: Máx. profundidade de interação
ru: Макс. глубина
ta: அதிகபட்சம். தொடர்பு ஆழம்

# AlgorithmicSettings|
source: Set the maximum depth of any node of the final tree.
de: Setzen Sie die maximale Tiefe jedes Knotens des endgültigen Baumes.
es: Establecer la máxima profundidad de cualquier nodo del árbol final.
gl: Establecer a máxima profundidade de calquera nodo da árbore final.
id: Mengatur kedalaman maksimum dari setiap simpul pada pohon akhir.
nl: Zet de maximale diepte van elke knoop in de laatste boom.
pt: Defina a profundidade máxima de qualquer nó da árvore final.
ru: Установить максимальную глубину узлов финального дерева.
ta: இறுதி மரத்தின் எந்த முனையின் அதிகபட்ச ஆழத்தையும் அமைக்கவும்.

source: Attempted splits
de: Versuchte Aufteilungen
es: Divisiones intentadas
gl: Divisións intentadas
id: Percobaan pemisahan
nl: Geprobeerde splitsingen
pt: Tentativas de divisão
ru: Варианты разделений
ta: முயற்சித்த பிளவுகள்

# AttemptedSplits|
source: Shows the splits made by the algorithm, the corresponding features and split points, and the number of observations (which are not missing and are of positive weight) sent left or right by the split. It also shows the improvement in deviance given by the splits.
de: Zeigt die Aufteilungen durch den Algorithmus, die entsprechenden Merkmale und Spaltpunkte, und die Anzahl der Beobachtungen (die nicht fehlen und positives Gewicht haben) die von der Aufteilung nach links oder rechts gesendet wurden. Es zeigt auch die Verbesserung der Devianz, die die Aufteilungen ergeben.
es: Muestra las divisiones que hizo el algoritmo, las características correspondientes y los puntos de división; y el número de observaciones (que no se perdieron y tienen ponderación positiva) enviadas a la izquierda o a la derecha de la división. También muestra la mejora en la desviación que proporcionan las divisiones.
gl: Amosa as divisións que fixo o algoritmo, as características correspondentes e os puntos de división; e o número de observacións (que non se perderon e teñen ponderación positiva) enviadas á esquerda ou á dereita pola división. Tamén amosa a mellora na desviación que proporcionan as divisións.
id: Menunjukkan pemisahan yang dilakukan oleh algoritma, fitur dan titik pemisahan yang sesuai, dan jumlah pengamatan (yang tidak hilang dan memiliki bobot positif) yang dikirim ke kiri atau ke kanan oleh pemisahan. Ini juga menunjukkan peningkatan penyimpangan yang diberikan oleh pemisahan.
nl: Toont de splitsingen gemaakt door het algoritme, de corresponderende kenmerken en de splitpunten, en het aantal observaties (die niet missen en een positief gewicht hebben) die links of rechts van de split liggen. Het toont ook de verbetering in nauwkeurigheid door de splitsingen.
pt: Mostra as divisões feitas pelo algoritmo, as características e pontos de divisão correspondentes, e o número de observações (que não estão faltando e têm peso positivo) enviadas para a esquerda ou direita pela divisão. Também mostra a melhoria no desvio proporcionado pelas divisões.
ru: Показывает выполненные алгоритмом разделения, соответствующие им признаки и точки разделений, а также количество наблюдений (которые не являются пропущенными и имеют положительный вес), отнесенных разделением в левый или правый узел. Также показывает уменьшение ошибки, достигнутое этими разделениями.
ta: அல்காரிதம், தொடர்புடைய நற்பொருத்தங்கள் மற்றும் பிளவு புள்ளிகள் மற்றும் அவதானிப்புகளின் எண்ணிக்கை (அவை காணவில்லை மற்றும் நேர்மறை எடை கொண்டவை) இடது அல்லது வலதுபுறத்தில் பிளவு மூலம் அனுப்பப்படும் பிளவு ஆகியவற்றைக் காட்டுகிறது. பிளவுகளால் வழங்கப்பட்ட விலகலின் முன்னேற்றத்தையும் இது காட்டுகிறது.

# AttemptedSplits|
source: Only show splits in tree
es: Mostrar solo las divisiones en el árbol
gl: Amosar só as divisións na árbore
id: Hanya menampilkan pemisahan di pohon
nl: Toon alleen splitsingen in boom
pt: Mostrar apenas divisões na árvore
ru: Только выполненные разделения
ta: மரத்தில் பிளவுகளை மட்டுமே காண்பி

# AttemptedSplits|
source: Remove splits that do not occur in the final tree from the table.
de: Aufteilungen entfernen, die nicht im finalen Baum der Tabelle auftreten.
es: Quita las divisiones que no aparecen en el árbol final, de la tabla.
gl: Quita as divisións que non aparecen na árbore final, da táboa.
id: Hapus pemisahan yang tidak terjadi di pohon akhir dari tabel.
nl: Verwijder splitsingen die niet plaatsvinden in de uiteindelijke boom.
pt: Remova as divisões que não ocorrem na árvore final da tabela.
ru: Удалить из таблицы разделения, которые не вошли в состав финального дерева.
ta: இறுதி மரத்தில் ஏற்படாத பிளவுகளை அட்டவணையில் இருந்து அகற்றவும்.

# TreePlot|
source: Decision tree
de: Entscheidungsbaum
es: Árbol de decisión
gl: Árbore de decisión
nl: Beslisboom
pt: Árvore de decisão
ru: Дерево решений
ta: முடிவு மரம்

# TreePlot|
source: Creates a plot that visualizes the decision tree and its leafs.
de: Erstellt ein Diagramm zur Visualisierung des Entscheidungsbaums und seinen Blättern.
es: Crea un gráfico que visualiza el árbol de decisión y sus hojas.
gl: Crea unha gráfica que visualiza a árbore de decisión e as súas follas.
nl: Creëert een figuur die de beslissingsboom en zijn bladeren visualiseert.
pt: Cria um gráfico que visualiza a árvore de decisão e suas folhas.
ru: Рисует диаграмму, визуализирующую дерево решений и его листья.
ta: முடிவு மரத்தையும் அதன் இலைகளையும் காட்சிப்படுத்தும் ஒரு சதித்திட்டத்தை உருவாக்குகிறது.

# AlgorithmicSettings|
source: Weights
de: Gewichte
es: Ponderaciones
gl: Ponderacións
id: Bobot
nl: Gewichten
pt: Pesos
ru: Функция весов
ta: எடைகள்

# AlgorithmicSettings|
source: Rectangular
de: Rechteckig
id: Persegi panjang
nl: Rechthoekig
pt: Retangular
ru: Прямоугольная
ta: செவ்வக

# AlgorithmicSettings|
source: Triangular
de: Dreieckig
id: Segitiga
nl: Driehoekig
ru: Треугольная
ta: முக்கோண

# AlgorithmicSettings|
source: Biweight
es: Ponderación doble
gl: Ponderación dobre
nl: Bigewicht
pt: Peso duplo
ru: Би-взвешенная
ta: இரு எடை

# AlgorithmicSettings|
source: Triweight
es: Ponderación triple
gl: Ponderación tripla
nl: Trigewicht
pt: Peso triplo
ru: Три-взвешенная
ta: ட்ரைவெயிட்

# AlgorithmicSettings|
source: Cosine
de: Kosinus
es: Coseno
gl: Coseno
id: Cosinus
nl: Cosinus
pt: Cosseno
ru: Косинус
ta: துணைசெவ்வளைவு

# AlgorithmicSettings|
source: Inverse
es: Inversa
gl: Inversa
id: Kebalikannya
nl: Omgekeerd
pt: Inverso
ru: Обратная
ta: தலைகீழ்

# AlgorithmicSettings|
source: Gaussian
de: Gaußsch
es: Normal
gl: Normal
nl: Gaussische
pt: Gaussiano
ru: Гауссова
ta: காசியன்

# AlgorithmicSettings|
source: Rank
de: Rang
es: Rango
gl: Rango
id: Peringkat
nl: Rang
pt: Ranque
ru: Ранговая
ta: தரவரிசை

# AlgorithmicSettings|
source: Optimal
es: Óptimo
gl: Óptimo
nl: Optimaal
pt: Ótimo
ru: Оптимальная
ta: உகந்த

# AlgorithmicSettings|
source: Sets the weighting scheme for the nearest neighbors. The default rectangular option results in standard knn, while the other options expand the algorithm by weighing the nearest neighbors. See also the kknn package.
de: Setzt das Gewichtungsschema für die nächsten Nachbarn. Die standardmäßige rechteckige Option führt zu Standard-KNN, während die anderen Optionen den Algorithmus erweitern, indem die nächsten Nachbarn gewichtet werden. Siehe auch das Paket kknn.
es: Establece el esquema de ponderaciones para los vecinos más cercanos. La opción rectangular predeterminada da como resultado un típico knn, mientras que las otras opciones amplían el algoritmo ponderando los vecinos más cercanos. Consulta también el paquete kknn.
gl: Establece o esquema de ponderacións para os veciños máis próximos. A opción rectangular predeterminada ten como resultado un típico knn, namentres as outras opcións amplían o algoritmo ponderando os veciños máis próximos. Consulta tamén o paquete kknn.
id: Mengatur skema pembobotan untuk tetangga terdekat. Opsi persegi panjang default menghasilkan knn standar, sementara opsi lainnya memperluas algoritme dengan menimbang tetangga terdekat. Lihat juga paket kknn.
nl: Zet het gewichtsschema voor de dichtstbijzijnde buren. De standaard rechthoekige optie resulteert in standaard kan, terwijl de andere opties het algoritme uitbreiden door de dichtstbijzijnde buren te wegen. Zie ook het kknn pakket.
pt: Define o esquema de ponderação para os vizinhos mais próximos. A opção retangular padrão resulta no knn padrão, enquanto as outras opções expandem o algoritmo ponderando os vizinhos mais próximos. Veja também o pacote kknn.
ru: Задает функцию весов для обнаружения ближайших соседей. Значение "Прямоугольная", выбранное по умолчанию, соответствует стандартному алгоритму kNN, в то время как другие варианты расширяют алгоритм, добавляя взвешивание расстояний до соседей. См. также пакет kknn языка R.
ta: அருகிலுள்ள அண்டை நாடுகளுக்கான வெயிட்டிங் திட்டத்தை அமைக்கிறது. இயல்புநிலை செவ்வக விருப்பம் நிலையான KNN இல் விளைகிறது, மற்ற விருப்பங்கள் அருகிலுள்ள அண்டை நாடுகளை எடைபோடுவதன் மூலம் வழிமுறையை விரிவுபடுத்துகின்றன. KKNN தொகுப்பையும் காண்க.

# AlgorithmicSettings|
source: Distance
de: Distanz
es: Distancia
gl: Distancia
id: Jarak
nl: Afstand
pt: Distância
ta: தூரம்

# AlgorithmicSettings|
source: Euclidian
de: Euklidisch
es: Euclídeo
gl: Euclídeo
nl: Euclidisch
pt: Euclidiano
ru: Евклидова
ta: யூக்ளிடியன்

# AlgorithmicSettings|
source: Manhattan
ta: மன்ஆட்டன்
