Repository: jasp-stats/jaspMachineLearning
Catalog: po/QML-*.po
Languages: de, es, gl, id, nl, pt, ru, ta

# ClusterInfo|
source: Adds a row with the center per feature of each cluster to the table. The center can be the mean, median or mode depending on the clustering algorithm.
de: Fügt eine Zeile mit dem Zentrum pro Merkmal von jedem Cluster zur Tabelle hinzu. Das Zentrum kann je nach Clustering-Algorithmus der Mittelwert, Median oder Modus sein.
es: Añade una fila a la tabla, con el centro por característica de cada conglomerado. El centro puede ser la media, la mediana o la moda dependiendo del algoritmo de conglomeración.
gl: Engade unha fila á táboa, co centro por característica de cada conglomerado. O centro pode ser a media, a mediana ou a moda dependendo do algoritmo de conglomeración.
id: Menambahkan baris dengan pusat per fitur dari setiap klaster ke tabel. Pusat dapat berupa rata-rata, median, atau modus, tergantung pada algoritme pengelompokan.
nl: Voegt een rij met het centrum per kenmerk van elke cluster toe aan de tabel. Het centrum kan het gemiddelde, de median of de modus zijn, afhankelijk van het clusteralgoritme.
pt: Adiciona uma linha com o centro por característica de cada agrupamento à tabela. O centro pode ser a média, a mediana ou a moda, dependendo do algoritmo de agrupamento.
ru: Добавляет в таблицу строки с координатами центра, вычисленными по каждому признаку для каждого из кластеров. В зависимости от выбранной настройки алгоритма, они могут вычисляться как среднее арифметическое, медиана или мода значений признака.
ta: ஒவ்வொரு கிளச்டரின் ஒரு அம்சத்திற்கு மையத்துடன் ஒரு வரிசையை அட்டவணையில் சேர்க்கிறது. கிளச்டரிங் வழிமுறையைப் பொறுத்து நடுவண் சராசரி, சராசரி அல்லது பயன்முறையாக இருக்கலாம்.

# ClusterInfo|
source: Between sum of squares
de: Zwischen-Quadratsumme
es: Suma de cuadrados Entre
gl: Suma de cadrados Entre
id: Antara jumlah kuadrat
nl: Tussen kwadratensom
pt: Soma dos quadrados entre
ru: Межкластерная сумма квадратов
ta: சதுரங்களின் தொகைக்கு இடையில்

# ClusterInfo|
source: Adds a note with the between sum of squares of the cluster model to the table.
de: Eine Notiz mit der Zwischen-Quadratsumme des Cluster-Modells zur Tabelle hinzufügen.
es: Añade un apunte a la tabla, con la suma de cuadrados Entre del modelo de conglomerado.
gl: Engade un apuntamento á táboa, coa suma de cadrados Entre do modelo de conglomerado.
id: Menambahkan catatan dengan jumlah kuadrat antara model klaster ke tabel.
nl: Voegt een voetnoot met de tussen kwadratensom van het clustermodel toe aan de tabel.
pt: Adiciona uma nota com a soma dos quadrados do modelo de agrupamento à tabela.
ru: Добавляет снизу таблицы примечание с межкластерной суммой квадратов расстояний до центра всей модели.
ta: கிளச்டர் மாதிரியின் சதுரங்களின் தொகைக்கு இடையில் ஒரு குறிப்பை அட்டவணையில் சேர்க்கிறது.

# ClusterInfo|
source: Total sum of squares
de: Gesamte Quadratsumme
es: Suma de cuadrados Totales
gl: Suma de cadrados Totais
id: Jumlah total kuadrat
nl: Totale kwadratensom
pt: Soma de quadrados total
ru: Полная сумма квадратов
ta: சதுரங்களின் மொத்த தொகை

# ClusterInfo|
source: Adds a note with the total sum of squares of the cluster model to the table.
de: Eine Notiz mit der gesamten Quadratsumme des Cluster-Modells zur Tabelle hinzufügen.
es: Añade un apunte a la tabla, con la suma de cuadrados Total del modelo de conglomerado.
gl: Engade un apuntamento á táboa, coa suma de cadrados Total do modelo de conglomerado.
id: Menambahkan catatan dengan jumlah total kuadrat dari model klaster ke tabel.
nl: Voegt een voetnoot met de totale som van het clustermodel toe aan de tabel.
pt: Adiciona uma nota com a soma total dos quadrados do modelo de agrupamento à tabela.
ru: Добавляет снизу таблицы примечание с полной суммой квадратов расстояний для всей модели.
ta: கிளச்டர் மாதிரியின் மொத்த சதுரங்களுடன் ஒரு குறிப்பை அட்டவணையில் சேர்க்கிறது.

# ClusterMeans|
source: Shows a table containing the cluster means for each feature variable.
de: Zeigt eine Tabelle mit den Clustermittelwerten für jede Merkmalsvariable.
es: Muestra una tabla que contiene las medias de los conglomerados para cada variable de característica.
gl: Amosa unha táboa que contén as medias dos conglomerados para cada variable de característica.
id: Menampilkan tabel yang berisi rata-rata klaster untuk setiap variabel fitur.
nl: Toont een tabel met de cluster gemiddelde voor elk kenmerk.
pt: Mostra uma tabela contendo as médias do agrupamento para cada variável de característica.
ru: Показывает таблицу, содержащую средние значения по кластерам для каждой из переменных-признаков.
ta: ஒவ்வொரு அம்ச மாறிக்கும் கிளச்டர் வழிமுறைகளைக் கொண்ட அட்டவணையைக் காட்டுகிறது.

source: Confusion matrix
de: Konfusionsmatrix
es: Matriz de desorden
gl: Matriz de desarranxo
id: Matriks kebingungan
nl: Verwarringsmatrix
pt: Matriz de confusão
ru: Матрица ошибок
ta: குழப்ப மேட்ரிக்ச்

# ConfusionMatrix|
source: Displays a table that shows the observed classes against the predicted classes. Used to assess model accuracy.
de: Zeigt eine Tabelle mit den beobachteten Klassen gegen die vorhergesagten Klassen. Wird verwendet, um die Modellgenauigkeit zu bewerten.
es: Presenta una tabla que muestra las clases observadas frente a las clases predichas. Se utiliza para verificar la precisión del modelo.
gl: Presenta unha táboa que amosa as clases observadas fronte ás clases preditas. Se utiliza para verificar a precisión do modelo.
id: Menampilkan tabel yang menunjukkan kelas yang diamati terhadap kelas yang diprediksi. Digunakan untuk menilai akurasi model.
nl: Toont een tabel met de werkelijke klassen tegen de voorspelde klassen. Wordt beoordeeld om de nauwkeurigheid van het model te beoordelen.
pt: Exibe uma tabela que compara as classes observadas com as classes previstas. Usado para avaliar a precisão do modelo.
ru: Отображает таблицу, показывающую действительные классы наблюдений напротив предсказанных моделью классов. Используется для оценки точности модели.
ta: கணிக்கப்பட்ட வகுப்புகளுக்கு எதிராக கவனிக்கப்பட்ட வகுப்புகளைக் காட்டும் அட்டவணையைக் காட்டுகிறது. மாதிரி துல்லியத்தை மதிப்பிடுவதற்குப் பயன்படுத்தப்படுகிறது.

# ConfusionMatrix|
source: Display proportions
de: Verhältnisse anzeigen
es: Mostrar proporciones
gl: Presentar as proporcións
id: Menampilkan proporsi
nl: Toon proporties
pt: Exibir proporções
ru: Отображать доли
ta: விகிதாச்சாரத்தைக் காண்பி

# ConfusionMatrix|
source: Displays proportions in the confusion matrix instead of counts.
de: Zeigt in der Konfusionsmatrix Verhältnisse anstelle von Häufigkeiten an.
es: Presenta las proporciones en la matriz de desorden en lugar de los recuentos.
gl: Presenta as proporcións na matriz de desarranxo en troques dos recontos.
id: Menampilkan proporsi dalam matriks kebingungan, bukan hitungan.
nl: Toon proporties in de verwarmingsmatrix in plaats van getallen.
pt: Exibe proporções na matriz de confusão em vez de contagens.
ru: Отображать в матрице ошибок доли вместо абсолютных значений.
ta: எண்ணிக்கைக்கு பதிலாக குழப்ப மேட்ரிக்சில் விகிதாச்சாரத்தைக் காட்டுகிறது.

source: Explain predictions
de: Vorhersagen erklären
es: Explicar las predicciones
gl: Explicar as predicións
id: Menjelaskan prediksi
nl: Verklaar voorspellingen
pt: Explicar previsões
ta: கணிப்புகளை விளக்குங்கள்

# ExplainPredictions|
source: Cases
de: Fälle
es: Casos
gl: Casos
id: Kasus
nl: Gevallen
pt: Casos
ta: வழக்குகள்

# ExplainPredictions|
source: The test set index of the first row to be displayed in the table.
de: Der Testsatz-Index aus der ersten Zeile zur Anzeige in der Tabelle.
es: El índice del conjunto de test de la primera fila que se presenta en la tabla.
gl: O índice do conxunto de probas da primeira fila que se presenta na táboa.
id: Indeks set pengujian dari baris pertama yang akan ditampilkan dalam tabel.
nl: De test set index van de eerste rij om in de tabel te worden getoond.
pt: O índice do conjunto de teste da primeira linha a ser exibida na tabela.
ru: Индекс наблюдения в тестовой выборке, с которого будет начинаться таблица.
ta: அட்டவணையில் காட்டப்படும் முதல் வரிசையின் சோதனை தொகுப்பு குறியீடு.

# ExplainPredictions|
source: to
de: bis
es: a
gl: a
id: untuk
nl: tot
pt: para
ta: பெறுநர்

# ExplainPredictions|
source: The test set index of the last row to be displayed in the table.
de: Der Testsatz-Index aus der letzten Zeile zur Anzeige in der Tabelle.
es: El índice del conjunto de test de la última fila que se presenta en la tabla.
gl: O índice do conxunto de probas da última fila que se presenta na táboa.
id: Indeks set pengujian dari baris terakhir yang akan ditampilkan dalam tabel.
nl: De test set index van de laatste rij om in de tabel te worden getoond.
pt: O índice do conjunto de teste da última linha a ser exibida na tabela.
ru: Индекс наблюдения в тестовой выборке, на которое будет заканчиваться таблица.
ta: அட்டவணையில் காட்டப்பட வேண்டிய கடைசி வரிசையின் சோதனை தொகுப்பு குறியீடு.

source: Feature importance
de: Merkmal-Wichtigkeit
es: Importancia de la característica
gl: Importancia da característica
id: kepentingan fitur
nl: Belang van kenmerken
pt: Importância da característica
ru: Важность признаков
ta: அம்ச முக்கியத்துவம்

# FeatureImportance|
source: Shows the available feature importance metrics for the fitted model.
de: Zeigt die verfügbaren Metriken zur Merkmalswichtigkeit für das angepasste Modell.
es: Muestra las métricas disponibles de la importancia de las características para el modelo ajustado.
gl: Amosa as métricas dispoñibles da importancia das características para o modelo axustado.
id: Menunjukkan metrik kepentingan fitur yang tersedia untuk model yang dipasang.
nl: Toont de beschikbare kenmerken voor belangrijkheid in het getrainde model.
pt: Mostra as métricas de importância das características disponíveis para o modelo ajustado.
ru: Показывает вычисленные для обученной модели значения метрик важности признаков.
ta: பொருத்தப்பட்ட மாதிரிக்கான கிடைக்கக்கூடிய அம்ச முக்கியத்துவம் அளவீடுகளைக் காட்டுகிறது.

source: Model performance
es: Capacidad del modelo
gl: Capacidade do modelo
id: Performa model
nl: Modelprestatie
pt: Desempenho do modelo
ru: Оценки качества модели
ta: மாதிரி செயல்திறன்

# ModelPerformance|
source: Displays available model performance metrics. For regression, these metrics include mean squared error (MSE), root mean squared error (RMSE), R<sup>2</sup> and more. For classification, these metrics include precision, recall, the F1-score, support, AUC (area under the ROC curve) and more.
es: Presenta las métricas disponibles de la capacidad del modelo. Para la regresión, estas métricas incluyen el Error Cuadrado Medio (ECM, MSE), Raíz del Error Cuadrado Medio (RECM, RMSE), R<sup>2</sup> y otros. Para la clasificación, estas métricas incluyen precisión, recuerdo, la puntuación F1, soporte, ABC (AUC, área bao la curva ROC) y otros.
gl: Presenta as métricas dispoñibles da capacidade do modelo. Para a regresión, estas métricas inclúen o Erro Cadrado Medio (ECM, MSE), Raíz do Erro Cadrado Medio (RECM, RMSE), R<sup>2</sup> e outros. Para a clasificación, estas métricas inclúen precisión, recordo, a puntuación F1, soporte, ABC (AUC, área baixo a curva ROC) e outros.
nl: Toont beschikbare metrieke voor modelprestatie. Voor regressie zijn dit de gemiddelde kwadratenfout (MSE), de wortel van de gemiddelde kwadratenfout (RMSE), R<sup>2</sup> en meer. Voor classificatie zijn dit de precisie, recall, de F1-score, steun, AUC (area onder de ROC curve) en meer.
ta: கிடைக்கக்கூடிய மாதிரி செயல்திறன் அளவீடுகளைக் காட்டுகிறது. பின்னடைவைப் பொறுத்தவரை, இந்த அளவீடுகளில் சராசரி ச்கொயர் பிழை (எம்எச்இ), ரூட் சராசரி ச்கொயர் பிழை (ஆர்எம்எச்இ), ஆர் <up> 2 </sup> மற்றும் பல உள்ளன. வகைப்பாட்டிற்கு, இந்த அளவீடுகளில் துல்லியம், நினைவுகூருதல், எஃப் 1-ச்கோர், உதவி, ஏ.யூ.சி (ஆர்ஓசி வளைவின் கீழ் பகுதி) மற்றும் பல உள்ளன.

source: Cluster Determination
es: Determinación de Conglomerados
gl: Determinación dos Conglomerados
id: Penentuan Klaster
nl: Clusterbepaling
pt: Determinação dos agrupamentos
ru: Определение количества кластеров
ta: கொத்து தீர்மானித்தல்

# ClusterDetermination|
source: Choose how to determine the number of clusters in the model.
de: Wählen Sie, wie die Anzahl der Cluster im Modell bestimmt wird.
es: Elige cómo determinar el número de conglomerados en el modelo.
gl: Elixe como determinar o número de conglomerados no modelo.
id: Pilih cara menentukan jumlah cluster dalam model.
nl: Kies hoe het aantal clusters in het model bepaalt wordt.
pt: Escolha como determinar o número de agrupamentos no modelo.
ru: Выбрать, каким образом будет определяться количество кластеров в модели.
ta: மாதிரியில் உள்ள கிளச்டர்களின் எண்ணிக்கையை எவ்வாறு தீர்மானிப்பது என்பதைத் தேர்வுசெய்க.

# ClusterDetermination|
source: Fixed
de: Fest
es: Fijo
gl: Fixo
id: Tetap
nl: Vast
pt: Fixo
ru: Фиксированное
ta: சரி

# ClusterDetermination|
source: Enables you to generate a fixed amount of clusters. This allows you to generate your own specified number of clusters, and thus, optimize manually.
de: Ermöglicht Ihnen, eine feste Anzahl von Clustern zu generieren. Dadurch können Sie Ihre eigene vorgegebene Anzahl von Clustern generieren und so manuell optimieren.
es: Habilita que generes una cantidad fija de conglomerados. Esto permite que generes tu propio número específico de conglomerados, y así optimizar manualmente.
gl: Habilita que xeres unha cantidade fixa de conglomerados. Isto permite que xeres o teu propio número específico de conglomerados, e así optimizar manualmente.
id: Memungkinkan Anda menghasilkan jumlah kluster yang tetap. Hal ini memungkinkan Anda untuk menghasilkan jumlah cluster yang Anda tentukan sendiri, dan dengan demikian, mengoptimalkan secara manual.
nl: Stelt je in staat om een vast aantal clusters te genereren. Hierdoor kun je een zelf-gespecificeerd aantal clusters genereren en handmatig optimaliseren.
pt: Permite gerar uma quantidade fixa de agrupamentos. Isso permite que você gere seu próprio número especificado de agrupamentos e, assim, otimize manualmente.
ru: Фиксирует количество генерируемых кластеров. Необходимое количество задается и оптимизируется вручную.
ta: ஒரு குறிப்பிட்ட அளவு கொத்துக்களை உருவாக்க உங்களுக்கு உதவுகிறது. இது உங்கள் சொந்த குறிப்பிட்ட எண்ணிக்கையிலான கிளச்டர்களை உருவாக்க உங்களை அனுமதிக்கிறது, இதனால், கைமுறையாக மேம்படுத்தவும்.

# ClusterDetermination|
source: Clusters
de: Cluster
es: Conglomerados
gl: Conglomerados
id: Kluster
pt: Agrupamentos
ru: Кластеров
ta: கொத்துகள்

# ClusterDetermination|
source: The number of clusters to be fitted.
de: Die Anzahl der anzupassenden Cluster.
es: El número de conglomerados a ajustar.
gl: O número de conglomerados a axustar.
id: Jumlah kluster yang akan dipasang.
nl: Het aantal clusters wat gebruikt wordt.
pt: O número de agrupamentos a ajustar.
ru: Количество кластеров, создаваемых моделью.
ta: பொருத்தப்பட வேண்டிய கிளச்டர்களின் எண்ணிக்கை.

# ClusterDetermination|
source: Optimized according to
de: Optimiert nach
es: Optimizado según
gl: Optimizado consonte a
id: Dioptimalkan menurut
nl: Geoptimaliseerd volgens
pt: Otimizado de acordo com
ru: Оптимизированное в соответствии с
ta: அதன்படி உகந்ததாக

# ClusterDetermination|
source: Enables you to choose an optimization method. BIC optimization is set as default.
de: Ermöglicht die Auswahl einer Optimierungsmethode. Die BIC-Optimierung ist standardmäßig eingestellt.
es: Te permite escoger un método de optimización. La optimización BIC se establece como predeterminada.
gl: Te permite escoller un método de optimización. A optimización BIC establécese como predeterminada.
id: Memungkinkan Anda memilih metode pengoptimalan. Pengoptimalan BIC ditetapkan sebagai default.
nl: Stelt je een in staat om een optimalisatie methode kiezen. De BIC-optimalisatie is standaard.
pt: Permite escolher um método de otimização. A otimização CIB é definida como padrão.
ru: Позволяет выбрать критерий оптимизации. По умолчанию выбран критерий BIC.
ta: தேர்வுமுறை முறையைத் தேர்வுசெய்ய உங்களுக்கு உதவுகிறது. BIC உகப்பாக்கம் இயல்புநிலையாக அமைக்கப்பட்டுள்ளது.

# ClusterDetermination|
source: The method of optimization. The options are AIC, BIC, and silhouette. The AIC uses the within sum of squares (within-cluster variation), the number of generated clusters and the number of dimensions for optimizing the clustering output. The BIC uses the within sum of squares (within-cluster variation), the number of generated clusters, the number of dimensions, and the sample size for optimizing the clustering output. The silhouette value uses the similarity of observations within a cluster and their dissimilarity to other clusters for optimizing the clustering output.
de: Die Optimierungsmethode. Die Optionen sind AIC, BIC und Silhouette. Das AIC verwendet die Binnen-Quadratsumme (Variation innerhalb der Cluster), die Anzahl der erzeugten Cluster und die Anzahl der Dimensionen zur Optimierung der Cluster-Ausgabe. Das BIC verwendet die Binnen-Quadratsumme (Variation innerhalb der Cluster), die Anzahl der erzeugten Cluster, die Anzahl der Dimensionen und den Stichprobenumfang zur Optimierung der Cluster-Ausgabe. Der Silhouette-Wert verwendet die Ähnlichkeit von Beobachtungen innerhalb eines Clusters und ihre Unähnlichkeit zu anderen Clustern zur Optimierung der Cluster-Ausgabe.
es: El método de optimización. Las opciones son AIC, BIC y silueta. El AIC utiliza la suma de cuadrados Dentro (variación de conglomerados Dentro), el número de conglomerados generados y el número de dimensiones, para optimizar el resultado de la conglomeración. El BIC usa la suma de cuadrados Dentro (variación de conglomerados Dentro), el número de conglomerados generados, el número de dimensiones, y el tamaño muestral para optimizar el resultado de la conglomeración. El valor de silueta utiliza la similitud de las observaciones dentro de un conglomerado y su disimilitud con las de otros conglomerados para optimizar el resultado de la conglomeración.
gl: O método de optimización. As opcións son AIC, BIC, e silueta. O AIC utiliza a suma de cadrados Dentro (variación de conglomerados Dentro), o número de conglomerados xerados e o número de dimensións, para optimizar o resultado da conglomeración. O BIC usa a suma de cadrados Dentro (variación de conglomerados Dentro), o número de conglomerados xerados, o número de dimensións, e o tamaño mostral para optimizar o resultado da conglomeración. O valor de silueta utiliza a semellanza das observacións dentro dun conglomerado e a súa diferenza coas doutros conglomerados para optimizar o resultado da conglomeración.
id: Metode pengoptimalan. Pilihannya adalah AIC, BIC, dan siluet. AIC menggunakan jumlah kuadrat dalam (variasi dalam klaster), jumlah klaster yang dihasilkan, dan jumlah dimensi untuk mengoptimalkan output pengelompokan. BIC menggunakan jumlah kuadrat dalam (variasi dalam klaster), jumlah klaster yang dihasilkan, jumlah dimensi, dan ukuran sampel untuk mengoptimalkan output pengelompokan. Nilai silhouette menggunakan kemiripan pengamatan dalam sebuah cluster dan ketidakmiripan mereka dengan cluster lain untuk mengoptimalkan hasil pengelompokan.
nl: De optimalisatiemethode. De opties zijn AIC, BIC en silhouette. De AIC gebruikt de som van de kwadraten (variatie binnen clusters), het aantal gegenereerde clusters en het aantal dimensies voor het optimaliseren van de clustering. De BIC gebruikt de som van de kwadraten (variatie binnen clusters), het aantal gegenereerde clusters, het aantal dimensies en de steekproefgrootte voor het optimaliseren van de clustering. De silhouetwaarde gebruikt de gelijkenis van observaties binnen een cluster en hun ongelijkenis met andere clusters om de clustering te optimaliseren.
pt: O método de otimização. As opções são AIC, CIB e silhueta. O AIC utiliza a soma dos quadrados internos (variação dentro do agrupamento), o número de agrupamentos gerados e o número de dimensões para otimizar a saída do agrupamento. O CIB utiliza a soma dos quadrados internos (variação dentro do cluster), o número de agrupamentos gerados, o número de dimensões e o tamanho da amostra para otimizar a saída do agrupamento. O valor da silhueta utiliza a similaridade das observações dentro de um agrupamento e sua dissimilaridade com outros agrupamentos para otimizar a saída do agrupamento.
ru: Критерий оптимизации. В качестве вариантов критериев предлагаются AIC, BIC и оценка силуэта. AIC использует внутрикластерную сумму квадратов расстояний (внутрикластерную вариацию), количество генерируемых кластеров и количество измерений. BIC использует внутрикластерную сумму квадратов расстояний (внутрикластерную вариацию), количество генерируемых кластеров, количество измерений и объем выборки. Оценка силуэта использует сходство наблюдений внутри данного кластера и их расхождение с наблюдениями из других кластеров.
ta: தேர்வுமுறை முறை. விருப்பங்கள் AIC, BIC மற்றும் நிழல். AIC சதுரங்களின் தொகைக்குள் (கிளச்டர் மாறுபாடு), உருவாக்கப்பட்ட கிளச்டர்களின் எண்ணிக்கை மற்றும் கிளச்டரிங் வெளியீட்டை மேம்படுத்துவதற்கான பரிமாணங்களின் எண்ணிக்கை ஆகியவற்றைப் பயன்படுத்துகிறது. BIC சதுரங்களின் தொகைக்குள் (கிளச்டர் மாறுபாடு), உருவாக்கப்பட்ட கிளச்டர்களின் எண்ணிக்கை, பரிமாணங்களின் எண்ணிக்கை மற்றும் கிளச்டரிங் வெளியீட்டை மேம்படுத்துவதற்கான மாதிரி அளவு ஆகியவற்றைப் பயன்படுத்துகிறது. நிழல் மதிப்பு ஒரு கிளச்டருக்குள் உள்ள அவதானிப்புகளின் ஒற்றுமையையும், கிளச்டரிங் வெளியீட்டை மேம்படுத்துவதற்காக மற்ற கிளச்டர்களுடனான அவற்றின் ஒற்றுமையையும் பயன்படுத்துகிறது.

# ClusterDetermination|
source: Max. clusters
de: Max. Cluster
es: Máx. conglomerados
gl: Máx. conglomerados
id: Maks. kluster
pt: Máx. agrupamentos
ru: Макс. кластеров
ta: அதிகபட்சம். கொத்துகள்

# ClusterDetermination|
source: Sets the maximum number of possible clusters to be generated. At default, this is set to 10.
de: Setzt die maximale Anzahl möglicher Cluster, die erzeugt werden. Standardmäßig ist dies auf 10 gesetzt.
es: Determina el número máximo de posibles conglomerados que se van generar. Por defecto, se establece en 10.
gl: Determina o número máximo de posibles conglomerados que se van xerar. Por defecto, establécese en 10.
id: Mengatur jumlah maksimum kluster yang mungkin dibuat. Secara default, ini diatur ke 10.
nl: Stelt het maximum aantal mogelijke clusters om gegenereerd te worden in. Standaard is dit 10.
pt: Define o número máximo de agrupamentos possíveis a serem gerados. Por padrão, é definido como 10.
ru: Устанавливает максимальное количество кластеров, которые могут быть сгенерированы. По умолчанию выбрано значение 10.
ta: உருவாக்கப்பட வேண்டிய அதிகபட்ச கொத்துக்களின் அதிகபட்ச எண்ணிக்கையை அமைக்கிறது. இயல்பாக, இது 10 ஆக அமைக்கப்பட்டுள்ளது.

# DataSplit|
source: Choose how to create the test set.
de: Wählen Sie, wie die Testmenge erstellt wird.
es: Escoger cómo crear el conjunto de contraste.
gl: Escoller como crear o conxunto de proba.
id: Pilih cara membuat set pengujian.
nl: Kies hoe de test set gemaakt moet worden.
pt: Escolha como criar o conjunto de testes.
ta: சோதனை தொகுப்பை எவ்வாறு உருவாக்குவது என்பதைத் தேர்வுசெய்க.
