Repository: jasp-stats/jaspMachineLearning
Catalog: po/QML-*.po
Languages: de, es, gl, id, nl, pt, ru, ta

# NodePurity|
source: Displays a figure with total increase in node purity per feature in the model.
de: Zeigt ein Diagramm mit einer Gesamtzunahme der Knotenreinheit pro Merkmal im Modell an.
es: Presenta un gráfico con el aumento total de la pureza del nodo por característica del modelo.
gl: Presenta unha gráfica co incremento total da pureza do nodo por característica do modelo.
id: Menampilkan angka dengan total peningkatan kemurnian simpul per fitur dalam model.
nl: Creëert een figuur met totale toename in knoopzuiverheid per kenmerk in het model.
pt: Exibe uma figura com o aumento total na pureza do nó por característica no modelo.
ru: Отображает график, показывающий суммарный рост чистоты узлов модели по каждому признаку.
ta: மாதிரியில் ஒரு அம்சத்திற்கு முனை தூய்மையின் மொத்த அதிகரிப்பு கொண்ட ஒரு உருவத்தைக் காட்டுகிறது.

# Oob|
source: Out-of-bag error
es: Error "descubierto el pastel"
gl: Erro "descuberto o choio"
id: Kesalahan di luar kantong
nl: Out-of-bag fout
pt: Erro 'fora da sacola'
ru: Ошибка по неотобранным
ta: பேக்-க்கு வெளியே பிழை

# Oob|
source: Out-of-bag accuracy
es: Precisión "descubierto el pastel"
gl: Precisión "descuberto o choio"
id: Akurasi di luar kantong
nl: Out-of-bag nauwkeurigheid
pt: Exatidão 'fora da sacola'
ru: Точность по неотобранным
ta: பேக் துல்லியம்

# Oob|
source: Plots the number of trees against the out-of-bag mean squared error (regression) or accuracy (classification) of the model.
es: Representa gráficamente el número de árboles frente al error cuadrado medio "descubierto el pastel" (en la regresión) o a la precisión (en la clasificación) del modelo.
gl: Representa graficamente o número de árbores fronte ao erro cadrado medio "descuberto o choio" (na regresión) ou á precisión (na clasificación) do modelo.
id: Memplot jumlah pohon terhadap kesalahan kuadrat rata-rata di luar kantong (regresi) atau akurasi (klasifikasi) model.
nl: Creëert een figuur met het aantal bomen tegen de out-of-bag gemiddelde kwadraatsom (regressie) of nauwkeurigheid (classificatie) van het model.
pt: Plota o número de árvores em relação ao erro quadrático médio 'fora da sacola' (regressão) ou exatidão (classificação) do modelo.
ru: Рисует график зависимости среднеквадратичной ошибки (в регрессии) или точности (в классификации) неотобранных наблюдений от количества деревьев в модели.
ta: பேக்குக்கு வெளியே மரங்களின் எண்ணிக்கையைத் திட்டமிடுகிறது, இது மாதிரியின் சதுர பிழை (பின்னடைவு) அல்லது துல்லியம் (வகைப்பாடு).

# CoefficientTable|
source: Coefficients
de: Koeffizienten
es: Coeficientes
gl: Coeficientes
id: Koefisien
nl: Coëfficiënten
pt: Coeficientes
ta: குணகங்கள்

# CoefficientTable|
source: Shows a table containing the regression coefficients.
de: Zeigt eine Tabelle mit den Regressionskoeffizienten.
es: Muestra la tabla que contiene los coeficientes de la regresión.
gl: Amosa a táboa que contén os coeficientes da regresión.
id: Menampilkan tabel yang berisi koefisien regresi.
nl: Toont een tafel met de regressiecoefficiënten.
pt: Mostra uma tabela contendo os coeficientes de regressão.
ru: Показывает таблицу, содержащую коэффициенты регрессии.
ta: பின்னடைவு குணகங்களைக் கொண்ட அட்டவணையைக் காட்டுகிறது.

# CoefficientTable|
source: Confidence interval
de: Konfidenzintervall
es: Intervalo de confianza
gl: Intervalo de confianza
id: Interval kepercayaan
nl: Betrouwbaarheidsinterval
pt: Intervalo de confiança
ru: Доверительный интервал
ta: நம்பிக்கை இடைவெளி

# CoefficientTable|
source: Display confidence intervals around estimated regression coefficients.
de: Zeige Konfidenzintervalle um geschätzte Regressionskoeffizienten.
es: Presenta los intervalos de confianza alrededor de los coeficientes de la regresión.
gl: Presenta os intervalos de confianza arredor dos coeficientes da regresión.
id: Menampilkan interval kepercayaan di sekitar estimasi koefisien regresi.
nl: Toon betrouwbaarheidsintervallen voor de schattingen van de regressiecoëfficiënten.
pt: Exibir intervalos de confiança em torno dos coeficientes de regressão estimados.
ru: Показать доверительные интервалы для каждого из рассчитанных коэффициентов регрессии.
ta: மதிப்பிடப்பட்ட பின்னடைவு குணகங்களைச் சுற்றி நம்பிக்கை இடைவெளிகளைக் காண்பி.

# CoefficientTable|
source: The confidence level for the interval.
de: Das Konfidenzniveau des Intervalls.
es: El nivel de confianza del intervalo.
gl: O nivel de confianza do intervalo.
id: Tingkat kepercayaan untuk interval.
nl: Het betrouwbaarheidsniveau voor het interval.
pt: O nível de confiança para o intervalo.
ru: Уровень доверия для интервала.
ta: இடைவெளியின் நம்பிக்கை நிலை.

# CoefficientTable|
source: Display equation
de: Gleichung anzeigen
es: Presentar la ecuación
gl: Presentar a ecuación
id: Persamaan tampilan
nl: Toon vergelijking
pt: Exibir equação
ru: Показать уравнение
ta: காட்சி சமன்பாடு

# CoefficientTable|
source: Display the regression equation with the estimated values of the coefficients.
de: Zeige die Regressionsgleichung mit den geschätzten Werten der Koeffizienten.
es: Presentar la ecuación de regresión con los valores estimados para los coeficientes.
gl: Presentar a ecuación de regresión cos valores estimados para os coeficientes.
id: Menampilkan persamaan regresi dengan nilai estimasi koefisien.
nl: Toon de regressievergelijking met de geschatte waarden van de coëfficiënten.
pt: Exiba a equação de regressão com os valores estimados dos coeficientes.
ru: Показать уравнение регрессии с рассчитанными значениями коэффициентов.
ta: பின்னடைவு சமன்பாட்டை குணகங்களின் மதிப்பிடப்பட்ட மதிப்புகளுடன் காண்பி.

# Intercept|
source: Include intercept
de: Konstante einbeziehen
es: Incluir constante
gl: Incluír a constante
id: Termasuk mencegat
nl: Voeg intercept toe
pt: Incluir intercepto
ru: Включить свободный член
ta: இடைமறிப்பு சேர்க்கவும்

# Intercept|
source: Whether to include an intercept in the regression formula.
de: Ob eine Konstante in die Regressionsformel aufgenommen werden soll.
es: Si incluir una constante en la fórmula de la regresión.
gl: Se incluír unha constante na fórmula da regresión.
id: Apakah akan menyertakan intersep dalam rumus regresi.
nl: Of er een intercept in de regressievergelijking moet worden opgenomen.
pt: Se deve ou não incluir um intercepto na fórmula de regressão.
ru: Включить свободный член в формулу регрессии.
ta: பின்னடைவு சூத்திரத்தில் ஒரு இடைமறிப்பைச் சேர்க்க வேண்டுமா.

# VariablesFormRegularizedRegression|
source: Target
de: Ziel
es: Objetivo
gl: Obxectivo
id: Sasaran
nl: Doelvariabele
pt: Alvo
ru: Целевая переменная
ta: இலக்கு

# VariablesFormRegularizedRegression|
source: In this box, the variable that needs to be predicted should be entered.
de: In diesem Feld sollte die Variable eingegeben werden, die vorhergesagt werden muss.
es: En esta caja debe introducirse la variable que se necesita predecir.
gl: Nesta caixa debe introducirse a variable que se necesita predicir.
id: Di dalam kotak ini, variabel yang perlu diprediksi harus dimasukkan.
nl: In dit vak moet de variabele die voorspeld moet worden ingevuld worden.
pt: Nesta caixa, você deve inserir a variável que precisa ser prevista.
ru: В это поле вносится переменная, которая будет содержать предсказания модели.
ta: இந்த பெட்டியில், கணிக்க வேண்டிய மாறி உள்ளிடப்பட வேண்டும்.

# VariablesFormRegularizedRegression|
source: Features
de: Merkmale
es: Características
gl: Características
id: Fitur
nl: Kenmerken
pt: Características
ta: நற்பொருத்தங்கள்

# VariablesFormRegularizedRegression|
source: In this box, the variables that provide information about the target variable should be entered.
de: In diesem Feld sollten die Variablen eingegeben werden, die Informationen über die Zielvariable liefern.
es: En esta caja deben introducirse las variables que proporcionan información sobre la variable objetivo.
gl: Nesta caixa deben introducirse as variables que proporcionan información sobre a variable obxectivo.
id: Pada kotak ini, variabel-variabel yang memberikan informasi mengenai variabel sasaran harus dimasukkan.
nl: In dit vak moeten de kenmerken die informatie over de doelvariabele geven moeten worden ingevuld.
pt: Nesta caixa, devem ser inseridas as variáveis que fornecem informações sobre a variável de destino.
ru: В это поле вносится переменная, содержащая информацию о целевых значениях.
ta: இந்த பெட்டியில், இலக்கு மாறியைப் பற்றிய தகவல்களை வழங்கும் மாறிகள் உள்ளிடப்பட வேண்டும்.

# VariablesFormRegularizedRegression|
source: Weights
de: Gewichte
es: Ponderaciones
gl: Ponderacións
id: Bobot
nl: Gewichten
pt: Pesos
ru: Веса
ta: எடைகள்

# VariablesFormRegularizedRegression|
source: In this box, an optional variable containing case weights can be entered.
de: In diesem Feld kann eine optionale Variable mit Fallgewichtungen eingetragen werden.
es: En esta caja se puede introducir una variable opcional que contenga las ponderaciones de cada caso.
gl: Nesta caixa pode introducirse unha variable opcional que conteña as ponderacións de cada caso.
id: Dalam kotak ini, variabel opsional yang berisi bobot huruf dapat dimasukkan.
nl: In dit vak kan een optionele variabele met gewichten ingevuld worden.
pt: Nesta caixa, uma variável opcional contendo pesos de caso pode ser inserida.
ru: В это поле может быть внесена опциональная переменная, содержащая веса наблюдений.
ta: இந்த பெட்டியில், வழக்கு எடைகளைக் கொண்ட ஒரு விருப்ப மாறி உள்ளிடலாம்.

# AlgorithmicSettings|
source: Radial
nl: Radiaal
ru: Радиальное
ta: ஆரவாட்டு

# AlgorithmicSettings|
source: Polynomial
es: Polinómico
gl: Polinómico
id: Polinomial
nl: Polynomiaal
pt: Polinomial
ru: Полиномиальное
ta: அடுக்குக்கோவை

# AlgorithmicSettings|
source: Sigmoid
es: Sigmoidal
gl: Sigmoidal
nl: Sigmoïde
pt: Sigmoide
ru: Сигмоидное
ta: சிக்மாய்டு

# AlgorithmicSettings|
source: The kernel used in training and predicting. Possible kernels are 'linear', 'radial', 'polynomial', and 'sigmoid'.
de: Der Kernel der in Training und Vorhersage verwendet wird. Mögliche Kernel sind 'linear', 'radial', 'polynomial' und 'sigmoid'.
es: El núcleo utilizado en el adiestramiento y la predicción. Los posibles núcleos son 'lineal', 'radial', 'polinómico' y 'sigmoidal'.
gl: O núcleo utilizado no ensaio e a predición. Os posibles núcleos son 'linear', 'radial', 'polinómico' e 'sigmoidal'.
id: Kernel yang digunakan dalam pelatihan dan prediksi. Kernel yang memungkinkan adalah 'linear', 'radial', 'polinomial', dan 'sigmoid'.
nl: De kernel gebruikt voor het trainen en voorspellen. Mogelijke kernels zijn 'linear', 'radiaal', 'polynomiaal' en 'sigmoïde'.
pt: O núcleo usado no treinamento e na previsão. Os núcleos possíveis são "linear", "radial", "polinomial" e "sigmoide".
ru: Ядро, используемое для обучения и предсказания. Возможно использовать линейное, радиальное, полиномиальное и сигмоидное ядра.
ta: கர்னல் பயிற்சி மற்றும் கணிப்பதில் பயன்படுத்தப்படுகிறது. சாத்தியமான கர்னல்கள் 'நேரியல்', 'ரேடியல்', 'பல்லுறுப்புறுப்பு' மற்றும் 'சிக்மாய்டு'.

# AlgorithmicSettings|
source: Degree
de: Grad
es: Grado
gl: Grao
id: Derajat
nl: Graad
pt: Grau
ru: Степень
ta: பட்டம்

# AlgorithmicSettings|
source: The degree of polynomial used.
de: Der verwendete Polynomgrad.
es: El grado del polinomio utilizado.
gl: O grao do polinomio utilizado.
id: Derajat polinomial yang digunakan.
nl: De graad van de gebruikte polynomiaal.
pt: O grau do polinômio usado.
ru: Степень используемого полинома.
ta: பயன்படுத்தப்படும் பல்லுறுப்புக்கோலின் அளவு.

# AlgorithmicSettings|
source: Gamma parameter
es: Parámetro Gamma
gl: Parámetro Gamma
id: Parameter gamma
pt: Parâmetro gama
ru: Гамма-параметр
ta: காமா அளவுரு

# AlgorithmicSettings|
source: The gamma parameter used.
de: Der verwendete Gamma-Parameter.
es: El parámetro Gamma utilizado.
gl: O parámetro Gamma utilizado.
id: Parameter gamma yang digunakan.
nl: De gebruikte gamma parameter.
pt: O parâmetro gama usado.
ru: Используемое значение гамма-параметра.
ta: பயன்படுத்தப்படும் காமா அளவுரு.

# AlgorithmicSettings|
source: r parameter
es: parámetro r
gl: parámetro r
id: parameter r
pt: parâmetro r
ru: r-параметр
ta: r அளவுரு

# AlgorithmicSettings|
source: The complexity parameter used.
de: Der verwendete Komplexitätsparameter.
es: El parámetro de complejidad utilizado.
gl: O parámetro de complexidade utilizado.
id: Parameter kompleksitas yang digunakan.
nl: De gebruikte complexiteitsparameter.
pt: O parâmetro de complexidade usado.
ru: Используемое значение параметра сложности.
ta: பயன்படுத்தப்படும் சிக்கலான அளவுரு.

# AlgorithmicSettings|
source: Tolerance of termination criterion
de: Toleranz des Abbruchkriteriums
es: Tolerancia del criterio de finalización
gl: Tolerancia do criterio de finalización
id: Toleransi terhadap kriteria penghentian
nl: Tolerantie van beëindigingscriterium
pt: Tolerância do critério de término
ru: Погрешность критерия останова
ta: முடித்தல் அளவுகோலின் சகிப்புத்தன்மை

# AlgorithmicSettings|
source: The tolerance of termination criterion.
de: Die Toleranz des Abbruchkriteriums.
es: La tolerancia del criterio de finalización.
gl: A tolerancia do criterio de finalización.
id: Toleransi kriteria penghentian.
nl: De toleratie van het beëindigingscriterium.
pt: A tolerância do critério de término.
ru: Погрешность вычисления критерия останова.
ta: முடித்தல் அளவுகோலின் சகிப்புத்தன்மை.

# AlgorithmicSettings|
source: Epsilon
es: Épsilon
gl: Épsilon
pt: Épsilon
ru: Эпсилон
ta: எப்சிலன்

# AlgorithmicSettings|
source: The epsilon parameter in the insensitive-loss function.
es: El parámetro épsilon en la función de pérdida insensible.
gl: O parámetro épsilon na función de perda insensible.
nl: De epsilon parameter in de intensieve verliesfunctie.
pt: O parâmetro épsilon na função de perda insensível.
ru: Эпсилон-параметр в функции потерь с порогом чувствительности.
ta: உணர்வற்ற-இழப்பு செயல்பாட்டில் எப்சிலன் அளவுரு.

source: Support vectors
de: Support-Vektoren
es: Vectores de soporte
gl: Vectores de soporte
id: Vektor pendukung
nl: Ondersteuningsvectoren
pt: Vetores de suporte
ru: Опорные вектора
ta: உதவி திசையன்கள்

# SupportVectors|
source: Shows a table containing the data (points) indicated as support vectors by the algorithm.
de: Zeigt eine Tabelle mit den durch den Algorithmus als Support-Vektoren angegebenen Daten (Punkte).
es: Muestra una tabla que contiene los datos (puntos) indicados como vectores de soporte por el algoritmo.
gl: Amosa unha táboa que contén os datos (puntos) indicados como vectores de soporte polo algoritmo.
id: Menampilkan tabel yang berisi data (titik) yang diindikasikan sebagai vektor dukungan oleh algoritme.
nl: Laat een tabel zien met de data(punten) die aangegeven zijn als ondersteuningsvectoren door het algoritme.
pt: Mostra uma tabela contendo os dados (pontos) indicados como vetores de suporte pelo algoritmo.
ru: Показывает таблицу, содержащую данные (наблюдения), отмеченные алгоритмом как опорные вектора.
ta: வழிமுறையால் உதவி திசையன்களாக சுட்டிக்காட்டப்பட்ட தரவு (புள்ளிகள்) கொண்ட அட்டவணையைக் காட்டுகிறது.

# AndrewsCurve|
source: Andrews curves
de: Andrews-Kurven
es: Curvas de Andrews
gl: Curvas de Andrews
id: Kurva Andrews
nl: Andrewskrommen
pt: Curvas de Andrews
ru: Кривые Эндрюса
ta: ஆண்ட்ரூச் வளைவுகள்

# AndrewsCurve|
source: Is a way to visualize structure in high-dimensional data. Lines that cluster are observations that are more alike.
de: Ist eine Methode zur Visualisierung von Struktur in hochdimensionalen Daten. Linien die sich gruppieren sind Beobachtungen, die sich ähnlicher sind.
es: Es un modo de visualizar la estructura en los datos de alta dimensión. Las lineas que se agrupan son observaciones que se parecen más.
gl: É un xeito de visualizar a estrutura nos datos de alta dimensión. As liñas que se agrupan son observacións que se asemellan máis.
id: Merupakan cara untuk memvisualisasikan struktur dalam data berdimensi tinggi. Garis-garis yang mengelompok adalah pengamatan yang lebih mirip.
nl: Is een manier om structuur te visualiseren in hoogdimensionale gegevens. Lijnen die clusteren zijn observaties die meer op elkaar lijken.
pt: É uma maneira de visualizar estruturas em dados de alta dimensão. Linhas que se agrupam são observações mais semelhantes.
ru: Являются одним из способов визуализировать структуру многомерных данных. Линии, которые собираются в пучки, обозначают наблюдения с наибольшим сходством.
ta: உயர் பரிமாண தரவுகளில் கட்டமைப்பைக் காட்சிப்படுத்த ஒரு வழியாகும். கொத்து அந்த கோடுகள் மிகவும் ஒரே மாதிரியான அவதானிப்புகள்.

# ClusterDensity|
source: Cluster densities
de: Cluster-Dichten
es: Densidades de los conglomerados
gl: Densidades dos conglomerados
id: Kepadatan klaster
nl: Cluster dichtheden
pt: Densidades de agrupamento
ru: Плотности кластеров
ta: கொத்து அடர்த்தி

# ClusterDensity|
source: For each feature variable, generates a plot showing the overlapping densities for the clusters.
de: Für jede Merkmalsvariable wird ein Diagramm erzeugt, das die Überlappungsdichten für die Cluster zeigt.
es: Para cada variable de característica, genera un gráfico que muestra las densidades superpuestas para los conglomerados.
gl: Para cada variable de característica, xera unha gráfica que amosa as densidades superpostas para os conglomerados.
id: Untuk setiap variabel fitur, buatlah plot yang menunjukkan kepadatan yang tumpang tindih untuk klaster.
nl: Laat een plot met de overlappende dichtheden voor de clusters zien voor elk kenmerk.
pt: Para cada variável de característica, gera um gráfico mostrando as densidades sobrepostas para os agrupamentos.
ru: Генерирует для каждой из переменных-признаков график, показывающий пересекающиеся плотности распределения кластеров.
ta: ஒவ்வொரு அம்ச மாறிக்கும், கொத்துக்களுக்கான ஒன்றுடன் ஒன்று அடர்த்தியைக் காட்டும் சதித்திட்டத்தை உருவாக்குகிறது.

# ClusterDensity|
source: Group into one figure
de: In eine Abbildung gruppieren
es: Agrupar en un gráfico
gl: Agrupar nunha gráfica
id: Kelompokkan menjadi satu gambar
nl: Groupeer in één figuur
pt: Agrupar em uma figura
ru: Сгруппировать в одну картинку
ta: குழு ஒரு உருவமாக

# ClusterDensity|
source: Group the density plots per feature into a single figure.
de: Die Dichte-Diagramme pro Merkmal in eine einzelne Abbildung gruppieren.
es: Agrupa los gráficos de densidades por característica, en un único gráfico.
gl: Agrupa as gráficas de densidades por característica, nunha única gráfica.
id: Kelompokkan plot densitas per fitur ke dalam satu gambar.
nl: Groupeer de dichtheidsplots per kenmerk in een enkel figuur.
pt: Agrupe os gráficos de densidade por característica em uma única figura.
ru: Сгруппировать графики плотности признаков в единую диаграмму.
ta: ஒரு அம்சத்திற்கு அடர்த்தி அடுக்குகளை ஒரே உருவமாக தொகுக்கவும்.

# ClusterMatrix|
source: Cluster matrix plot
de: Cluster-Matrix-Diagramm
es: Gráfico de la matriz de los conglomerados
gl: Gráfica da matriz dos conglomerados
id: Plot matriks cluster
nl: Cluster matrix grafiek
pt: Gráfico de matriz de agrupamento
ru: Матричная диаграмма
ta: கிளச்டர் மேட்ரிக்ச் சூழ்ச்சி

# ClusterMatrix|
source: Creates a *n* x *n* plot that visualizes to which cluster every observation belongs according to the current model.
de: Erstellt ein *n* x *n*-Diagramm, das visualisiert, welche Beobachtung laut dem aktuellen Modell zu welchem Cluster gehört.
es: Genera un gráfico *n* x *n* que visualiza a qué conglomerado pertenece cada observación, de acuerdo con el modelo vigente.
gl: Xera unha gráfica *n* x *n* que visualiza a que conglomerado pertence cada observación, de acordo co modelo vixente.
id: Membuat plot *n* x *n* yang memvisualisasikan ke klaster mana setiap pengamatan berada menurut model saat ini.
nl: Creëert een *n* x *n* figuur welke visualiseert tot welke cluster elke observatie behoort volgens het huidige model.
pt: Cria um gráfico *n* x *n* que visualiza a qual agrupamento cada observação pertence de acordo com o modelo atual.
ru: Создает диаграмму в виде матрицы размера *n* x *n*, визуализирующую отнесение наблюдений текущей моделью к тому или иному кластеру.
ta: தற்போதைய மாதிரியின் படி ஒவ்வொரு அவதானிப்பும் எந்தக் கொத்துக்கு சொந்தமானது என்பதைக் காட்சிப்படுத்தும் * n * ஃச் * n * சதித்திட்டத்தை உருவாக்குகிறது.

source: Cluster means
de: CLuster-Mittelwerte
es: Medias de los conglomerados
gl: Medias dos conglomerados
id: Klaster berarti
nl: Cluster gemiddelden
pt: Médias dos agrupamentos
ru: Средние по кластерам
ta: கொத்து என்றால்

# ClusterMeans|
source: Creates a plot that visualizes and compares the mean of the feature variables in each cluster.
de: Erstellt ein Diagramm, das den Mittelwert der Merkmalsvariablen in jedem Cluster visualisiert und vergleicht.
es: Genera un gráfico que visualiza y compara la media de las variables de características en cada conglomerado.
gl: Xera unha gráfica que visualiza e compara a media das variables de características en cada conglomerado.
id: Membuat plot yang memvisualisasikan dan membandingkan rata-rata variabel fitur di setiap klaster.
nl: Creëert een figuur welke de gemiddelden van de kenmerken in elke cluster visualiseert en vergelijkt.
pt: Cria um gráfico que visualiza e compara a média das variáveis de recurso em cada agrupamento.
ru: Создает сравнительную диаграмму, показывающую средние значения переменных-признаков для каждого из кластеров.
ta: ஒவ்வொரு கிளச்டரிலும் உள்ள அம்ச மாறிகளின் சராசரியைக் காட்சிப்படுத்தி ஒப்பிடும் ஒரு சதித்திட்டத்தை உருவாக்குகிறது.

# ClusterMeans|
source: Display barplot
de: Balkdendiagramm anzeigen
es: Mostrar gráfico de barras
gl: Presentar gráfica de barras
id: Menampilkan diagram batang
nl: Toon staafdiagram
pt: Exibir gráfico de barras
ru: Гистограмма
ta: பார்ப்லாட்டைக் காண்பி

# ClusterMeans|
source: Transform the cluster mean figure into a barplot.
de: Das Cluster-Mittelwert-Diagramm in ein Balkendiagramm umwandeln.
es: Transformar el gráfico de la media de conglomerados en un gráfico de barras.
gl: Transformar a gráfica da media de conglomerados nunha gráfica de barras.
id: Ubah angka rata-rata klaster menjadi diagram batang.
nl: Verander de cluster gemiddelde grafiek in een staafdiagram.
pt: Transforme o valor médio do agrupamento em um gráfico de barras.
ru: Преобразовать диаграмму средних по кластерам к виду гистограммы.
ta: கிளச்டர் சராசரி உருவத்தை ஒரு பார்ப்லாட்டாக மாற்றவும்.

# ClusterMeans|
source: Group into one figure
de: In eine Abbildung gruppieren
es: Agrupar en un gráfico
gl: Agrupar nunha gráfica
id: Kelompokkan menjadi satu gambar
nl: Groupeer in één figuur
pt: Agrupar em uma figura
ta: குழு ஒரு உருவமாக

# ClusterMeans|
source: Group the plots per feature into a single figure.
de: Die Diagramme pro Merkmal in eine einzelne Abbildung gruppieren.
es: Agrupa los gráficos por característica en un único gráfico.
gl: Agrupa as gráficas por característica nunha única gráfica.
id: Kelompokkan plot per fitur ke dalam satu gambar.
nl: Groupeer de plots per kenmerk in een enkel figuur.
pt: Agrupe os gráficos por característica em uma única figura.
ru: Сгруппировать диаграммы, разбитые по признакам, в единую диаграмму.
ta: ஒரு அம்சத்திற்கு அடுக்குகளை ஒரே உருவமாக தொகுக்கவும்.

source: Data split
de: Datenaufteilung
es: División de datos
gl: División de datos
id: Pemisahan data
nl: Data splitsing
pt: Divisão de dados
ru: Разделение данных
ta: தரவு பிளவு
