Repository: jasp-stats/jaspMachineLearning
Catalog: po/QML-*.po
Languages: de, es, gl, id, nl, pt, ru, ta

# Description|
source: Machine Learning
de: Maschinelles Lernen
es: Aprendizaje de Máquina
gl: Aprendizaxe de Máquina
id: Pembelajaran mesin
pt: Aprendizado de Máquina
ru: Машинное обучение
ta: இயந்திர கற்றல்

# Description|
source: Regression
es: Regresión
gl: Regresión
id: Regresi
nl: Regressie
pt: Regressão
ru: Регрессия
ta: பின்னடைவு

# Description|
source: Boosting
es: Potenciación
gl: Potenciación
id: Meningkatkan
ru: Бустинг
ta: அதிகரிக்கும்

# Description|
source: Boosting Regression
es: Regresión de Potenciación
gl: Regresión de Potenciación
id: Meningkatkan Regresi
nl: Boosting Regressie
pt: Regressão por Boosting
ru: Регрессия методом бустинга
ta: பின்னடைவை அதிகரிக்கும்

# Description|
source: K-Nearest Neighbors
de: K-Nächste-Nachbarn
es: K Vecinos Más Próximos
gl: K Veciños Máis Próximos
nl: K-Dichtste Buren
pt: Vizinhos K-Mais Próximos
ru: K-ближайших соседей
ta: கே-அருகிலுள்ள அயலவர்கள்

# Description|
source: K-Nearest Neighbors Regression
de: K-Nächste-Nachbarn-Regression
es: Regresión de los K Vecinos Más Próximos
gl: Regresión dos K Veciños Máis Próximos
nl: K-Dichtste Buren Regressie
pt: Regressão de Vizinhos K-Mais Próximos
ru: Регрессия методом K-ближайших соседей
ta: கே-அருகிலுள்ள அண்டை பின்னடைவு

# Description|
source: Random Forest
es: Bosque Aleatorio
gl: Bosque Aleatorio
pt: Floresta Aleatória
ru: Случайный лес
ta: சீரற்ற காடு

# Description|
source: Random Forest Regression
es: Regresión de Bosques Aleatorios
gl: Regresión de Bosques Aleatorios
nl: Random Forest Regressie
pt: Regressão de Floresta Aleatória
ru: Регрессия методом случайного леса
ta: சீரற்ற வன பின்னடைவு

# Description|
source: Regularized Linear
de: Regularisiert Linear
es: Lineal Regularizado
gl: Linear Regularizado
nl: Geregulariseerde Lineaire
pt: Linear Regularizado
ru: Регуляризованная линейная
ta: ஒழுங்குபடுத்தப்பட்ட நேரியல்

# Description|
source: Regularized Linear Regression
de: Regularisiert Lineare Regression
es: Regresión Lineal Regularizada
gl: Regresión Linear Regularizada
nl: Geregulariseerde Lineaire Regressie
pt: Regressão Linear Regularizada
ru: Регуляризованная линейная регрессия
ta: நேரியல் பின்னடைவை முறைப்படுத்தியது

# Description|
source: Classification
de: Klassifikation
es: Clasificación
gl: Clasificación
id: Klasifikasi
nl: Classificatie
pt: Classificação
ru: Классификация
ta: வகைப்பாடு

# Description|
source: Boosting Classification
de: Boosting Klassifikation
es: Clasificación de Potenciación
gl: Clasificación de Potenciación
id: Meningkatkan Klasifikasi
nl: Boosting Classificatie
pt: Classificação de Boosting
ru: Классификация методом бустинга
ta: வகைப்பாட்டை அதிகரிக்கும்

# Description|
source: K-Nearest Neighbors Classification
de: K-Nächste-Nachbar-Klassifikation
es: Clasificación de los K-Vecinos más próximos
gl: Clasificación dos K veciños máis próximos
nl: K-Dichtste Buren Classificatie
pt: Classificação de Vizinhos K-Mais Próximos
ru: Классификация методом K-ближайших соседей
ta: கே-அருகிலுள்ள அண்டை வகைப்பாடு

# Description|
source: Linear Discriminant
de: Lineare Diskriminanzfunktion
es: Discriminante Lineal
gl: Discriminante Linear
id: Diskriminan Linier
nl: Lineaire Discriminant
pt: Discriminante Linear
ru: Линейный дискриминант
ta: நேரியல் பாகுபாடு

# Description|
source: Linear Discriminant Classification
de: Lineare-Diskriminanz-Klassifikation
es: Clasificación Discriminante Lineal
gl: Clasificación Discriminante Linear
id: Klasifikasi Diskriminan Linier
nl: Lineaire Discriminant Classificatie
pt: Classificação Discriminante Linear
ru: Классификация методом линейного дискриминантного анализа
ta: நேரியல் பாரபட்சமான வகைப்பாடு

# Description|
source: Random Forest Classification
de: Random-Forest-Klassifikation
es: Clasificación en Bosques Aleatorios
gl: Clasificación de Bosques Aleatorios
nl: Random Forest Classificatie
pt: Classificação de Floresta Aleatória
ru: Классификация методом случайного леса
ta: சீரற்ற வன வகைப்பாடு

# Description|
source: Clustering
es: Conglomeración
gl: Conglomeración
id: Pengelompokan
nl: Clusteren
pt: Agrupamento
ru: Кластеризация
ta: கிளச்டரிங்

# Description|
source: Density-Based
de: Dichtebasiert
es: Basado en la Densidad
gl: Baseado na Densidade
id: Berbasis Kepadatan
nl: Op dichtheid gebaseerd
pt: Baseado na Densidade
ru: Основанная на плотности
ta: அடர்த்தி அடிப்படையிலான

# Description|
source: Density-Based Clustering
de: Dichtebasiertes Clustering
es: Conglomeración Basada en la Densidad
gl: Conglomeración Baseada na Densidade
nl: Density-Based Clusteren
pt: Agrupamento Baseado na Densidade
ru: Кластеризация по плотности
ta: அடர்த்தி அடிப்படையிலான கிளச்டரிங்

# Description|
source: Fuzzy C-Means
es: Medias C Borrosas
gl: Medias C Borrosas
pt: C-Médias Difusas
ru: Нечеткая C-средних
ta: தெளிவற்ற சி-வழிமுறைகள்

# Description|
source: Fuzzy C-Means Clustering
es: Conglomeración con Medias C Borrosas
gl: Conglomeración con Medias C Borrosas
nl: Fuzzy C-Means Clusteren
pt: Agrupamento de C-Médias Difusas
ru: Нечеткая кластеризация C-средних
ta: தெளிவற்ற சி-அதாவது கிளச்டரிங்

# Description|
source: Hierarchical
de: Hierarchisch
es: Jerárquico
gl: Xerárquico
id: Hierarkis
nl: Hiërarchische
pt: Hierárquico
ru: Иерархическая
ta: படிநிலை

# Description|
source: Hierarchical Clustering
de: Hierarchisches Clustering
es: Conglomeración Jerárquica
gl: Conglomeración Xerárquica
id: Pengelompokan Hirarkis
nl: Hiërarchische Clustering
pt: Agrupamento Hierárquico
ru: Иерархическая кластеризация
ta: படிநிலை கிளச்டரிங்

# Description|
source: Random Forest Clustering
es: Conglomeración en Bosques Aleatorios
gl: Conglomeración de Bosques Aleatorios
nl: Random Forest Clusteren
pt: Agrupamento de Floresta Aleatória
ru: Кластеризация методом случайного леса
ta: சீரற்ற வன கிளச்டரிங்

# DataSplit|
source: Data Split Preferences
de: Optionen Datenaufspaltung
es: Preferencias para dividir datos
gl: Preferencias para dividir datos
id: Preferensi Pemisahan Data
nl: Data Split Voorkeuren
pt: Preferências de Divisão de Dados
ru: Настройки разделения данных
ta: தரவு பிளவு விருப்பத்தேர்வுகள்

# DataSplit|
source: Holdout Test Data
de: Testdaten vorenthalten
es: Retener los Datos de los Contrastes
gl: Reter os Datos das Probas
id: Data Uji Daya Tahan
nl: Opzijgezette Testgegevens
pt: Dados de teste de retenção
ru: Отложенная тестовая выборка
ta: ஓல்டவுட் சோதனை தரவு

# DataSplit|
source: Sample
de: Stichprobe
es: Muestra
gl: Mostra
id: Sampel
nl: Willekeurig
pt: Amostra
ru: Выделить
ta: மாதிரி

# DataSplit|
source: % of all data
de: % von allen Daten
es: % de todos los datos
gl: % de todos os datos
id: % dari semua data
nl: % van alle data
pt: % de todos os dados
ru: % всех данных
ta: எல்லா தரவிலும் %

# DataSplit|
source: Add generated indicator to data
de: Erzeugten Indikator den Daten hinzufügen
es: Agregar el índice generado a los datos
gl: Engadir o índice xerado aos datos
id: Menambahkan indikator yang dihasilkan ke data
nl: Voeg gegenereerde indicator toe aan data
pt: Adicionar indicador gerado aos dados
ru: Добавить индикатор тестовой выборки
ta: தரவுக்கு உருவாக்கப்பட்ட காட்டி சேர்க்கவும்

# DataSplit|
source: None
de: Keine
es: Ninguna
gl: Ningún
id: Tidak ada
nl: Geen
pt: Nenhum
ru: Не выбрано
ta: எதுவுமில்லை

# DataSplit|
source: Training and Validation Data
de: Trainings- und Validationsdaten
es: Datos de adiestramiento y validación
gl: Datos de ensaio e validación
id: Data Pelatihan dan Validasi
nl: Trainings- en validatiegegevens
pt: Dados de treino e validação
ru: Обучающая и валидационная выборки
ta: பயிற்சி மற்றும் சரிபார்ப்பு தரவு

# DataSplit|
source: % for validation data
de: % für Validationsdaten
es: % para datos de validación
gl: % para datos de validación
id: % untuk data validasi
nl: % van validatiedata
pt: % para dados de validação
ru: % для валидационной
ta: சரிபார்ப்பு தரவுகளுக்கு %

# DataSplit|
source: K-fold with
de: K-fold mit
es: Plegado K con
gl: Prego K con
nl: K-fold met
pt: Dobra em K com
ru: Кросс-валидация K-fold с
ta: K- மடங்கு

# DataSplit|
source: folds
es: pliegues
gl: pregos
id: lipatan
nl: vouwen
pt: dobras
ru: фолдами
ta: மடிப்புகள்

# DataSplit|
source: Leave-one-out
de: Lass-einen-aus
es: Dejar uno fuera
gl: Deixar un fóra
id: Tinggalkan-satu-keluar
nl: Laat-één-weg
pt: Deixe um de fora
ru: Кросс-валидация Leave-one-out
ta: விடுப்பு

# mlClassificationBoosting|
source: Tables
de: Tabellen
es: Tablas
gl: Táboas
id: Tabel
nl: Tabellen
pt: Tabelas
ru: Таблицы
ta: அட்டவணைகள்

# mlClassificationBoosting|
source: Plots
de: Diagramme
es: Gráficos
gl: Gráficas
id: Plot
nl: Grafieken
pt: Diagramas
ru: Графики
ta: அடுக்கு

# mlClassificationBoosting|
source: Training Parameters
de: Trainingsparameter
es: Parámetros de adiestramiento
gl: Parámetros de ensaio
id: Parameter Pelatihan
nl: Trainingsparameters
pt: Parâmetros de treinamento
ru: Гиперпараметры модели
ta: பயிற்சி அளவுருக்கள்

# mlClassificationBoosting|
source: Algorithmic Settings
de: Algorithmus-Einstellungen
es: Configuraciones Algorítmicas
gl: Configuracións Algorítmicas
id: Pengaturan Algoritmik
nl: Algoritme-instellingen
pt: Configurações do algoritmo
ru: Настройки алгоритма
ta: வழிமுறை அமைப்புகள்

# mlClassificationKnn|
source: Tables
de: Tabellen
es: Tablas
gl: Táboas
id: Tabel
nl: Tabellen
pt: Tabelas
ru: Таблицы
ta: அட்டவணைகள்

# mlClassificationKnn|
source: Plots
de: Diagramme
es: Gráficos
gl: Gráficas
id: Plot
nl: Grafieken
pt: Diagramas
ru: Графики
ta: அடுக்கு

# mlClassificationKnn|
source: Training Parameters
de: Trainingsparameter
es: Parámetros de adiestramiento
gl: Parámetros de ensaio
id: Parameter Pelatihan
nl: Trainingsparameters
pt: Parâmetros de treinamento
ru: Гиперпараметры модели
ta: பயிற்சி அளவுருக்கள்

# mlClassificationKnn|
source: Algorithmic Settings
de: Algorithmus-Einstellungen
es: Configuraciones Algorítmicas
gl: Configuracións Algorítmicas
id: Pengaturan Algoritmik
nl: Algoritme-instellingen
pt: Configurações do algoritmo
ru: Настройки алгоритма
ta: வழிமுறை அமைப்புகள்

# mlClassificationLda|
source: Tables
de: Tabellen
es: Tablas
gl: Táboas
id: Tabel
nl: Tabellen
pt: Tabelas
ru: Таблицы
ta: அட்டவணைகள்

# mlClassificationLda|
source: Coefficients
de: Koeffizienten
es: Coeficientes
gl: Coeficientes
id: Koefisien
nl: Coëfficiënten
pt: Coeficientes
ru: Коэффициенты
ta: குணகங்கள்

# mlClassificationLda|
source: Prior and posterior probabilities
de: Prior- und Posteriorwahrscheinlichkeiten
es: Probabilidades previas y posteriores
gl: Probabilidades previas e posteriores
nl: Prior en posterior kansen
pt: Probabilidades anterior e posterior
ru: Априор. и апостериор. вероятности
ta: முன் மற்றும் பின்புற நிகழ்தகவுகள்

# mlClassificationLda|
source: Class means training data
de: Klassenmittelwerte Trainingsdaten
es: Medias de clase en datos de adiestramiento
gl: Medias de clase nos datos de ensaio
nl: Klasse gemiddeldes trainingsdata
pt: Médias de classe em dados de treinamento
ru: Средние по классам в обучающей выборке
ta: வகுப்பு என்றால் பயிற்சி தரவு

# mlClassificationLda|
source: Assumption Checks
de: Annahmeprüfungen
es: Verificaciones de Supuestos
gl: Comprobacións de Supostos
id: Pemeriksaan Asumsi
nl: Verificatie van aannames
pt: Verificação de Suposições
ru: Проверки допущений
ta: அனுமானம் காசோலைகள்

# mlClassificationLda|
source: Equality of class means
de: Gleichheit der Klassenmittelwerte
es: Igualdad de medias de clases
gl: Igualdade de medias de clase
id: Kesetaraan kelas berarti
nl: Gelijkheid van klassengemiddeldes
pt: Igualdade de médias de classes
ru: Равенство средних по классам
ta: வர்க்கத்தின் ஒரு நிகர் என்றால்

# mlClassificationLda|
source: Equality of covariance matrices
de: Gleichheit der Kovarianzmatrizen
es: Igualdad de matrices de covarianzas
gl: Igualdade de matrices de covarianzas
id: Kesetaraan matriks kovarians
nl: Gelijkheid van covariantiematrices
pt: Igualdade das matrizes de covariância
ru: Равенство ковариационных матриц
ta: கோவாரன்ச் மெட்ரிக்குகளின் ஒரு நிகர்

# mlClassificationLda|
source: Multicollinearity
de: Multikollinearität
es: Multicolinealidad
gl: Multicolinearidade
id: Multikolinearitas
nl: Multicollineariteit
pt: Multicolinearidade
ru: Мультиколлинеарность
ta: மல்டிகோலினரிட்டி

# mlClassificationLda|
source: Plots
de: Diagramme
es: Gráficos
gl: Gráficas
id: Plot
nl: Grafieken
pt: Diagramas
ru: Графики
ta: அடுக்கு

# mlClassificationLda|
source: Linear discriminant matrix
de: Lineare Diskriminanzmatrix
es: Matriz discriminante lineal
gl: Matriz discriminante linear
id: Matriks diskriminan linier
nl: Lineaire discriminantiematrix
pt: Matriz discriminante linear
ru: Матричная диаграмма
ta: நேரியல் பாகுபாடு மேட்ரிக்ச்

# mlClassificationLda|
source: Densities
de: Dichten
es: Densidades
gl: Densidades
id: Kepadatan
nl: Verdelingen
pt: Densidades
ru: Плотности
ta: அடர்த்தி

# mlClassificationLda|
source: Scatter plots
de: Streudiagramm
es: Gráficos de dispersión
gl: Gráficas de dispersión
id: Plot sebar
nl: Spreidingsdiagram
pt: Gráficos de dispersão
ru: Диаграммы рассеяния
ta: சிதறல் அடுக்கு

# mlClassificationLda|
source: Training Parameters
de: Trainingsparameter
es: Parámetros de adiestramiento
gl: Parámetros de ensaio
id: Parameter Pelatihan
nl: Trainingsparameters
pt: Parâmetros de treinamento
ru: Гиперпараметры модели
ta: பயிற்சி அளவுருக்கள்

# mlClassificationLda|
source: Algorithmic Settings
de: Algorithmus-Einstellungen
es: Configuraciones Algorítmicas
gl: Configuracións Algorítmicas
id: Pengaturan Algoritmik
nl: Algoritme-instellingen
pt: Configurações do algoritmo
ru: Настройки алгоритма
ta: வழிமுறை அமைப்புகள்

# mlClassificationRandomForest|
source: Tables
de: Tabellen
es: Tablas
gl: Táboas
id: Tabel
nl: Tabellen
pt: Tabelas
ru: Таблицы
ta: அட்டவணைகள்

# mlClassificationRandomForest|
source: Plots
de: Diagramme
es: Gráficos
gl: Gráficas
id: Plot
nl: Grafieken
pt: Diagramas
ru: Графики
ta: அடுக்கு

# mlClassificationRandomForest|
source: Training Parameters
de: Trainingsparameter
es: Parámetros de adiestramiento
gl: Parámetros de ensaio
id: Parameter Pelatihan
nl: Trainingsparameters
pt: Parâmetros de treinamento
ru: Гиперпараметры модели
ta: பயிற்சி அளவுருக்கள்

# mlClassificationRandomForest|
source: Algorithmic Settings
de: Algorithmus-Einstellungen
es: Configuraciones Algorítmicas
gl: Configuracións Algorítmicas
id: Pengaturan Algoritmik
nl: Algoritme-instellingen
pt: Configurações do algoritmo
ru: Настройки алгоритма
ta: வழிமுறை அமைப்புகள்

# mlClusteringDensityBased|
source: Tables
de: Tabellen
es: Tablas
gl: Táboas
id: Tabel
nl: Tabellen
pt: Tabelas
ru: Таблицы
ta: அட்டவணைகள்

# mlClusteringDensityBased|
source: Plots
de: Diagramme
es: Gráficos
gl: Gráficas
id: Plot
nl: Grafieken
pt: Diagramas
ru: Графики
ta: அடுக்கு

# mlClusteringDensityBased|
source: K-distance plot
de: K-Distanz-Plot
es: Gráfico de distancia K
gl: Gráfica de distancia K
nl: K-afstandsgrafiek
pt: Gráficos de K-distância
ru: График K-расстояний
ta: கே-டிச்டன்ச் சூழ்ச்சி

# mlClusteringDensityBased|
source: Training Parameters
de: Trainingsparameter
es: Parámetros de adiestramiento
gl: Parámetros de ensaio
id: Parameter Pelatihan
nl: Trainingsparameters
pt: Parâmetros de treinamento
ru: Гиперпараметры модели
ta: பயிற்சி அளவுருக்கள்

# mlClusteringDensityBased|
source: Algorithmic Settings
de: Algorithmus-Einstellungen
es: Configuraciones Algorítmicas
gl: Configuracións Algorítmicas
id: Pengaturan Algoritmik
nl: Algoritme-instellingen
pt: Configurações do algoritmo
ru: Настройки алгоритма
ta: வழிமுறை அமைப்புகள்

# mlClusteringDensityBased|
source: Normal
nl: Normaal
ru: Нормальная
ta: சாதாரண

# mlClusteringDensityBased|
source: Correlated
de: Korreliert
es: Correlacionado
gl: Correlacionado
id: Berkorelasi
nl: Gecorreleerd
pt: Correlacionado
ru: Корреляционная
ta: தொடர்புபடுத்தப்பட்ட

# mlClusteringDensityBased|
source: Model Optimization
de: Modelloptimierung
es: Optimización del Modelo
gl: Optimización do modelo
id: Pengoptimalan Model
nl: Modeloptimalisatie
pt: Otimização do Modelo
ru: Оптимизация модели
ta: மாதிரி தேர்வுமுறை

# mlClusteringDensityBased|
source: Fixed
de: Fixiert
es: Fijo
gl: Fixo
id: Tetap
nl: Gefixeerd
pt: Fixo
ru: Фиксированная
ta: சரி

# mlClusteringFuzzyCMeans|
source: Tables
de: Tabellen
es: Tablas
gl: Táboas
id: Tabel
nl: Tabellen
pt: Tabelas
ru: Таблицы
ta: அட்டவணைகள்

# mlClusteringFuzzyCMeans|
source: Plots
de: Diagramme
es: Gráficos
gl: Gráficas
id: Plot
nl: Grafieken
pt: Diagramas
ru: Графики
ta: அடுக்கு

# mlClusteringFuzzyCMeans|
source: Training Parameters
de: Trainingsparameter
es: Parámetros de adiestramiento
gl: Parámetros de ensaio
id: Parameter Pelatihan
nl: Trainingsparameters
pt: Parâmetros de treinamento
ru: Гиперпараметры модели
ta: பயிற்சி அளவுருக்கள்

# mlClusteringFuzzyCMeans|
source: Algorithmic Settings
de: Algorithmus-Einstellungen
es: Configuraciones Algorítmicas
gl: Configuracións Algorítmicas
id: Pengaturan Algoritmik
nl: Algoritme-instellingen
pt: Configurações do algoritmo
ru: Настройки алгоритма
ta: வழிமுறை அமைப்புகள்

# mlClusteringHierarchical|
source: Tables
de: Tabellen
es: Tablas
gl: Táboas
id: Tabel
nl: Tabellen
pt: Tabelas
ru: Таблицы
ta: அட்டவணைகள்

# mlClusteringHierarchical|
source: Plots
de: Diagramme
es: Gráficos
gl: Gráficas
id: Plot
nl: Grafieken
pt: Diagramas
ru: Графики
ta: அடுக்கு

# mlClusteringHierarchical|
source: Dendrogram
de: Dendrogramm
es: Dendrograma
gl: Dendrograma
pt: Dendrograma
ru: Дендрограмма
ta: டென்ட்ரோகிராம்

# mlClusteringHierarchical|
source: Training Parameters
de: Trainingsparameter
es: Parámetros de adiestramiento
gl: Parámetros de ensaio
id: Parameter Pelatihan
nl: Trainingsparameters
pt: Parâmetros de treinamento
ru: Гиперпараметры модели
ta: பயிற்சி அளவுருக்கள்

# mlClusteringHierarchical|
source: Algorithmic Settings
de: Algorithmus-Einstellungen
es: Configuraciones Algorítmicas
gl: Configuracións Algorítmicas
id: Pengaturan Algoritmik
nl: Algoritme-instellingen
pt: Configurações do algoritmo
ru: Настройки алгоритма
ta: வழிமுறை அமைப்புகள்

# mlClusteringHierarchical|
source: Euclidean
de: Euklidisch
es: Euclídea
gl: Euclídea
nl: Euclidisch
pt: Euclidiano
ru: Евклидова
ta: யூக்ளிடியன்

# mlClusteringHierarchical|
source: Average
de: Durchschnitt
es: Promedio
gl: Media
id: Rata-rata
nl: Gemiddeld
pt: Médio
ru: По среднему
ta: சராசரி

# mlClusteringHierarchical|
source: Single
de: Allein
es: Único
gl: Único
id: Tunggal
nl: Alleen
pt: Único
ru: Одиночная
ta: ஒற்றை

# mlClusteringHierarchical|
source: Complete
de: Komplett
es: Completo
gl: Completo
id: Lengkap
nl: Compleet
pt: Completo
ru: Полная
ta: முழுமையானது

# mlClusteringHierarchical|
source: Centroid
de: Zentroid
es: Centroide
gl: Centroide
pt: Centroide
ru: По центрам
ta: சென்ட்ராய்டு

# mlClusteringHierarchical|
source: Median
es: Mediana
gl: Mediana
id: Rata-rata
nl: Mediaan
pt: Mediana
ru: Медианная
ta: இடைநடு

# mlClusteringHierarchical|
source: Ward.D
ru: Уорд.D
ta: வார்டு.டி

# mlClusteringHierarchical|
source: Ward.D2
ru: Уорд.D2
ta: வார்டு டி 2

# mlClusteringHierarchical|
source: McQuitty
ru: МакКвитти
ta: மெக்விட்டி

# mlClusteringKMeans|
source: Tables
de: Tabellen
es: Tablas
gl: Táboas
id: Tabel
nl: Tabellen
pt: Tabelas
ru: Таблицы
ta: அட்டவணைகள்

# mlClusteringKMeans|
source: Plots
de: Diagramme
es: Gráficos
gl: Gráficas
id: Plot
nl: Grafieken
pt: Diagramas
ru: Графики
ta: அடுக்கு

# mlClusteringKMeans|
source: Training Parameters
de: Trainingsparameter
es: Parámetros de adiestramiento
gl: Parámetros de ensaio
id: Parameter Pelatihan
nl: Trainingsparameters
pt: Parâmetros de treinamento
ru: Гиперпараметры модели
ta: பயிற்சி அளவுருக்கள்

# mlClusteringKMeans|
source: Algorithmic Settings
de: Algorithmus-Einstellungen
es: Configuraciones Algorítmicas
gl: Configuracións Algorítmicas
id: Pengaturan Algoritmik
nl: Algoritme-instellingen
pt: Configurações do algoritmo
ru: Настройки алгоритма
ta: வழிமுறை அமைப்புகள்

# mlClusteringRandomForest|
source: Tables
de: Tabellen
es: Tablas
gl: Táboas
id: Tabel
nl: Tabellen
pt: Tabelas
ru: Таблицы
ta: அட்டவணைகள்

# mlClusteringRandomForest|
source: Plots
de: Diagramme
es: Gráficos
gl: Gráficas
id: Plot
nl: Grafieken
pt: Diagramas
ru: Графики
ta: அடுக்கு

# mlClusteringRandomForest|
source: Training Parameters
de: Trainingsparameter
es: Parámetros de adiestramiento
gl: Parámetros de ensaio
id: Parameter Pelatihan
nl: Trainingsparameters
pt: Parâmetros de treinamento
ru: Гиперпараметры модели
ta: பயிற்சி அளவுருக்கள்

# mlClusteringRandomForest|
source: Algorithmic Settings
de: Algorithmus-Einstellungen
es: Configuraciones Algorítmicas
gl: Configuracións Algorítmicas
id: Pengaturan Algoritmik
nl: Algoritme Instellingen
pt: Configurações do algoritmo
ru: Настройки алгоритма
ta: வழிமுறை அமைப்புகள்

# mlRegressionBoosting|
source: Tables
de: Tabellen
es: Tablas
gl: Táboas
id: Tabel
nl: Tabellen
pt: Tabelas
ru: Таблицы
ta: அட்டவணைகள்

# mlRegressionBoosting|
source: Plots
de: Diagramme
es: Gráficos
gl: Gráficas
id: Plot
nl: Grafieken
pt: Diagramas
ru: Графики
ta: அடுக்கு

# mlRegressionBoosting|
source: Training Parameters
de: Trainingsparameter
es: Parámetros de adiestramiento
gl: Parámetros de ensaio
id: Parameter Pelatihan
nl: Trainingsparameters
pt: Parâmetros de treinamento
ru: Гиперпараметры модели
ta: பயிற்சி அளவுருக்கள்

# mlRegressionBoosting|
source: Algorithmic Settings
de: Algorithmus-Einstellungen
es: Configuraciones Algorítmicas
gl: Configuracións Algorítmicas
id: Pengaturan Algoritmik
nl: Algoritme-instellingen
pt: Configurações do algoritmo
ru: Настройки алгоритма
ta: வழிமுறை அமைப்புகள்

# mlRegressionKnn|
source: Tables
de: Tabellen
es: Tablas
gl: Táboas
id: Tabel
nl: Tabellen
pt: Tabelas
ru: Таблицы
ta: அட்டவணைகள்

# mlRegressionKnn|
source: Plots
de: Diagramme
es: Gráficos
gl: Gráficas
id: Plot
nl: Grafieken
pt: Diagramas
ru: Графики
ta: அடுக்கு

# mlRegressionKnn|
source: Training Parameters
de: Trainingsparameter
es: Parámetros de adiestramiento
gl: Parámetros de ensaio
id: Parameter Pelatihan
nl: Trainingsparameters
pt: Parâmetros de treinamento
ru: Гиперпараметры модели
ta: பயிற்சி அளவுருக்கள்

# mlRegressionKnn|
source: Algorithmic Settings
de: Algorithmus-Einstellungen
es: Configuraciones Algorítmicas
gl: Configuracións Algorítmicas
id: Pengaturan Algoritmik
nl: Algoritme-instellingen
pt: Configurações do algoritmo
ru: Настройки алгоритма
ta: வழிமுறை அமைப்புகள்

# mlRegressionRandomForest|
source: Tables
de: Tabellen
es: Tablas
gl: Táboas
id: Tabel
nl: Tabellen
pt: Tabelas
ru: Таблицы
ta: அட்டவணைகள்

# mlRegressionRandomForest|
source: Plots
de: Diagramme
es: Gráficos
gl: Gráficas
id: Plot
nl: Grafieken
pt: Diagramas
ru: Графики
ta: அடுக்கு

# mlRegressionRandomForest|
source: Training Parameters
de: Trainingsparameter
es: Parámetros de adiestramiento
gl: Parámetros de ensaio
id: Parameter Pelatihan
nl: Trainingsparameters
pt: Parâmetros de treinamento
ru: Гиперпараметры модели
ta: பயிற்சி அளவுருக்கள்

# mlRegressionRandomForest|
source: Algorithmic Settings
de: Algorithmus-Einstellungen
es: Configuraciones Algorítmicas
gl: Configuracións Algorítmicas
id: Pengaturan Algoritmik
nl: Algoritme-instellingen
pt: Configurações do algoritmo
ru: Настройки алгоритма
ta: வழிமுறை அமைப்புகள்

# mlRegressionRegularized|
source: Tables
de: Tabellen
es: Tablas
gl: Táboas
id: Tabel
nl: Tabellen
pt: Tabelas
ru: Таблицы
ta: அட்டவணைகள்

# mlRegressionRegularized|
source: Plots
de: Diagramme
es: Gráficos
gl: Gráficas
id: Plot
nl: Grafieken
pt: Diagramas
ru: Графики
ta: அடுக்கு

# mlRegressionRegularized|
source: Variable trace
de: Variablenspur
es: Traza de variables
gl: Traza de variables
id: Jejak variabel
nl: Variabele spoor
pt: Traço de variáveis
ru: Отслеживание переменных
ta: மாறி சுவடு

# mlRegressionRegularized|
source: Legend
de: Legende
es: Leyenda
gl: Lenda
nl: Legenda
pt: Legenda
ta: புராணக்கதை

# mlRegressionRegularized|
source: λ evaluation
es: Evaluación de λ
gl: Avaliación de λ
id: Evaluasi λ
nl: λ evaluatie
pt: Avaliação de λ
ru: Оценка λ
ta: மதிப்பீடு
