Repository: jasp-stats/jaspMachineLearning
Catalog: po/QML-*.po
Languages: de, es, gl, id, nl, pt, ru, ta

# DataSplit|
source: Shows how the data is split into training (and validation), and test set.
de: Zeigt, wie die Daten in Training (und Validierung) und Test-Set aufgeteilt werden.
es: Muestra cómo se dividen los datos entre adiestramiento (y validación) y conjunto de contraste.
gl: Amosa como se dividen os datos entre ensaio (e validación) e conxunto de proba.
id: Menunjukkan bagaimana data dibagi menjadi pelatihan (dan validasi), dan set pengujian.
nl: Toont hoe de data worden gesplitst in de trainings- (en validatie) en testset.
pt: Mostra como os dados são divididos em treinamento (e validação) e conjunto de teste.
ru: Показывает, в какой пропорции данные разбиты на обучающую, валидационную и тестовую выборки.
ta: தரவு எவ்வாறு பயிற்சி (மற்றும் சரிபார்ப்பு) மற்றும் சோதனை தொகுப்பு என பிரிக்கப்படுகிறது என்பதைக் காட்டுகிறது.

# DecisionBoundary|
source: Decision boundary matrix
de: Entscheidungsgrenzenmatrix
es: Matriz límite de decisión
gl: Matriz límite de decisión
id: Matriks batas keputusan
nl: Beslissingsgrensmatrix
pt: Matriz de limites de decisão
ru: Матрица границ решений
ta: முடிவு எல்லை அணி

# DecisionBoundary|
source: Creates a *n* x *n* plot that visualizes how every observation would be classified if predicted through the current model. Boundaries between classes are visualized. Can only be made for numeric features.
de: Erstellt ein *n* x *n*-Diagramm, das visualisiert, wie jede Beobachtung klassifiziert würde, falls sie durch das aktuelle Modell vorhergesagt würde. Grenzen zwischen den Klassen werden visualisiert. Kann nur für numerische Merkmale erstellt werden.
es: Genera un gráfico *n* x *n* que visualiza cómo se clasificaría cada observación si se predice mediante el modelo vigente. Se visualizan los límites entre clases. Solo se puede hacer para características numéricas.
gl: Xera unha gráfica *n* x *n* que visualiza como se clasificaría cada observación cando se predí mediante o modelo vixente. Se visualizan os límites entre clases. Só se pode facer para características numéricas.
id: Membuat plot *n* x *n* yang memvisualisasikan bagaimana setiap pengamatan akan diklasifikasikan jika diprediksi melalui model saat ini. Batas-batas antar kelas divisualisasikan. Hanya dapat dibuat untuk fitur numerik.
nl: Creëert een *n* x *n* figuur welke visualiseert hoe elke observatie geclassificeerd zou worden door het huidige model. De grenzen tussen klassen zijn gevisualiseerd. Kan alleen gemaakt worden voor numerieke kenmerken.
pt: Cria um gráfico *n* x *n* que visualiza como cada observação seria classificada se prevista pelo modelo atual. Os limites entre as classes são visualizados. Só pode ser criado para características numéricas.
ru: Создает диаграмму в виде матрицы размера *n* x *n*, визуализирующую классы, присвоенные текущей моделью отдельным наблюдениям, а также границы между классами. Может быть построена только для количественных признаков.
ta: தற்போதைய மாதிரியின் மூலம் கணிக்கப்பட்டால் ஒவ்வொரு அவதானிப்பும் எவ்வாறு வகைப்படுத்தப்படும் என்பதை காட்சிப்படுத்தும் * n * ஃச் * n * சதித்திட்டத்தை உருவாக்குகிறது. வகுப்புகளுக்கு இடையிலான எல்லைகள் காட்சிப்படுத்தப்படுகின்றன. எண் அம்சங்களுக்கு மட்டுமே உருவாக்க முடியும்.

# DecisionBoundary|
source: Legend
de: Legende
es: Leyenda
gl: Lenda
id: Legenda
nl: Legenda
pt: Legenda
ta: புராணக்கதை

# DecisionBoundary|
source: Show a legend next to the figure.
de: Eine Legende neben der Abbildung anzeigen.
es: Muestra una leyenda próxima al gráfico.
gl: Amosa unha lenda próxima á gráfica.
id: Menampilkan legenda di samping gambar.
nl: Toon een legenda naast het figuur.
pt: Mostra uma legenda próximo à figura.
ta: உருவத்திற்கு அடுத்ததாக ஒரு புராணக்கதையைக் காட்டு.

# DecisionBoundary|
source: Add data points
de: Datenpunkte hinzufügen
es: Añade puntos de los datos
gl: Engade puntos dos datos
id: Menambahkan poin data
nl: Voeg datapunten toe
pt: Adicionar pontos de dados
ru: Добавить наблюдения
ta: தரவு புள்ளிகளைச் சேர்க்கவும்

# DecisionBoundary|
source: Show the observations in the data set as points in the plot.
de: Die Beobachtungen im Datensatz als Punkte im Diagramm anzeigen.
es: Muestra las observaciones del conjunto de datos como puntos en el gráfico.
gl: Amosa as observacións do conxunto de datos como puntos na gráfica.
id: Tampilkan pengamatan dalam kumpulan data sebagai titik-titik dalam plot.
nl: Toon de observaties in de data set als punten in de figuur.
pt: Mostre as observações no conjunto de dados como pontos no gráfico.
ru: Показать наблюдения как точки диаграммы.
ta: சதித்திட்டத்தின் புள்ளிகளாக தரவுத் தொகுப்பில் உள்ள அவதானிப்புகளைக் காட்டுங்கள்.

source: Elbow method
de: Ellenbogenmethode
es: Método del codo
gl: Método do cóbado
id: Metode siku
nl: Elleboogmethode
pt: Método do cotovelo
ru: Метод локтя
ta: முழங்கை முறை

# ElbowMethod|
source: Generates a plot with the total within sum of squares on the y-axis and the number of clusters on the x-axis. This plot can be used for determining the optimal number of clusters. The plot shows three curves using AIC, BIC, and 'elbow method' optimization.
de: Erzeugt ein Diagramm mit der gesamten Zwischen-Quadratsumme auf der y-Achse und der Anzahl der Cluster auf der x-Achse. Dieses Diagramm kann zur Bestimmung der optimalen Anzahl von Clustern verwendet werden. Das Diagramm zeigt drei Kurven mit AIC, BIC und 'Ellenbogenmethoden'-Optimierung.
es: Genera un gráfico con la suma de cuadrados total Dentro en el eje y, más el número de conglomerados en el eje x. Se puede utilizar este gráfico para determinar el número óptimo de conglomerados. El gráfico presenta tres curvas usando AIC, BIC, y la optimización del 'método del codo'.
gl: Xera unha gráfica coa suma de cadrados total Dentro no eixe y, e o número de conglomerados no eixe x. Pódese utilizar esta gráfica para determinar o número óptimo de conglomerados. A gráfica presenta tres curvas usando AIC, BIC, e a optimización do 'método do cóbado'.
id: Menghasilkan plot dengan jumlah total dalam jumlah kuadrat pada sumbu y dan jumlah cluster pada sumbu x. Plot ini dapat digunakan untuk menentukan jumlah cluster yang optimal. Plot ini menunjukkan tiga kurva dengan menggunakan optimasi AIC, BIC, dan 'metode siku'.
nl: Creëert een figuur met de totale kwadratensom op de y-axis en het aantal clusters op de x-axis. Deze figuur kan worden gebruikt voor het bepalen van het optimaal aantal clusters. De figuur toont drie curves met AIC, BIC, en 'elleboog methode' optimalisatie.
pt: Gera um gráfico com o total dentro da soma dos quadrados no eixo y e o número de clusters no eixo x. Este gráfico pode ser usado para determinar o número ideal de clusters. O gráfico mostra três curvas usando AIC, CIB e otimização do "método do cotovelo".
ru: Генерирует диаграмму, в которой по вертикальной оси откладывается обобщенная по всем кластерам внутрикластерная сумма квадратов, а по горизонтальной - количество кластеров. На ней, помимо кривой по "методу плеча", также отображаются кривые, рассчитанные по критериям AIC и BIC.
ta: ஒய்-அச்சில் சதுரங்களின் தொகையிலும், எக்ச்-அச்சில் உள்ள கிளச்டர்களின் எண்ணிக்கையிலும் மொத்தத்துடன் ஒரு சதித்திட்டத்தை உருவாக்குகிறது. கொத்துக்களின் உகந்த எண்ணிக்கையை தீர்மானிக்க இந்த சூழ்ச்சி பயன்படுத்தப்படலாம். சூழ்ச்சி AIC, BIC மற்றும் 'முழங்கை முறை' தேர்வுமுறை ஆகியவற்றைப் பயன்படுத்தி மூன்று வளைவுகளைக் காட்டுகிறது.

source: Predictive performance
de: Vorhersageleistung
es: Capacidad predictiva
gl: Capacidade preditiva
id: Kinerja prediktif
nl: Voorspellend vermogen
pt: Desempenho preditivo
ru: Качество предсказаний
ta: முன்கணிப்பு செயல்திறன்

# PredictivePerformance|
source: Plots the true values of the observations in the test set against their predicted values.
de: Zeigt die wahren Werte der Beobachtungen im Testdatensatz gegen ihre vorhergesagten Werte.
es: Representa los valores verdaderos de las observaciones en el conjunto de contraste, frente a sus valores predichos.
gl: Representa os valores verdadeiros das observacións no conxunto de proba, fronte aos seus valores preditos.
id: Memplot nilai sebenarnya dari pengamatan dalam set pengujian terhadap nilai prediksinya.
nl: Creëert een figuur met de werkelijke waarden van de observaties in de test set tegenover hun voorspelde waarden.
pt: Traça os valores reais das observações no conjunto de teste em relação aos seus valores previstos.
ru: Рисует точечную диаграмму с предсказанными значениями наблюдений напротив их действительных значений.
ta: அவற்றின் கணிக்கப்பட்ட மதிப்புகளுக்கு எதிராக அமைக்கப்பட்ட சோதனையில் அவதானிப்புகளின் உண்மையான மதிப்புகள் உள்ளன.

# RocCurve|
source: ROC curves
de: ROC-Kurven
es: Curvas ROC
gl: Curvas ROC
id: Kurva ROC
nl: ROC krommen
pt: Curvas ROC
ru: ROC кривые
ta: ROC வளைவுகள்

# RocCurve|
source: Displays ROC curves for each class predicted against all other classes.
de: Zeigt ROC-Kurven für jede Klasse, die gegen alle anderen Klassen vorhergesagt werden.
es: Muestra las curvas ROC para cada clase predicha, frente a todas las otras clases.
gl: Amosa as curvas ROC para cada clase predita, fronte a tódalas outras clases.
id: Menampilkan kurva ROC untuk setiap kelas yang diprediksi terhadap semua kelas lainnya.
nl: Creëert een figuur met ROC krommen voor elke klas voorspeld tegen alle andere klassen.
pt: Exibe curvas ROC para cada classe prevista em relação a todas as outras classes.
ru: Отображает ROC кривые для каждого предсказанного класса напротив всех других классов.
ta: மற்ற எல்லா வகுப்புகளுக்கும் எதிராக கணிக்கப்பட்ட ஒவ்வொரு வகுப்பிற்கும் ROC வளைவுகளைக் காட்டுகிறது.

# Tsne|
source: t-SNE cluster plot
de: t-SNE Cluster-Diagramm
es: Gráfico de Conglomerados t-SNE
gl: Gráfica de Conglomerados t-SNE
nl: t-SNE cluster figuur
pt: Gráfico de agrupamento t-SNE
ru: t-SNE-диаграмма кластеров
ta: டி-எச்.என்.இ கிளச்டர் சூழ்ச்சி

# Tsne|
source: Generates a t-SNE plot of the clustering output. t-SNE plots are used for visualizing high-dimensional data in a low-dimensional space of two dimensions aiming to illustrate the relative distances between data observations. The t-SNE two-dimensional space makes the axes uninterpretable. A t-SNE plot seeks to give an impression of the relative distances between observations and clusters. To recreate the same t-SNE plot across several clustering analyses you can set their seed to the same value, as the t-SNE algorithm uses random starting values.
de: Erzeugt ein t-SNE-Diagramm der Cluster-Ausgabe. t-SNE-Diagramme werden zur Visualisierung hochdimensionaler Daten in einem niedrigdimensionalen Raum mit zwei Dimensionen verwendet, um die relativen Abstände zwischen Datenbeobachtungen zu illustrieren. Der t-SNE zweidimensionale Raum macht die Achsen uninterpreierbar. Ein t-SNE-Diagramm versucht, einen Eindruck der relativen Abstände zwischen Beobachtungen und Clustern zu vermitteln. Um dasselbe t-SNE-Diagramm in wiederholten Cluster-Analysen zu erstellen, können Sie den Startwert für Zufallszahlen auf denselben Wert einstellen, da der t-SNE-Algorithmus zufällige Startwerte verwendet.
es: Genera un gráfico t-SNE de la salida de la conglomeración. Los gráficos t-SNE se utilizan para visualizar datos de alta dimensión en un espacio de baja dimensión con dos dimensiones dirigidas a ilustrar las distancias relativas entre observaciones de los datos. El espacio t-SNE de dos dimensiones vuelve los ejes no interpretables. Un gráfico t-SNE intenta dar una impresión de las distancias relativas entre observaciones y conglomerados. Para recrear el mismo gráfico t-SNE a través de diversos análisis de conglomeración, se puede establecer que a su semilla tenga el mismo valor, pues el algoritmo t-SNE usa valores iniciales aleatorios.
gl: Xera unha gráfica t-SNE da saída da conglomeración. As gráficas t-SNE utilízanse para visualizar datos de alta dimensión nun espazo de baixa dimensión con dúas dimensións dirixidas a ilustrar as distancias relativas entre observacións dos datos. O espazo t-SNE de dúas dimensións fai os eixes non interpretables. Unha gráfica t-SNE intenta dar unha impresión das distancias relativas entre observacións e conglomerados. Para recrear a mesma gráfica t-SNE ao longo de diversas análises de conglomeración, podes establecer que a súa semente teña o mesmo valor, pois o algoritmo t-SNE usa valores iniciais aleatorios.
nl: Genereert een t-SNE figuur van de cluster output. t-SNE figuren worden gebruikt voor visualiseren van hoog-dimensionale gegevens in een lage-dimensionale ruimte van twee dimensies die zich richten op de relatieve afstanden tussen data observaties. De t-SNE tweedimensionale ruimte maakt de assen on-interpreteerbaar. Een t-SNE figuur geeft een indruk van de relatieve afstanden tussen observaties en clusters. Om dezelfde t-SNE figuur te reproduceren tussen verschillende analyses kun je de startwaarde gelijkzetten, omdat het t-SNE algoritme gebruik maakt van willekeurige startwaarden.
pt: Gera um gráfico t-SNE da saída do agrupamento. Os gráficos t-SNE são usados para visualizar dados de alta dimensão em um espaço bidimensional de baixa dimensão, com o objetivo de ilustrar as distâncias relativas entre as observações dos dados. O espaço bidimensional t-SNE torna os eixos ininterpretáveis. Um gráfico t-SNE busca dar uma ideia das distâncias relativas entre observações e agrupamentos. Para recriar o mesmo gráfico t-SNE em várias análises de agrupamento, você pode definir a semente para o mesmo valor, já que o algoritmo t-SNE usa valores iniciais aleatórios.
ru: Создает t-SNE-диаграмму результатов кластеризации. t-SNE-диаграммы используются для визуализации многомерных данных в проекции на двумерное пространство, что позволяет оценить относительные расстояния между наблюдениями. Однако, из-за этой особенности t-SNE-диаграммы невозможно привести интерпретацию ее осей. Она дает лишь представление об относительных расстояниях между наблюдениями в каждом из кластеров, а также между кластерами. Так как алгоритм использует случайные начальные значения, для того, чтобы воссоздать ту же самую t-SNE-диаграмму при повторной кластеризации, Вам потребуется установить затравку генератора случайных чисел на то же значение, какое было и в прошлый раз.
ta: கிளச்டரிங் வெளியீட்டின் டி-எச்.என்.இ சதித்திட்டத்தை உருவாக்குகிறது. தரவு அவதானிப்புகளுக்கு இடையிலான ஒப்பீட்டு தூரத்தை விளக்கும் நோக்கில் இரண்டு பரிமாணங்களின் குறைந்த பரிமாண இடத்தில் உயர் பரிமாண தரவைக் காட்சிப்படுத்த டி-எச்.என்.இ அடுக்கு பயன்படுத்தப்படுகிறது. T-SNE இரு பரிமாண இடம் அச்சுகளை விளக்க முடியாததாக ஆக்குகிறது. ஒரு டி-எச்.என்.இ சூழ்ச்சி அவதானிப்புகள் மற்றும் கொத்துக்களுக்கு இடையிலான ஒப்பீட்டு தூரங்களை ஒரு தோற்றத்தை அளிக்க முயல்கிறது. பல கிளச்டரிங் பகுப்பாய்வுகளில் அதே டி-எச்.என்.இ சதித்திட்டத்தை மீண்டும் உருவாக்க நீங்கள் அவற்றின் விதைகளை ஒரே மதிப்புக்கு அமைக்கலாம், ஏனெனில் டி-எச்.என்.இ அல்காரிதம் சீரற்ற தொடக்க மதிப்புகளைப் பயன்படுத்துகிறது.

# Tsne|
source: Legend
de: Legende
es: Leyenda
gl: Lenda
id: Legenda
nl: Legenda
pt: Legenda
ru: Легенда
ta: புராணக்கதை

# Tsne|
source: Show a legend next to the figure.
de: Eine Legende neben der Abbildung anzeigen.
es: Muestra una leyenda próxima al gráfico.
gl: Amosa unha lenda próxima á gráfica.
id: Menampilkan legenda di samping gambar.
nl: Toon een legenda naast de figuur.
pt: Mostra uma legenda próximo à figura.
ru: Показывает легенду рядом с диаграммой.
ta: உருவத்திற்கு அடுத்ததாக ஒரு புராணக்கதையைக் காட்டு.

# Tsne|
source: Add data labels
de: Daten-Beschriftungen hinzufügen
es: Añade etiquetas de los datos
gl: Añade etiquetas de los datos
id: Menambahkan label data
nl: Voeg gegevenslabels toe
pt: Adicionar rótulos de dados
ru: Добавить метки данных
ta: தரவு லேபிள்களைச் சேர்க்கவும்

# Tsne|
source: Add the row numbers of the observations in the data set as labels to the plot.
de: Die Zeilennummern der Beobachtungen im Datensatz als Beschriftungen ins Diagramm hinzufügen.
es: Añadir los números de fila de las observaciones del conjunto de datos, como etiquetas en el gráfico.
gl: Engadir os números de fila das observacións do conxunto de datos, como etiquetas na gráfica.
id: Tambahkan nomor baris pengamatan dalam kumpulan data sebagai label pada plot.
nl: Voeg de rijnummers toe van de observaties in de data set als labels aan de figuur.
pt: Adicione os números das linhas das observações no conjunto de dados como rótulos ao gráfico.
ru: Добавляет на диаграмму в качестве меток наблюдений соответствующие им номера строк в таблице данных.
ta: தரவுத் தொகுப்பில் உள்ள அவதானிப்புகளின் வரிசை எண்களை சதித்திட்டத்திற்கு லேபிள்களாகச் சேர்க்கவும்.

source: Class proportions
de: Klassen-Anteile
es: Proporciones de clase
gl: Proporcións de clase
id: Proporsi kelas
nl: Klasse verhoudingen
pt: Proporções de categoria
ru: Пропорции классов
ta: வர்க்க விகிதங்கள்

# ClassProportions|
source: Displays a table that shows the proportions of each class in the data set, training (and validaton), and test set.
de: Zeigt eine Tabelle an, die die Anteile jeder Klasse im Datensatz, Trainings- (und Validierungs-) und Testsatz zeigt.
es: Presenta una tabla que muestra las proporciones de cada clase en el conjunto de datos, adiestramiento (y validación), y conjunto de tests.
gl: Presenta unha táboa que amosa as proporcións de cada clase no conxunto de datos, ensaio (e validación), e conxunto de probas.
id: Menampilkan tabel yang menunjukkan proporsi setiap kelas dalam kumpulan data, pelatihan (dan validasi), dan kumpulan tes.
nl: Laat een tafel zien die de proporties van elke klasse laat zien in de data set, training (en validatie) en test set.
pt: Exibe uma tabela que mostra as proporções de cada classe no conjunto de dados, treinamento (e validação) e conjunto de teste.
ru: Отображает таблицу, показывающую пропорции всех классов в наборе данных, обучающей, валидационной и тестовой выборках.
ta: தரவு தொகுப்பு, பயிற்சி (மற்றும் வாலிடடன்) மற்றும் சோதனை தொகுப்பில் ஒவ்வொரு வகுப்பின் விகிதாச்சாரத்தையும் காட்டும் அட்டவணையைக் காட்டுகிறது.

# ClusterInfo|
source: Cluster information
es: Información de los conglomerados
gl: Información dos conglomerados
id: Informasi klaster
nl: Cluster informatie
pt: Informação do agrupamento
ru: Сведения о кластерах
ta: கொத்து செய்தி

# ClusterInfo|
source: Displays the size of each cluster and the explained proportion of within-cluster heterogeneity. The latter is the cluster within sum of squares divided by its total over the various clusters. These outputs are shown by default.
de: Zeigt die Größe jedes Clusters und den erklärenden Anteil der Cluster-internen Heterogenität. Letzteres ist die Cluster-interne Quadratsumme geteilt durch seine Gesamtsumme über die verschiedenen Cluster. Diese Ausgaben werden standardmäßig angezeigt.
es: Muestra el tamaño de cada conglomerado y la proporción explicada de la heterogeneidad de los conglomerados Dentro. Esta última es la suma de cuadrados Dentro del conglomerado dividida por la total a lo largo de varios conglomerados. Estas salidas se muestran por defecto.
gl: Amosa o tamaño de cada conglomerado e a proporción explicada da heteroxeneidade dos conglomerados Dentro. A derradeira é a suma de cadrados Dentro do conglomerado dividida polo total ao longo de varios conglomerados. Estas saídas amósanse por defecto.
id: Menampilkan ukuran setiap klaster dan proporsi yang dijelaskan dari heterogenitas dalam klaster. Yang terakhir ini adalah jumlah kuadrat dalam klaster dibagi dengan jumlah total dari berbagai klaster. Output ini ditampilkan secara default.
nl: Toont de grootte van elk cluster en het verklaarde aandeel van de heterogeniteit binnen clusters. Dit laatste is de som van de kwadraten binnen een cluster gedeeld door het totaal over de verschillende clusters. Deze uitvoer wordt standaard weergegeven.
pt: Exibe o tamanho de cada agrupamento e a proporção explicada da heterogeneidade dentro do agrupamento. Esta última é a soma dos quadrados do agrupamento dividida pelo seu total nos vários agrupamentos. Essas saídas são exibidas por padrão.
ru: Отображает размер каждого кластера и описываемую им долю внутрикластерной гетерогенности от таковой для всей модели. Эта доля выражается как внутрикластерная сумма квадратов для одного кластера, деленная на такую сумму по всем кластерам. Данная опция выбрана по умолчанию.
ta: ஒவ்வொரு கிளச்டரின் அளவையும், க்ளச்டர் பன்முகத்தன்மையின் விளக்கப்பட்ட விகிதத்தையும் காட்டுகிறது. பிந்தையது சதுரங்களின் தொகைக்குள் பல்வேறு கொத்துக்களில் அதன் மொத்தத்தால் வகுக்கப்படுகிறது. இந்த வெளியீடுகள் இயல்பாக காட்டப்படுகின்றன.

# ClusterInfo|
source: Within sum of squares
de: Innere Quadratsumme
es: Suma de cuadrados Dentro
gl: Suma de cadrados Dentro
id: Dalam jumlah kuadrat
nl: Binnen kwadratensom
pt: Soma dos quadrados de dentro
ru: Внутрикластерные суммы квадратов
ta: சதுரங்களின் தொகைக்குள்

# ClusterInfo|
source: Adds a row with the within sum of squares of each cluster to the table. This option is selected by default.
de: Fügt eine Zeile mit der Binnen-Quadratsumme jedes Clusters zur Tabelle hinzu. Diese Option wird standardmäßig ausgewählt.
es: Añade una fila a la tabla, con la suma de cuadrados Dentro de cada conglomerado. Esta opción está seleccionada por defecto.
gl: Engade unha fila á táboa, coa suma de cadrados Dentro de cada conglomerado. Esta opción está seleccionada por defecto.
id: Menambahkan baris dengan jumlah kuadrat dalam setiap klaster ke tabel. Opsi ini dipilih secara default.
nl: Voegt een rij met de binnen kwadratensom van elke cluster aan de tabel toe. Deze optie is standaard aangevinkt.
pt: Adiciona uma linha com a soma interna dos quadrados de cada agrupamento à tabela. Esta opção é selecionada por padrão.
ru: Добавляет в таблицу строку с внутрикластерной суммой квадратов расстояний до центра для каждого из кластеров. Данная опция выбрана по умолчанию.
ta: ஒவ்வொரு கிளச்டரின் சதுரங்களின் தொகையுடன் ஒரு வரிசையை அட்டவணையில் சேர்க்கிறது. இந்த விருப்பம் இயல்பாகவே தேர்ந்தெடுக்கப்படுகிறது.

# ClusterInfo|
source: Silhouette score
es: Puntuación de siluetas
gl: Puntuación de siluetas
id: Skor siluet
pt: Pontuação da silhueta
ru: Оценки силуэта
ta: நிழல் மதிப்பெண்

# ClusterInfo|
source: Adds a row with the silhouette score of each cluster to the table.
de: Fügt eine Zeile mit dem Silhouette-Score jedes Clusters zur Tabelle hinzu.
es: Añade una fila a la tabla, con la puntuación de siluetas de cada conglomerado.
gl: Engade unha fila á táboa, coa puntuación de siluetas de cada conglomerado.
id: Menambahkan baris dengan skor siluet setiap klaster ke tabel.
nl: Voegt een rij met de silhouette score van elke cluster toe aan de tabel.
pt: Adiciona uma linha com a pontuação de silhueta de cada agrupamento à tabela.
ru: Добавляет в таблицу строку с оценкой силуэта для каждого из кластеров.
ta: ஒவ்வொரு கிளச்டரின் நிழல் மதிப்பெண்ணுடன் ஒரு வரிசையை அட்டவணையில் சேர்க்கிறது.

# ClusterInfo|
source: Centers
es: Centros
gl: Centros
id: Pusat
nl: Centrums
pt: Centros
ru: Координаты центров
ta: மையங்கள்
