Repository: jasp-stats/jaspMachineLearning
Catalog: po/R-*.po
Languages: es, gl, pt, ta

source: Both p-values of the skewness and kurtosis statistics should be > 0.05 to conclude multivariate normality.
es: Los dos valores p de los estadísticos de asimetría y curtosis deben ser > 0.05 para cocluir la Normalidad Multivariante.
gl: Os dous valores p dos estatísticos de asimetría e curtose deben ser > 0.05 para cocluír a Normalidade Multivariante.
pt: Ambos os valores-p das estatísticas de assimetria e curtose devem ser > 0,05 para concluir a normalidade multivariada.
ta: வளைவு மற்றும் கர்டோசிச் புள்ளிவிவரங்களின் பி-மதிப்புகள் இரண்டும் பன்முக இயல்புநிலையை முடிக்க> 0.05 ஆக இருக்க வேண்டும்.

source: Regression Coefficients
es: Coeficientes de Regresión
gl: Coeficientes da Regresión
pt: Coeficientes de Regressão
ta: பின்னடைவு குணகங்கள்

source: Coefficient (%s)
es: Coeficiente (%s)
gl: Coeficiente (%s)
pt: Coeficiente (%s)
ta: குணகம் (%s)

source: Standard Error
es: Error Típico
gl: Erro Padrón
pt: Erro Padrão
ta: நிலையான பிழை

source: z
ta: சட்

source: %1$s%% Confidence interval
es: Intervalo con %1$s%% de Confianza
gl: Intervalo co %1$s%% de Confianza
pt: Intervalo de confiança %1$s%%
ta: %1$s %% நம்பிக்கை இடைவெளி

source: The regression coefficients for numeric features are standardized.
es: Los coeficientes de regresión para características numéricas están tipificados.
gl: Os coeficientes de regresión para características numéricas están tipificados.
pt: Os coeficientes de regressão para características numéricas são padronizados.
ta: எண் அம்சங்களுக்கான பின்னடைவு குணகங்கள் தரப்படுத்தப்பட்டுள்ளன.

source: The regression coefficients are unstandardized.
es: Los coeficientes de regresión están sin tipificar.
gl: Os coeficientes de regresión están sen tipificar.
pt: Os coeficientes de regressão não estão padronizados.
ta: பின்னடைவு குணகங்கள் நிலையற்றவை.

source: <b>Regression equation:</b> %1$s
es: <b>Ecuación de regresión:</b> %1$s
gl: <b>Ecuación de regresión:</b> %1$s
pt: <b>Equação de regressão:</b> %1$s
ta: <b> பின்னடைவு சமன்பாடு: </b> %1$s

source: Posterior Statistics
gl: Estatísticos posteriores
pt: Estatística a posteriori
ta: பின்புற புள்ளிவிவரங்கள்

source: Feature: %1$s
gl: Característica: %1$s
pt: Característica: %1$s
ta: அம்சம்: %1$s

source: Std. deviation
gl: Desvío padrón
pt: Desvio pad.
ta: Std. விலகல்

source: The table displays the mean and standard deviation of the feature given the target class.
gl: A táboa presenta a media e o desvío padrón da característica dada a clase obxectivo.
pt: A tabela exibe a média e o desvio padrão da característica, dada a classe alvo.
ta: இலக்கு வகுப்பிற்கு வழங்கப்பட்ட அம்சத்தின் சராசரி மற்றும் நிலையான விலகலை அட்டவணை காட்டுகிறது.

source: The table displays the conditional probabilities given the target class.
gl: A táboa presenta as probabilidades condicionadas dada a clase obxectivo.
pt: A tabela exibe as probabilidades condicionais dada a classe alvo.
ta: இலக்கு வகுப்பிற்கு வழங்கப்பட்ட நிபந்தனை நிகழ்தகவுகளை அட்டவணை காட்டுகிறது.

source: Analysis not possible: The algorithm did not converge within the maximum number of training repetitions (%1$s).
es: El análisis no es posible: El algoritmo no converge dado el número máximo de repeticiones de adiestramiento (%1$s).
gl: A análise non é posible: O algoritmo non converxe dado o número máximo de repeticións de ensaio (%1$s).
pt: Análise não possível: O algoritmo não convergiu dentro do número máximo de repetições de treinamento (%1$s).
ta: பகுப்பாய்வு சாத்தியமில்லை: வழிமுறை அதிகபட்ச பயிற்சி மறுபடியும் (%1$s) க்குள் ஒன்றிணைக்கப்படவில்லை.

source: Optimizing network topology
es: Optimizando la topología de la red
gl: Optimizando a topoloxía da rede
pt: Otimizando a topologia da rede
ta: பிணையம் டோபாலசியை மேம்படுத்துதல்

source: K-Distance Plot
es: Gráfico de Distancias K
gl: Gráfica de Distancias K
pt: Gráfico de K-Distâncias
ta: கே-டிச்டன்ச் சூழ்ச்சி

source: Points Sorted by Distance
es: Puntos Ordenados según la Distancia
gl: Puntos Ordenados segundo a Distancia
pt: Pontos Classificados pela Distância
ta: புள்ளிகள் தூரத்தால் வரிசைப்படுத்தப்படுகின்றன

source: %s-Nearest Neighbors Distance
es: Distancia de los %s Vecinos Más Próximos
gl: Distancia dos %s Veciños Máis Próximos
pt: %s vizinhos mais próximos Distância
ta: %s-NEREST அயலவர்கள் தூரம்

source: Maximum curvature = %s
es: Curvatura máxima = %s
gl: Curvatura máxima = %s
pt: Curvatura máxima = %s
ta: அதிகபட்ச வளைவு = %s

source: End of recursion reached without converging
es: Se llegó al final de la recursividad sin converger
gl: Acadouse o final da recursividade sen converxer
pt: Fim da recursão alcançado sem convergir
ta: மறுநிகழ்வின் முடிவு ஒன்றிணைக்காமல் அடைந்தது

source: x and y must be numeric and finite. Missing values not allowed.
es: x e y deben ser numéricos y finitos. No se admiten valores ausentes.
gl: x e y deben ser numéricos e finitos. Non se admiten valores ausentes.
pt: x e y devem ser numéricos e finitos. Valores ausentes não são permitidos.
ta: ஃச் மற்றும் ஒய் எண் மற்றும் வரையறுக்கப்பட்டதாக இருக்க வேண்டும். காணாமல் போன மதிப்புகள் அனுமதிக்கப்படவில்லை.

source: x and y must be of equal length.
es: x e y deben tener la misma longitud.
gl: x e y deben ter a mesma longura.
pt: x e y devem ter o mesmo comprimento.
ta: ஃச் மற்றும் ஒய் சம நீளமாக இருக்க வேண்டும்.

source: Need more points to find cutoff.
es: Se necesitan más puntos para encontrar el punto de corte.
gl: Precísanse máis puntos para atopar o punto de corte.
pt: Precisa-se de mais pontos para encontrar o valor de corte.
ta: வெட்டு கண்டுபிடிக்க கூடுதல் புள்ளிகள் தேவை.

source: Need to specify fraction of maximum slope.
es: Se necesita indicar la fracción de la pendiente máxima.
gl: Precisas indicar a fracción da pendente máxima.
pt: É necessário especificar a fração da inclinação máxima.
ta: அதிகபட்ச சாய்வின் பகுதியைக் குறிப்பிட வேண்டும்.

source: Fraction of maximum slope must be positive and be less than or equal to 1.
es: La fracción de la pendiente máxima debe ser positiva, y menor o igual que 1.
gl: A fracción da pendente máxima debe ser positiva, e menor ou igual que 1.
pt: A fração da inclinação máxima deve ser positiva e menor ou igual a 1.
ta: அதிகபட்ச சாய்வின் பின்னம் நேர்மறையாக இருக்க வேண்டும் மற்றும் 1 ஐ விட குறைவாகவோ அல்லது சமமாகவோ இருக்க வேண்டும்.

source: Method must be either 'first' or 'curvature'.
es: El método debe ser 'primero' o 'curvatura'.
gl: O método debe ser 'primeiro' ou 'curvatura'.
pt: O método deve ser 'primeiro' ou 'curvatura'.
ta: முறை 'முதல்' அல்லது 'வளைவு' ஆக இருக்க வேண்டும்.

source: Cutoff point is beyond range. Returning NA.
es: El punto de corte está más allá del rango. Se devuelve NA.
gl: O punto de corte está alén do rango. Devólvese NA.
pt: O valor de corte está além da faixa. Retornando NA.
ta: வெட்டு புள்ளி வரம்பிற்கு அப்பாற்பட்டது. திரும்பும் நா.

source: Dendrogram
es: Dendrograma
gl: Dendrograma
pt: Dendrograma
ta: டென்ட்ரோகிராம்

source: The %1$s-component %2$s model could not be fitted, try a different model or a different number of clusters.
gl: O modelo %2$s de compoñentes %1$s non se pode axustar; proba un modelo distinto ou un número diferente de conglomerados.
pt: O modelo %1$s-componente %2$s não pôde ser ajustado, tente um modelo diferente ou um número diferente de agrupamentos.
ta: %1$s- கூறு %2$s மாதிரியை பொருத்த முடியவில்லை, வேறு மாதிரி அல்லது வேறு எண்ணிக்கையிலான கொத்துக்களை முயற்சிக்கவும்.

source: Estimated Model Parameters
gl: Parámetros do modelo estimado
pt: Parâmetros do Modelo Estimado
ta: மதிப்பிடப்பட்ட மாதிரி அளவுருக்கள்

source: Mixing Probabilities
gl: Probabilidades mesturadas
pt: Misturando Probabilidades
ta: கலப்பு நிகழ்தகவுகள்

source: Mixing probability
gl: Probabilidade mesturada
pt: Probabilidade de mistura
ta: கலப்பு நிகழ்தகவு

source: Component %1$s
gl: Compoñente %1$s
pt: Componente %1$s
ta: கூறு %1$s

source: Means
gl: Medias
pt: Médias
ta: அர்த்தங்கள்

source: Covariance Matrix for Component %1$s
gl: Matriz de covarianzas por Compoñente %1$s
pt: Matriz de Covariância para o Componente %1$s
ta: கூறு %1$s க்கான கோவாரன்ச் மேட்ரிக்ச்

source: Scale of the Covariance
gl: Escala da covarianza
pt: Escala da Covariância
ta: கோவாரன்ச் அளவு

source: Scale
gl: Escala
pt: Escala
ta: அளவு

source: Shape of the Covariance Matrix
gl: Forma da matriz de covarianzas
pt: Forma da Matriz de Covariância
ta: கோவாரன்ச் மேட்ரிக்சின் வடிவம்

source: Eigenvalues of the Covariance Matrix for Component %1$s
gl: Autovalores da matriz de covarianzas para a compoñente %1$s
pt: Autovalores da Matriz de Covariância para o Componente %1$s
ta: கூறு %1$s க்கான கோவாரன்ச் மேட்ரிக்சின் ஈசென்வெல்யூச்

source: Feature Importance
es: Importancia de la característica
gl: Importancia da característica
pt: Importância da Característica
ta: அம்ச முக்கியத்துவம்

source: Mean decrease in Gini Index
es: Decrecimiento de la media en el Índice de Gini
gl: Decrecemento da media no Índice de Gini
pt: Decréscimo médio no Índice de Gini
ta: கினி குறியீட்டில் சராசரி குறைவு

source: K-nearest neighbors
es: K vecinos más próximos
gl: K veciños máis próximos
pt: K-ésimo vizinhos mais próximos
ta: கே-அருகிலுள்ள அயலவர்கள்

source: Linear discriminant
es: Discriminante lineal
gl: Discriminante linear
pt: Discriminante linear
ta: நேரியல் பாகுபாடு

source: Linear
es: Lineal
ta: நேரியல்

source: Boosting
es: Potenciación
gl: Potenciación
ta: அதிகரிக்கும்

source: Random forest
es: Bosque aleatorio
gl: Bosque aleatorio
pt: Floresta aleatória
ta: சீரற்ற காடு

source: Regularized linear regression
es: Regresión lineal regularizada
gl: Regresión linear regularizada
pt: Regressão linear regularizada
ta: நேரியல் பின்னடைவை முறைப்படுத்தியது

source: Neural network
es: Red neuronal
gl: Rede neuronal
pt: Rede neural
ta: நரம்பியல் பிணையம்

source: Decision tree
es: Árbol de decisión
gl: Árbore de decisión
pt: Árvore de Decisão
ta: முடிவு மரம்

source: Support vector machine
es: Máquina de vectores de soporte
gl: Máquina de vectores de soporte
pt: Máquina de vetores de suporte
ta: திசையன் இயந்திரத்தை ஆதரிக்கவும்

source: Naive Bayes
gl: Bayes Inxenuo
pt: Bayes Ingênuo
ta: அப்பாவியாக பேயச்

source: Logistic regression
gl: Regresión loxística
pt: Regressão logística
ta: லாசிச்டிக் பின்னடைவு

source: Multinomial regression
gl: Regresión Multinomial
pt: Regressão multinomial
ta: பன்முக பின்னடைவு

source: Error: The trained model is not created in JASP.
es: Fallo: El modelo ensayado no se creó en JASP.
gl: Fallo: O modelo ensaiado non se creou en JASP.
pt: Erro: O modelo treinado não foi criado no JASP.
ta: பிழை: பயிற்சி பெற்ற மாதிரி JASP இல் உருவாக்கப்படவில்லை.

source: The trained model (type: %1$s) is currently not supported in JASP.
es: Actualmente no se admite el modelo ensayado (tipo: %1$s) en JASP.
gl: Actualmente non se admite o modelo ensaiado (tipo: %1$s) en JASP.
pt: O modelo treinado (tipo: %1$s) não é suportado atualmente no JASP.
ta: பயிற்சி பெற்ற மாதிரி (வகை: %1$s) தற்போது JASP இல் ஆதரிக்கப்படவில்லை.

source: Error: The trained model is created using a different version of JASP.
es: Fallo: El modelo ensayado se creó utilizando una versión distinta de JASP.
gl: Fallo: O modelo ensaiado creouse utilizando unha versión distinta de JASP.
pt: Erro: O modelo treinado foi criado usando uma versão diferente do JASP.
ta: பிழை: JASP இன் வேறுபட்ட பதிப்பைப் பயன்படுத்தி பயிற்சி பெற்ற மாதிரி உருவாக்கப்படுகிறது.

source: Loaded Model
es: Modelo Cargado
gl: Modelo Cargado
pt: Modelo Carregado
ta: ஏற்றப்பட்ட மாதிரி

source: Classification
es: Clasificación
gl: Clasificación
pt: Classificação
ta: வகைப்பாடு

source: Regression
es: Regresión
gl: Regresión
pt: Regressão
ta: பின்னடைவு

source: Loaded Model: %1$s
es: Modelo Cargado: %1$s
gl: Modelo Cargado: %1$s
pt: Modelo Carregado: %1$s
ta: ஏற்றப்பட்ட மாதிரி: %1$s

source: The trained model is not applied because the the following features are missing: <i>%1$s</i>.
es: El modelo ensayado no se aplica porque faltan las siguientes características: <i>%1$s</i>.
gl: O modelo ensaiado non se aplica porque faltan as seguintes características: <i>%1$s</i>.
pt: O modelo treinado não é aplicado porque as seguintes características estão faltando: <i>%1$s</i>.
ta: பின்வரும் நற்பொருத்தங்கள் காணவில்லை என்பதால் பயிற்சி பெற்ற மாதிரி பயன்படுத்தப்படவில்லை: <i>%1$s </i>.

source: The following features are unused because they are not a feature variable in the trained model: <i>%1$s</i>.
es: No se usan las siguientes características porque no son variables características en el modelo ensayado: <i>%1$s</i>.
gl: Non se usan as seguintes características porque non son variables características no modelo ensaiado: <i>%1$s</i>.
pt: As seguintes características não são utilizadas porque não são uma variável de característica no modelo treinado: <i>%1$s</i>.
ta: பின்வரும் நற்பொருத்தங்கள் பயன்படுத்தப்படாது, ஏனெனில் அவை பயிற்சி பெற்ற மாதிரியில் அம்ச மாறுபாடு அல்ல: <i>%1$s </i>.

source: Nearest Neighbors
es: Vecinos Más Próximos
gl: Veciños Máis Próximos
pt: Vizinhos mais Próximos
ta: அருகிலுள்ள அயலவர்கள்

source: n(New)
es: n(Nuevo)
gl: n(Novo)
pt: n(Novo)
ta: n (புதியது)

source: Binomial
ta: ஈருறுப்பு

source: Multinomial
ta: பல்லுறுப்பு

source: Logit
ta: உள்நுழைவு

source: Predictions for New Data
es: Predicciones para los Datos Nuevos
gl: Predicións para datos novos
pt: Previsões para Novos Dados
ta: புதிய தரவுகளுக்கான கணிப்புகள்

source: Relative Influence
es: Influencia Relativa
gl: Influencia Relativa
pt: Influência Relativa
ta: உறவினர் செல்வாக்கு

source: <i>Warning.</i>
gl: <i>Aviso</i>
pt: <i>Aviso.</i>
ta: <i> எச்சரிக்கை. </i>

source: An error occurred when computing the mean dropout loss: %1$s
gl: Aconteceu un fallo ao calcular a perda media do abandono: %1$s
pt: Ocorreu um erro ao calcular a perda média de abandono: %1$s
ta: சராசரி கைவிடுதல் இழப்பைக் கணக்கிடும்போது பிழை ஏற்பட்டது: %1$s

source: Out-of-bag Improvement Plot
es: Gráfico de la Mejora "Descubierto el Pastel"
gl: Gráfica da Mellora "Descuberto o Choio"
pt: Gráfico de Melhoria 'Fora da Sacola'
ta: பேக் மேம்பாட்டு சூழ்ச்சி

source: Training set
es: Conjunto de Adiestramiento
gl: Conxunto de Ensaio
pt: Conjunto de treinamento
ta: பயிற்சி தொகுப்பு

source: OOB Change in Multinomial Deviance
es: Cambio OOB en la Desviación Multinomial
gl: Cambio OOB na Desviación Multinomial
pt: Mudança OOB em Desvio Multinomial
ta: OOB மாற்றம் மல்டினோமியல் விலகல்

source: OOB Change in Binomial Deviance
es: Cambio OOB en la Desviación Binomial
gl: Cambio OOB na Desviación Binomial
pt: Mudança OOB em Desvio Binomial
ta: OOB மாற்றம் பைனோமியல் விலகல்

source: OOB Change in %s Deviance
es: Cambio OOB en la Desviación de %s
gl: Cambio OOB na Desviación de %s
pt: Mudança OOB em Desvio %s
ta: OOB மாற்றம் %s விலகல்

source: Plotting not possible: The model is based on only a single tree.
es: No es posible la representación gráfica: el modelo se basa en un único árbol.
gl: Non é posible a representación gráfica: o modelo baséase só nunha única árbore.
pt: Não é possível plotar: O modelo é baseado em apenas uma única árvore.
ta: சூழ்ச்சி செய்ய முடியாது: மாதிரி ஒரு மரத்தை மட்டுமே அடிப்படையாகக் கொண்டது.

source: Number of Trees
es: Número de Árboles
gl: Número de Árbores
pt: Número de Árvores
ta: மரங்களின் எண்ணிக்கை

source: Deviance Plot
es: Gráfico de Desviaciones
gl: Gráfica de Desviacións
pt: Gráfico de Desvios
ta: விலகல் சூழ்ச்சி

source: Multinomial Deviance
es: Desviación de Multinomial
gl: Desviación de Multinomial
pt: Desvio Multinomial
ta: மல்டினோமியல் விலகல்

source: Binomial Deviance
es: Desviación de Binomial
gl: Desviación de Binomial
pt: Desvio Binomial
ta: பைனோமியல் விலகல்

source: %s Deviance
es: %s Desviación
gl: %s Desviación
pt: Desvio %s
ta: %s விலகல்

source: Relative Influence Plot
es: Gráfico de Influencia Relativa
gl: Gráfica de Influencia Relativa
pt: Gráfico de Influência Relativa
ta: உறவினர் செல்வாக்கு சூழ்ச்சி

source: The minimum number of observations per node is too large. Ensure that `2 * Min. observations in node (%1$i) + 1` < `Training data used per tree (%2$s) * available training data (%3$i)` (in this case the minimum can be %4$i at most).
es: El número mínimo de observaciones por nodo es demasiado grande. Asegúrese de que `2 * Min. observaciones en nodo (%1$i) + 1` < `Datos de adiestramiento utilizados por árbol (%2$s) * Datos de adiestramiento disponibles (%3$i)` (en este caso el mínimo puede ser %4$i como mucho).
gl: O número mínimo de observacións por nodo é longo de máis. Asegúrate de que `2 * Min. observacións no nodo (%1$i) + 1` < `Datos de ensaio utilizados por árbore (%2$s) * Datos de ensaio dispoñibles (%3$i)` (neste caso o mínimo pode ser %4$i como moito).
pt: O número máximo de observações por nó é muito grande. Certifique-se de que `2 * Observações mínimas no nó (%1$i) + 1` < `Dados de treinamento usados por árvore (%2$s) * Dados de treinamento disponíveis (%3$i)` (neste caso, o mínimo pode ser %4$i no máximo).
ta: ஒரு முனைக்கு குறைந்தபட்ச அவதானிப்புகள் மிகப் பெரியவை. `2 * மணித்துளி என்பதை உறுதிப்படுத்தவும். முனையில் உள்ள அவதானிப்புகள் (%1$i) + 1` <`ஒரு மரத்திற்கு (%2$s) பயன்படுத்தப்படும் பயிற்சி தரவு * கிடைக்கக்கூடிய பயிற்சி தரவு (%3$i)` (இந்த விசயத்தில் குறைந்தபட்சம் %4$i ஆக இருக்கலாம் ).

source: Relative Importance
es: Importancia Relativa
gl: Importancia Relativa
pt: Importância Relativa
ta: உறவினர் முக்கியத்துவம்

source: No splits were made in the tree.
es: No se hicieron separaciones en el árbol.
gl: Non se fixeron divisións na árbore.
pt: Nenhuma divisão foi feita na árvore.
ta: மரத்தில் பிளவுகள் எதுவும் செய்யப்படவில்லை.

source: Splits in Tree
es: Separaciones en el Árbol
gl: Divisións na árbore
pt: Divisões na Árvore
ta: மரத்தில் பிரிக்கிறது

source: Obs. in Split
es: Obs. en el Separador
gl: Obs. na División
pt: Obs. na Divisão
ta: ஆப்ச். பிளவு

source: Split Point
es: Punto de Separación
gl: Punto de división
pt: Ponto de Divisão
ta: பிளவு புள்ளி

source: Improvement
es: Mejora
gl: Mellora
pt: Melhoria
ta: முன்னேற்றம்

source: For each level of the tree, only the split with the highest improvement in deviance is shown.
es: Para cada nivel del árbol, solo se muestra el separador con la mayor mejora en la desviación.
gl: Para cada nivel da árbore, só se amosa a división coa maior mellora na desviación.
pt: Para cada nível da árvore, apenas a divisão com a maior melhoria no desvio é mostrada.
ta: மரத்தின் ஒவ்வொரு நிலைக்கும், விலகலில் அதிக முன்னேற்றத்தைக் கொண்ட பிளவு மட்டுமே காட்டப்பட்டுள்ளது.

source: Decision Tree Plot
es: Gráfico del Árbol de Decisión
gl: Gráfica da Árbore de Decisión
pt: Gráfico da Árvore de Decisão
ta: முடிவு மர சூழ்ச்சி

source: Plotting not possible: No splits were made in the tree.
es: No es posible la representación gráfica: no se hicieron separaciones en el árbol.
gl: Non é posible a representación gráfica: non se fixeron divisións na árbore.
pt: Plotagem não possível: Nenhuma divisão foi feita na árvore.
ta: சூழ்ச்சி செய்ய முடியாது: மரத்தில் பிளவுகள் எதுவும் செய்யப்படவில்லை.

source: Plotting not possible: An error occurred while creating this plot: %s
es: No es posible la representación gráfica: se produjo un fallo al crear este gráfico: %s
gl: Non é posible a representación gráfica: aconteceu un fallo mentres se creaba esta gráfica: %s
pt: Plotagem não possível: Ocorreu um erro ao criar este gráfico: %s
ta: சூழ்ச்சி செய்ய முடியாது: இந்த சதித்திட்டத்தை உருவாக்கும் போது பிழை ஏற்பட்டது: %s

source: Classification Accuracy Plot
es: Gráfico de Precisión de la Clasificación
gl: Gráfica de Precisión da Clasificación
pt: Gráfico de Exatidão de Classificação
ta: வகைப்பாடு துல்லியம் சூழ்ச்சி

source: Mean Squared Error Plot
es: Gráfico del Error Cuadrático Medio
gl: Gráfica do Erro Cadrado Medio
pt: Gráfico de Erro Quadrático Médio
ta: சராசரி சதுர பிழை சூழ்ச்சி

source: Classification Accuracy
es: Precisión de la Clasificación
gl: Precisión da Clasificación
pt: Exatidão da Classificação
ta: வகைப்பாடு துல்லியம்

source: Mean Squared Error
es: Error Cuadrático Medio
gl: Erro Cadrado Medio
pt: Erro Quadrático Médio
ta: சராசரி சதுர பிழை

source: Validation set
es: Conjunto de validación
gl: Conxunto de validación
pt: Conjunto de validação
ta: சரிபார்ப்பு தொகுப்பு

source: Complexity Penalty
gl: Penalización da complexidade
pt: Penalidade de Complexidade
ta: சிக்கலான தண்டம்

source: Number of Nearest Neighbors
es: Número de Vecinos Más Cercanos
gl: Número de Veciños Máis Próximos
pt: Número de Vizinhos Mais Próximos
ta: அருகிலுள்ள அண்டை நாடுகளின் எண்ணிக்கை

source: Training and validation set
es: Conjunto de adiestramiento y validación
gl: Conxunto de ensaio e validación
pt: Conjunto de treinamento e validação
ta: பயிற்சி மற்றும் சரிபார்ப்பு தொகுப்பு

source: Rectangular
pt: Retangular
ta: செவ்வக

source: Triangular
ta: முக்கோண

source: Biweight
es: Ponderación doble
gl: Ponderación dobre
pt: Biponderada
ta: இரு எடை

source: Triweight
es: Ponderación triple
gl: Ponderación tripla
pt: Triponderada
ta: ட்ரைவெயிட்

source: Cosine
es: Coseno
gl: Coseno
pt: Cosseno
ta: துணைசெவ்வளைவு

source: Inverse
es: Inversa
gl: Inversa
pt: Inverso
ta: தலைகீழ்

source: Rank
es: Rango
gl: Rango
pt: Ranque
ta: தரவரிசை

source: Optimal
es: Óptimo
gl: Óptimo
pt: Ótimo
ta: உகந்த

source: %1$s Weight Function
es: Función %1$s de Ponderación
gl: Función %1$s de Ponderación
pt: %1$s função de ponderação
ta: %1$s எடை செயல்பாடு

source: Plotting not possible: The selected weighting scheme cannot be visualized separately from the data.
es: No es posible hacer el gráfico: el esquema de ponderación seleccionado no se puede visualizar independientemente de los datos.
gl: Non é posible facer a gráfica: o esquema de ponderación escollido non se pode visualizar independentemente dos datos.
pt: Plotagem não possível: O esquema de ponderação selecionado não pode ser visualizado separadamente dos dados.
ta: சூழ்ச்சி செய்ய முடியாது: தேர்ந்தெடுக்கப்பட்ட வெயிட்டிங் திட்டத்தை தரவிலிருந்து தனித்தனியாக காட்சிப்படுத்த முடியாது.

source: Proportion of Max. Distance
es: Proporción de la Distancia Máxima
gl: Proporción da Distancia Máxima
pt: Proporção da Distância Máx.
ta: அதிகபட்சத்தின் விகிதம். தூரம்

source: Relative Weight
es: Ponderación Relativa
gl: Ponderación Relativa
pt: Peso Relativo
ta: உறவினர் எடை

source: Network Weights
es: Ponderaciones de Red
gl: Ponderacións da Rede
pt: Peso de Redes
ta: பிணையம் எடைகள்

source: Node
es: Nodo
gl: Nodo
pt: Nó
ta: கணு

source: Layer
es: Estrato
gl: Estrato
pt: Camada
ta: அடுக்கு

source: Weight
es: Ponderación
gl: Ponderación
pt: Peso
ta: எடை

source: linear
es: lineal
ta: நேரியல்

source: binary step
es: paso binario
gl: paso binario
pt: passo binário
ta: இருமை படி

source: logistic sigmoid
es: Sigmoide logística
gl: Sigmoide loxística
pt: sigmoide logístico
ta: லாசிச்டிக் சிக்மாய்டு

source: sine
es: seno
gl: seno
pt: seno
ta: செவ்வளை

source: cosine
es: coseno
gl: coseno
pt: cosseno
ta: துணைசெவ்வளைவு

source: inverse tangent
es: tangente inversa
gl: tanxente inversa
pt: tangente inversa
ta: தலைகீழ் தொடுகோடு

source: hyperbolic tangent
es: tangente hiperbólica
gl: tanxente hiperbólica
pt: tangente hiperbólica
ta: ஐபர்போலிக் தொடுகோடு

source: rectified linear unit (ReLU)
es: unidad lineal corregida (ReLU)
gl: unidade linear corrixida (ReLU)
pt: unidade linear corrigida (ReLU)
ta: சரிசெய்யப்பட்ட நேரியல் அலகு (RELU)

source: softplus
ta: மென்பொருள்

source: softsign
ta: சாஃப்டைன்

source: exponential linear unit (ELU)
es: unidad lineal exponencial (ELU)
gl: unidade linear exponencial (ELU)
pt: unidade linear exponencial (ELU)
ta: அதிவேக நேரியல் அலகு (ELU)

source: leaky rectified linear unit (Leaky ReLU)
es: unidad lineal corregida permeable (Leaky ReLU)
gl: unidade linear corrixida permeable (Leaky ReLU)
pt: unidade linear retificada permeável (Leaky ReLU)
ta: கசிந்த சரிசெய்யப்பட்ட நேரியல் அலகு (கசிவு ரெல்யூ)

source: sigmoid linear unit (SiLU)
es: unidad lineal sigmoidal (SiLU)
gl: unidade linear sigmoidal (SiLU)
pt: unidade linear sigmoide (SiLU)
ta: சிக்மாய்டு நேரியல் அலகு (சிலு)

source: mish
ta: மிச்

source: gaussian
es: Normal
gl: Normal
pt: gaussiana
ta: காசியன்
