Repository: jasp-stats/jaspMachineLearning
Catalog: po/R-*.po
Languages: es, gl, pt, ta

source: Cluster Information
es: Información de los conglomerados
gl: Información dos conglomerados
pt: Informação dos Agrupamentos
ta: கொத்து செய்தி

source: Cluster
es: Conglomerado
gl: Conglomerado
pt: Agrupamento
ta: கொத்து

source: Size
es: Tamaño
gl: Tamaño
pt: Tamanho
ta: அளவு

source: Explained proportion within-cluster heterogeneity
es: Proporción explicada de Heterogeneidad dentro del conglomerado
gl: Proporción explicada de Heteroxeneidade dentro do conglomerado
pt: Proporção explicada da heterogeneidade dentro do agrupamento
ta: கொத்து பன்முகத்தன்மைக்குள் விகிதாச்சாரம் விளக்கப்பட்டது

source: Within sum of squares
es: Suma de cuadrados Dentro
gl: Suma de cadrados Dentro
pt: Dentro da soma dos quadrados
ta: சதுரங்களின் தொகைக்குள்

source: Silhouette score
es: Puntuación de siluetas
gl: Puntuación de siluetas
pt: Pontuação de silhueta
ta: நிழல் மதிப்பெண்

source: Center %s
es: Centro %s
gl: Centro %s
pt: Centro %s
ta: நடுவண் %s

source: Noisepoints
es: Puntos confusos
gl: Puntos confusos
pt: Pontos de ruído
ta: ஒலி

source: The Between Sum of Squares of the %1$s cluster model is %2$s
es: La Suma de Cuadrados Entre del modelo %1$s de conglomerados es %2$s
gl: A Suma de Cadrados Entre do modelo %1$s de conglomerados é %2$s
pt: A soma dos quadrados intermediários do modelo de agrupamento %1$s é %2$s
ta: %1$s கிளச்டர் மாதிரியின் சதுரங்களின் தொகைக்கு இடையில் %2$s ஆகும்

source: The Total Sum of Squares of the %1$s cluster model is %2$s
es: La Suma de Cuadrados Total del modelo %1$s de conglomerados es %2$s
gl: A Suma de Cadrados Total do modelo %1$s de conglomerados é %2$s
pt: A soma total dos quadrados do modelo de agrupamento %1$s é %2$s
ta: %1$s கிளச்டர் மாதிரியின் சதுரங்களின் மொத்த தொகை %2$s ஆகும்

source: Value
es: Valor
gl: Valor
pt: Valor
ta: மதிப்பு

source: Maximum diameter
es: Máximo diámetro
gl: Máximo diámetro
pt: Diâmetro máximo
ta: அதிகபட்ச விட்டம்

source: Minimum separation
es: Mínima separación
gl: Mínima separación
pt: Separação mínima
ta: குறைந்தபட்ச பிரிப்பு

source: Pearson's %s
es: %s de Pearson
gl: %s de Pearson
pt: %s de Pearson
ta: பியர்சனின் %s

source: Dunn index
es: Índice de Dunn
gl: Índice de Dunn
pt: Índice de Dunn
ta: டன் இன்டெக்ச்

source: Entropy
es: Entropía
gl: Entropía
pt: Entropia
ta: என்ட்ரோபி

source: Calinski-Harabasz index
es: Índice de Calinski-Harabasz
gl: Índice de Calinski-Harabasz
pt: Índice de Calinski-Harabasz
ta: காலின்ச்கி-அராபாச் அட்டவணை

source: All metrics are based on the <i>euclidean</i> distance.
es: Todas las métricas se basan en la distancia <i>euclídea</i>.
gl: Tódalas métricas baséanse na distancia <i>euclídea</i>.
pt: Todas as métricas são baseadas na distância <i>euclidiana</i>.
ta: அனைத்து அளவீடுகளும் <i> யூக்ளிடியன் </i> தூரத்தை அடிப்படையாகக் கொண்டவை.

source: Evaluation metrics cannot be computed when there is only 1 cluster.
es: Las métricas de evaluación no se pueden calcular cuando solo hay 1 conglomerado.
gl: As métricas de avaliación non se poden calcular cando só hai 1 conglomerado.
pt: Métricas de avaliação não podem ser computadas quando há apenas 1 agrupamento.
ta: 1 கிளச்டர் மட்டுமே இருக்கும்போது மதிப்பீட்டு அளவீடுகளை கணக்கிட முடியாது.

source: t-SNE Cluster Plot
es: Gráfico de Conglomerados t-SNE
gl: Gráfica de Conglomerados t-SNE
pt: Gráfico de Agrupamento t-SNE
ta: டி-எச்.என்.இ கிளச்டர் சூழ்ச்சி

source: Noisepoint
es: Punto confuso
gl: Punto confuso
pt: Ponto de ruído
ta: ஒலி

source: Elbow Method Plot
es: Gráfico del Método del Codo
gl: Gráfica do Método do Cóbado
pt: Gráfico do Método do Cotovelo
ta: முழங்கை முறை சூழ்ச்சி

source: Number of Clusters
es: Número de Conglomerados
gl: Número de Conglomerados
pt: Número de Agrupamentos
ta: கொத்துக்களின் எண்ணிக்கை

source: Lowest %s
es: Menor %s
gl: Menor %s
pt: %s mais baixo
ta: மிகக் குறைந்த %s

source: Cluster Means
es: Medias de los Conglomerados
gl: Medias dos Conglomerados
pt: Médias dos Agrupamentos
ta: கொத்து என்றால்

source: Cluster %s
es: Conglomerado %s
gl: Conglomerado %s
pt: Agrupamento %s
ta: கிளச்டர் %s

source: Cluster Density Plots
es: Gráficos de Densidades de los Conglomerados
gl: Gráficas de Densidades dos Conglomerados
pt: Gráficos de Densidade dos Agrupamentos
ta: கொத்து அடர்த்தி அடுக்கு

source: Feature
es: Característica
gl: Característica
pt: Característica
ta: நற்பொருத்தம்

source: All Features
es: Todas las Características
gl: Tódalas Características
pt: Todas as Características
ta: அனைத்து அம்சங்களும்

source: Cluster Mean Plots
es: Gráficos de Medias de los Conglomerados
gl: Gráficas das Medias dos Conglomerados
pt: Gráficos das Médias dos Agrupamentos
ta: கொத்து சராசரி அடுக்கு

source: Cluster Mean
es: Media de los Conglomerados
gl: Media dos Conglomerados
pt: Média dos Agrupamentos
ta: கொத்து சராசரி

source: Insufficient RAM available to compute the distance matrix. The analysis tried to allocate %s Gb
es: La RAM disponible es insuficiente para calcular la matriz de distancias. El análisis intentó asignar %s Gb
gl: A RAM dispoñible é insuficiente para calcular a matriz de distancias. A análise intentou asignar %s Gb
pt: Não há RAM suficiente disponível para calcular a matriz de distância. A análise tentou alocar %s Gb
ta: தூர மேட்ரிக்சைக் கணக்கிட போதுமான ரேம் கிடைக்கவில்லை. பகுப்பாய்வு %s GB ஐ ஒதுக்க முயற்சித்தது

source: An error occurred in the analysis: %1$s
es: Ocurrió un fallo en el análisis: %1$s
gl: Aconteceu un fallo na análise : %1$s
pt: Um erro ocorreu na análise: %1$s
ta: பகுப்பாய்வில் பிழை ஏற்பட்டது: %1$s

source: Cluster Matrix Plot
es: Gráfico de la Matriz de los Conglomerados
gl: Gráfica da Matriz dos Conglomerados
pt: Gráfico da Mariz dos Agrupamentos
ta: கிளச்டர் மேட்ரிக்ச் சூழ்ச்சி

source: The variable '%s' can't be both a feature and a test set indicator.
es: La variable '%s' no puede ser al mismo tiempo una característica y un indicador del conjunto de contrastes.
gl: A variable '%s' non pode ser ao tempo unha característica e un indicador do conxunto de probas.
pt: A variável '%s' não pode ser uma característica e um indicador de conjunto de testes.
ta: '%s' மாறி ஒரு நற்பொருத்தம் மற்றும் சோதனை தொகுப்பு காட்டி இரண்டாக இருக்க முடியாது.

source: Your test set indicator should be binary, containing only 1 (included in test set) and 0 (excluded from test set).
es: El indicador del conjunto de contrastes debería ser binario, conteniendo solo 1 (incluido en el conjunto de contrastes) y 0 (excluido del conjunto de contrastes).
gl: O teu indicador do conxunto de probas debera ser binario, contendo só 1 (incluído no conxunto de probas) e 0 (excluído do conxunto de probas).
pt: Seu indicador de conjunto de teste deve ser binário, contendo apenas 1 (incluído no conjunto de teste) e 0 (excluído do conjunto de teste).
ta: உங்கள் சோதனை தொகுப்பு காட்டி பைனரியாக இருக்க வேண்டும், இதில் 1 (சோதனை தொகுப்பில் சேர்க்கப்பட்டுள்ளது) மற்றும் 0 (சோதனை தொகுப்பிலிருந்து விலக்கப்பட்டுள்ளது) மட்டுமே உள்ளன.

source: There is only one observation in each level of the factor %1$s, please remove this factor as a feature.
es: Solo hay una observación en cada nivel del factor %1$s; por favor, elimina ese factor como característica.
gl: Só hai unha observación en cada nivel do factor %1$s; por favor, elimina ese factor como característica.
pt: Há apenas uma observação em cada nível do fator %1$s, remova este fator como uma característica.
ta: %1$s காரணி ஒவ்வொரு மட்டத்திலும் ஒரே ஒரு அவதானிப்பு மட்டுமே உள்ளது, தயவுசெய்து இந்த காரணியை ஒரு அம்சமாக அகற்றவும்.

source: There is only one observation in each level of the factors %1$s, please remove these factors as a feature.
es: Solo hay una observación en cada nivel de los factores %1$s; por favor, elimina esos factores como características.
gl: Só hai unha observación en cada nivel dos factores %1$s; por favor, elimina eses factores como características.
pt: Há apenas uma observação em cada nível dos fatores %1$s, remova esses fatores como uma característica.
ta: %1$s காரணிகளின் ஒவ்வொரு மட்டத்திலும் ஒரே ஒரு அவதானிப்பு மட்டுமே உள்ளது, தயவுசெய்து இந்த காரணிகளை ஒரு அம்சமாக அகற்றவும்.

source: test set
gl: Conxunto de probas
pt: conjunto de teste
ta: சோதனை தொகுப்பு

source: validation set
gl: Conxunto de validación
pt: conjunto de validação
ta: சரிபார்ப்பு தொகுப்பு

source: new dataset
gl: Novo conxunto de datos
pt: novo conjunto de dados
ta: புதிய தரவுத்தொகுப்பு

source: or use a different test set (e.g., automatically by setting a different seed or manually by specifying the test set indicator)
gl: ou usar un conxunto distinto de probas (p.e., automaticamente establecendo unha semente distinta, ou manualmente especificando o indicador de conxunto de probas)
pt: ou use um conjunto de teste diferente (e.g., automaticamente definindo uma semente diferente ou manualmente especificando o indicador do conjunto de teste)
ta: அல்லது வேறு சோதனை தொகுப்பைப் பயன்படுத்தவும் (எ.கா., தானாகவே வேறு விதை அமைப்பதன் மூலம் அல்லது கைமுறையாக சோதனை தொகுப்பு குறிகாட்டியைக் குறிப்பிடுவதன் மூலம்)

source: or use a different validation set by setting a different seed
gl: ou usar un conxunto distinto de probas establecendo unha semente distinta
pt: ou use um conjunto de validação diferente definindo uma semente diferente
ta: அல்லது வேறு விதை அமைப்பதன் மூலம் வேறுபட்ட சரிபார்ப்பைப் பயன்படுத்தவும்

source: Some factors in the %1$s have levels that do not appear in the training set. Please remove the rows with the following levels from the dataset%2$s. %3$s
gl: Algúns factores en %1$s teñen niveis que non aparecen no conxunto de ensaio. Por favor, elimina as filas cos seguintes niveis, do conxunto de datos %2$s. %3$s
pt: Alguns fatores em %1$s possuem níveis que não aparecem no conjunto de treinamento. Remova as linhas com os seguintes níveis do conjunto de dados %2$s. %3$s
ta: %1$s இல் உள்ள சில காரணிகள் பயிற்சி தொகுப்பில் தோன்றாத அளவைக் கொண்டுள்ளன. தரவுத்தொகுப்பு%2$s இலிருந்து பின்வரும் நிலைகளுடன் வரிசைகளை அகற்றவும். %3$s

source: You have specified more nearest neighbors than there are observations in the training set. Please choose a number lower than %d.
es: Se han indicado más vecinos más próximos que las observaciones que hay en el conjunto de adiestramiento. Por favor, escoja un número menor que %d.
gl: Indicaches máis veciños máis próximos que as observacións que hai no conxunto de ensaio. Por favor, escolle un número menor que %d.
pt: Você especificou mais vizinhos mais próximos do que observações no conjunto de treinamento. Escolha um número menor que %d.
ta: பயிற்சி தொகுப்பில் அவதானிப்புகள் இருப்பதை விட அருகிலுள்ள அண்டை நாடுகளை நீங்கள் குறிப்பிட்டுள்ளீர்கள். %d ஐ விடக் குறைவான எண்ணைத் தேர்வுசெய்க.

source: You have specified more folds than there are observations in the training and validation set. Please choose a number lower than %d.
es: Se han indicado más pliegues que el número de observaciones que hay en el conjunto de adiestramiento y validación. Por favor, escoja un número menor que %d.
gl: Indicaches máis pregos que o número de observacións que hai no conxunto de ensaio e validación. Por favor, escolle un número menor que %d.
pt: Você especificou mais dobras do que observações no conjunto de treinamento e validação. Escolha um número menor que %d.
ta: பயிற்சி மற்றும் சரிபார்ப்பு தொகுப்பில் அவதானிப்புகள் இருப்பதை விட அதிகமான மடிப்புகளை நீங்கள் குறிப்பிட்டுள்ளீர்கள். %d ஐ விடக் குறைவான எண்ணைத் தேர்வுசெய்க.

source: K-Nearest Neighbors Regression
es: Regresión de los K Vecinos Más Próximos
gl: Regresión dos K Veciños Máis Próximos
pt: Regressão de K-Vizinhos Mais Próximos
ta: கே-அருகிலுள்ள அண்டை பின்னடைவு

source: Regularized Linear Regression
es: Regresión Lineal Regularizada
gl: Regresión Linear Regularizada
pt: Regressão Linear Regularizada
ta: நேரியல் பின்னடைவை முறைப்படுத்தியது

source: Random Forest Regression
es: Regresión de Bosques Aleatorios
gl: Regresión de Bosques Aleatorios
pt: Regressão de Floresta Aleatória
ta: சீரற்ற வன பின்னடைவு

source: Boosting Regression
es: Regresión de Potenciación
gl: Regresión de Potenciación
pt: Boosting a Regressão
ta: பின்னடைவை அதிகரிக்கும்

source: Neural Network Regression
es: Regresión de Red Neuronal
gl: Regresión da Rede Neuronal
pt: Regressão de Rede Neural
ta: நரம்பியல் பிணையம் பின்னடைவு

source: Decision Tree Regression
es: Regresión de Árbol de Decisión
gl: Regresión de Árbore de Decisión
pt: Regressão da Árvore de Decisão
ta: முடிவு மரம் பின்னடைவு

source: Support Vector Machine Regression
es: Regresión de Máquinas de Vectores de Soporte
gl: Regresión de Máquinas de Vectores de Soporte
pt: Regressão da Máquina de Vetores de Suporte
ta: திசையன் இயந்திர பின்னடைவை ஆதரிக்கவும்

source: Linear Regression
es: Regresión Lineal
gl: Regresión linear
pt: Regressão Linear
ta: நேரியல் பின்னடைவு

source: Penalty
es: Penalización
gl: Penalización
pt: Penalidade
ta: தண்டம்

source: Loss function
es: Función de pérdida
gl: Función de perda
pt: Função de perda
ta: இழப்பு செயல்பாடு

source: Validation MSE
es: ECM de la Validación
gl: ECM da Validación
pt: EQM da Validação
ta: சரிபார்ப்பு எம்.எச்.இ.

source: Test MSE
es: ECM del contraste
gl: ECM da Proba
pt: EQM do Teste
ta: சோதனை MSE

source: OOB Error
es: Error OOB
gl: Erro OOB
pt: Erro OOB
ta: OOB பிழை

source: Adjusted R%1$s
es: R%1$s ajustado
gl: R%1$s axustado
pt: R%1$s Ajustado
ta: சரிசெய்யப்பட்ட r%1$s

source: Please provide a target variable and at least %d feature variable(s).
es: Por favor, proporcione una variable objetivo y, al menos, %d variable(s) característica(s).
gl: Por favor, proporciona unha variable obxectivo e, cando menos, %d variable(s) característica(s).
pt: Por favor, forneça uma variável alvo e pelo menos %d variável(is) de característica.
ta: இலக்கு மாறி மற்றும் குறைந்தது %d அம்ச மாறி (கள்) ஆகியவற்றை வழங்கவும்.

source: The model is optimized with respect to the <i>validation set mean squared error</i>.
es: El modelo se optimiza respecto al <i>error cuadrático medio del conjunto de verificaciones</i>.
gl: O modelo optimízase respecto ao <i>erro cadrado medio do conxunto de verificacións</i>.
pt: O modelo é otimizado em relação ao <i>erro quadrático médio do conjunto de validação</i>.
ta: <i> சரிபார்ப்பு தொகுப்பு சராசரி ச்கொயர் பிழை </i> தொடர்பாக மாதிரி உகந்ததாக உள்ளது.

source: When %s is set to 0 linear regression is performed.
es: Cando se pone %s en 0, se realiza la regresión lineal.
gl: Cando se pon %s en 0, realízase a regresión linear.
pt: Quando %s é definido como 0, uma regressão linear é realizada.
ta: %s 0 நேரியல் பின்னடைவு என அமைக்கப்படும் போது.

source: The model is optimized with respect to the <i>out-of-bag mean squared error</i>.
es: El modelo se optimiza respecto al <i>error cuadrático medio "descubierto el pastel"</i>.
gl: O modelo optimízase respecto ao <i>erro cadrado medio "descuberto o choio"</i>.
pt: O modelo é otimizado em relação ao <i>erro quadrático médio 'fora da sacola'</i>.
ta: <i> பேக் அவுட்-ஆஃப்-பேக் சராசரி சதுர பிழை </i> தொடர்பாக மாதிரி உகந்ததாக உள்ளது.

source: Gaussian
es: Normal
gl: Normal
pt: Gaussiana
ta: காசியன்

source: Laplace
ta: லாப்லேச்

source: MSE(scaled)
gl: ECM(MSE, escalado)
pt: EQM(escalonado)
ta: MSE (அளவிடப்பட்டது)

source: R%s cannot be computed due to lack of variance in the predictions.</i>
es: No se puede calcular el R%s debido a la falta de varianza en las predicciones.</i>
gl: Non pode calcularse o R%s debido á falla de varianza nas predicións.</i>
pt: R%s não podem ser calculados devido à falta de variância nas previsões.</i>
ta: கணிப்புகளில் மாறுபாடு இல்லாததால் R%sகளை கணக்கிட முடியாது.</i>

source: Predictive Performance Plot
es: Gráfico de Capacidad Predictiva
gl: Gráfica de Capacidade Preditiva
pt: Gráfico de Desempenho Preditivo
ta: முன்கணிப்பு செயல்திறன் சூழ்ச்சி

source: Observed Test Values
es: Valores Observados de los Contrastes
gl: Valores Observados das Probas
pt: Valores de Teste Observados
ta: கவனிக்கப்பட்ட சோதனை மதிப்புகள்

source: Predicted Test Values
es: Valores Predichos de los Contrastes
gl: Valores Preditos das Probas
pt: Valores de Teste Previstos
ta: கணிக்கப்பட்ட சோதனை மதிப்புகள்

source: Data Split
es: Separador de Datos
gl: División de datos
pt: Dividir Dados
ta: தரவு பிளவு

source: Train: %d
es: Adiestramiento: %d
gl: Ensaio: %d
pt: Treino: %d
ta: ரயில்: %d

source: Test: %d
es: Contraste: %d
gl: Proba: %d
pt: Teste: %d
ta: சோதனை: %d

source: Total: %d
ta: மொத்தம்: %d

source: Validation: %d
es: Validación: %d
gl: Validación: %d
pt: Validação: %d
ta: சரிபார்ப்பு: %d

source: Train and validation: %d
es: Adiestramiento y validación: %d
gl: Ensaio e validación: %d
pt: Treino e validação: %d
ta: ரயில் மற்றும் சரிபார்ப்பு: %d

source: Additive Explanations for Predictions of New Cases
es: Explicaciones añadidas para predicciones de nuevos casos
gl: Explicacións engadidas para predicións de novos casos
pt: Explicações Aditivas para Previsões de Novos Casos
ta: புதிய நிகழ்வுகளின் கணிப்புகளுக்கான சேர்க்கை விளக்கங்கள்

source: Additive Explanations for Predictions of Test Set Cases
es: Explicaciones añadidas para predicciones de casos del conjunto de tests
gl: Explicacións engadidas para predicións de casos do conxunto de probas
pt: Explicações Aditivas para Previsões de Casos de Conjuntos de Teste
ta: சோதனை தொகுப்பு நிகழ்வுகளின் கணிப்புகளுக்கான சேர்க்கை விளக்கங்கள்

source: Case
es: Caso
gl: Caso
pt: Caso
ta: வழக்கு

source: Predicted (Prob.)
es: Predicho (Prob.)
gl: Predito (Prob.)
pt: Previsto (Prob.)
ta: கணிக்கப்பட்ட (ஆய்வு.)

source: Base
ta: காரம்

source: An error occurred when computing the results for this table: %1$s
gl: Aconteceu un fallo ao calcular os resultados para esta táboa: %1$s
pt: Um erro ocorreu ao calcular os resultados para esta tabela: %1$s
ta: இந்த அட்டவணைக்கான முடிவுகளை கணக்கிடும்போது பிழை ஏற்பட்டது: %1$s

source: Displayed values represent feature contributions to the predicted value without features (column 'Base') for the test set.
es: Los valores presentados representan los aportes de características al valor predicho sin particularidades (columna 'Base') para el conjunto de tests.
gl: Os valores amosados representan as achegas de características ao valor predito sen particularidades (columna 'Base') para o conxunto de probas.
pt: Os valores exibidos representam contribuições de recursos para o valor previsto sem características (coluna 'Base') para o conjunto de teste.
ta: காட்டப்படும் மதிப்புகள் சோதனை தொகுப்பிற்கான நற்பொருத்தங்கள் (நெடுவரிசை 'அடிப்படை') இல்லாமல் கணிக்கப்பட்ட மதிப்புக்கு அம்ச பங்களிப்புகளைக் குறிக்கின்றன.

source: Displayed values represent feature contributions to the predicted class probability without features (column 'Base') for the test set.
es: Los valores presentados representan los aportes de características a la probabilidad predicha de clase sin particularidades (columna 'Base') para el conjunto de tests.
gl: Os valores amosados representan as achegas de características á probabilidade predita de clase sen particularidades (columna 'Base') para o conxunto de probas.
pt: Os valores exibidos representam contribuições de recursos para a probabilidade de classe prevista sem características (coluna 'Base') para o conjunto de teste.
ta: காட்டப்படும் மதிப்புகள் சோதனை தொகுப்பிற்கான நற்பொருத்தங்கள் (நெடுவரிசை 'அடிப்படை') இல்லாமல் கணிக்கப்பட்ட வகுப்பு நிகழ்தகவுக்கான அம்ச பங்களிப்புகளைக் குறிக்கின்றன.

source: Feature Importance Metrics
es: Métricas de la importancia de la característica
gl: Métricas da importancia da característica
pt: Métricas de Importância das Características
ta: அம்ச முக்கியத்துவம் அளவீடுகள்

source: Mean dropout loss
es: Pérdida media del abandono
gl: Perda media do abandono
pt: Perda média de abandono
ta: சராசரி கைவிடுதல் இழப்பு

source: root mean squared error (RMSE)
gl: Raíz do erro cadrado medio (RECM, RMSE)
pt: raiz do erro quadrático médio (RMSE)
ta: ரூட் சராசரி சதுர பிழை (ஆர்.எம்.எச்.இ)

source: 1 - area under curve (AUC)
gl: 1 - Área Baixo a Curva (ABC, AUC)
pt: 1 - área sob a curva (ASC)
ta: 1 - வளைவின் கீழ் பகுதி (ஏ.யூ.சி)

source: cross entropy
gl: Entropía cruzada
pt: entropia cruzada
ta: குறுக்கு என்ட்ரோபி

source: Mean dropout loss (defined as %1$s) is based on %2$s permutations.
gl: A perda media do abandono (definida como %1$s) baséase en %2$s permutacións.
pt: A perda média de abandono (definida como %1$s) é baseada em %2$s permutações.
ta: சராசரி கைவிடுதல் இழப்பு ( %1$s என வரையறுக்கப்படுகிறது) %2$s வரிசைமாற்றங்களை அடிப்படையாகக் கொண்டது.

source: The target variable should have at least 2 classes.
es: La variable objetivo debe tener al menos 2 clases.
gl: A variable obxectivo debe ter 2 clases, cando menos.
pt: A variável alvo deve ter pelo menos 2 classes.
ta: இலக்கு மாறியில் குறைந்தது 2 வகுப்புகள் இருக்க வேண்டும்.

source: Linear Discriminant Coefficients
es: Coeficientes del Discriminante Lineal
gl: Coeficientes do Discriminante Linear
pt: Coeficientes do Discriminante Linear
ta: நேரியல் பாரபட்சமான குணகங்கள்

source: (Constant)
es: (Constante)
gl: (Constante)
pt: (Constante)
ta: (மாறிலி)

source: Prior and Posterior Class Probabilities
es: Probabilidades de Clase Previa y Posterior
gl: Probabilidades de Clase Previa e Posterior
pt: Probabilidades de Classe Anterior e Posterior
ta: முன் மற்றும் பின்புற வகுப்பு நிகழ்தகவுகள்

source: Class Means in Training Data
es: Medias de Clase en los Datos de Adiestramiento
gl: Medias de Clase nos Datos de Ensaio
pt: Médias de Classe em Dados de Treinamento
ta: வகுப்பு என்றால் பயிற்சி தரவுகளில்

source: Linear Discriminant Matrix
es: Matriz del Discriminante Lineal
gl: Matriz do Discriminante Linear
pt: Matriz Discriminante Linear
ta: நேரியல் பாகுபாடு மேட்ரிக்ச்

source: Tests of Equality of Class Means
es: Contrastes de Igualdad de Medias de Clase
gl: Probas de Igualdade de Medias de Clase
pt: Testes de Igualdade de Médias de Classe
ta: வர்க்கத்தின் சமத்துவத்தின் சோதனைகள்

source: The null hypothesis specifies equal class means.
es: La hipótesis nula indica medias de clase iguales.
gl: A hipótese nula indica medias de clase iguais.
pt: A hipótese nula especifica médias das classes iguais.
ta: சுழிய கருதுகோள் சம வகுப்பு வழிமுறைகளைக் குறிப்பிடுகிறது.

source: Tests of Equality of Covariance Matrices
es: Contrastes de Igualdad de Matrices de Covarianzas
gl: Probas de Igualdade de Matrices de Covarianzas
pt: Testes de Igualdade de Matrizes de Covariância
ta: கோவாரன்ச் மெட்ரிக்சின் சமத்துவத்தின் சோதனைகள்

source: df
es: gl
gl: gl
pt: gl
ta: டி.எஃப்

source: p
ta: ப

source: The null hypothesis specifies equal covariance matrices.
es: La hipótesis nula indica matrices de covarianzas iguales.
gl: A hipótese nula indica matrices de covarianzas iguais.
pt: A hipótese nula especifica matrizes de covariância iguais.
ta: சுழிய கருதுகோள் சமமான கோவாரன்ச் மெட்ரிக்குகளைக் குறிப்பிடுகிறது.

source: There are one or more levels in the target variable with less than two observations.
es: Hay uno o más niveles de la variable objetivo con menos de dos observaciones.
gl: Hai un ou máis niveis da variable obxectivo con menos de dúas observacións.
pt: Há um ou mais níveis na variável alvo com menos de duas observações.
ta: இலக்கு மாறியில் ஒன்று அல்லது அதற்கு மேற்பட்ட நிலைகள் இரண்டு அவதானிப்புகளுக்கும் குறைவாக உள்ளன.

source: Box's M
es: M de Box
gl: M de Box
pt: M de Box
ta: பெட்டியின் மீ

source: Pooled Within-Class Matrices Correlations
es: Correlaciones de las Matrices Combinadas Dentro de Clase
gl: Correlacións das Matrices Combinadas Dentro de Clase
pt: Correlações de Matrizes dentro de Classes Combinadas
ta: வகுப்பு மெட்ரிக்ச் தொடர்புகள்

source: Tests for Multivariate Normality
es: Contrastes de Normalidad Multivariante
gl: Probas de Normalidade Multivariante
pt: Testes para Normalidade Multivariada
ta: பன்முக இயல்புநிலைக்கான சோதனைகள்

source: Statistic
es: Estadístico
gl: Estatístico
pt: Estatística
ta: புள்ளிவிவரம்

source: Skewness
es: Asimetría
gl: Asimetría
pt: Assimetria
ta: வளைவு

source: Kurtosis
es: Curtosis
gl: Curtose
pt: Curtose
ta: கர்டோசிச்
