Repository: jasp-stats/jaspMachineLearning
Catalog: po/R-*.po
Languages: es, gl, pt, ta

source: gaussian error linear unit (GeLU)
es: unidad lineal de error Normal (GeLU)
gl: unidade linear de erro Normal (GeLU)
pt: unidade linear de erro gaussiano (GeLU)
ta: காசியன் பிழை நேரியல் அலகு (செலு)

source: The weights are input for the %1$s activation function.
es: Las ponderaciones son entradas para la función %1$s de activación.
gl: As ponderacións son entradas para a función %1$s de activación.
pt: Os pesos são inseridos para a função de ativação %1$s.
ta: எடைகள் %1$s செயல்படுத்தும் செயல்பாட்டிற்கான உள்ளீடு ஆகும்.

source: Network Structure Plot
es: Gráfico de la Estructura de Red
gl: Gráfica da Estrutura de Rede
pt: Gráfico de Estrutura de Rede
ta: பிணைய கட்டமைப்பு சூழ்ச்சி

source: Intercept
es: Constante
gl: Constante
pt: Intercepto
ta: இடைமறிப்பு

source: Input layer
es: Estrato de entrada
gl: Estrato de entrada
pt: Camada de entrada
ta: உள்ளீட்டு அடுக்கு

source: Output layer
es: Estrato de salida
gl: Estrato de saída
pt: Camada de saída
ta: வெளியீட்டு அடுக்கு

source: Hidden layer %1$s
es: Estrato oculto %1$s
gl: Estrato oculto %1$s
pt: Camada escondida %1$s
ta: மறைக்கப்பட்ட அடுக்கு %1$s

source: Binary
es: Binario
gl: Binario
pt: Binário
ta: இருமம்

source: Logistic Sigmoid
es: Sigmoide logística
gl: Sigmoide loxística
pt: Sigmoide Logístico
ta: லாசிச்டிக் சிக்மாய்டு

source: Sine
es: Seno
gl: Seno
pt: Seno
ta: செவ்வளை

source: Inverse Tangent
es: Tangente Inversa
gl: Tanxente Inversa
pt: Tangente Inversa
ta: தலைகீழ் தொடுகோடு

source: Hyperbolic Tangent
es: Tangente Hiperbólica
gl: Tanxente Hiperbólica
pt: Tangente Hiperbólica
ta: ஐபர்போலிக் தொடுகோடு

source: ReLU
ta: மீண்டும் தொடங்குங்கள்

source: Softplus
ta: மென்பொருள்

source: Softsign
ta: சாஃப்டைன்

source: ELU
ta: எலு

source: Leaky ReLU
ta: கசிவு ரெல்லு

source: SiLU
ta: சக்தியின் ஆற்றல்

source: Mish
ta: மிச்

source: GeLU
ta: சேவ்

source: %1$s Activation Function
es: Función %1$s de Activación
gl: Función %1$s de Activación
pt: %1$s Função de Ativação
ta: %1$s செயல்படுத்தும் செயல்பாடு

source: Input
es: Entrada
gl: Entrada
pt: Entrada
ta: உள்ளீடு

source: Output
es: Salida de resultados
gl: Saída de resultados
pt: Saída
ta: வெளியீடு

source: Generation
es: Generación
gl: Xeración
pt: Geração
ta: தலைமுறை

source: Mean decrease in accuracy
es: Disminución media en la precisión
gl: Decrecemento medio na precisión
pt: Decréscimo médio na exatidão
ta: துல்லியத்தில் குறைவு

source: Total increase in node purity
es: Aumento total de la pureza del nodo
gl: Incremento total da pureza do nodo
pt: Crescimento total na pureza de nó
ta: முனை தூய்மையின் மொத்த அதிகரிப்பு

source: Out-of-bag Classification Accuracy Plot
es: Gráfico de la Precisión de la Clasificación "Descubierto el Pastel"
gl: Gráfica da Precisión da Clasificación "Descuberto o Choio"
pt: Gráfico de Exatidão da Classificação 'Fora da Sacola'
ta: பேக்-க்கு வெளியே வகைப்பாடு துல்லியம் சூழ்ச்சி

source: Out-of-bag Mean Squared Error Plot
es: Gráfico del Error Cuadrático Medio "Descubierto el Pastel"
gl: Gráfica do Erro Cadrado Medio "Descuberto o Choio"
pt: Gráfico de Erro Quadrático Médio 'Fora da Sacola'
ta: பேக் சராசரி சதுர பிழை சூழ்ச்சி

source: Out-of-bag %sClassification Accuracy
es: Precisión de la Clasificación %s "Descubierto el Pastel"
gl: Precisión da Clasificación %s "Descuberto o Choio"
pt: Precisão de Classificação %s 'fora da sacola'
ta: பாக்-க்கு வெளியே %sவகைப்பாடு துல்லியம்

source: Out-of-bag %sMean Squared Error
es: Error Cuadrático Medio %s "Descubierto el Pastel"
gl: Erro Cadrado Medio %s "Descuberto o Choio"
pt: Erro Quadrático Médio %s 'fora da sacola'
ta: பேக் %sசராசரி சதுர பிழை

source: Mean Decrease in Accuracy
es: Disminución media en la precisión
gl: Decrecemento medio na precisión
pt: Decréscimo Médio na Exatidão
ta: துல்லியத்தில் குறைவு

source: Total Increase in Node Purity
es: Incremento Total de la Pureza del Nodo
gl: Incremento Total da Pureza do Nodo
pt: Crescimento Total na Pureza de Nó
ta: முனை தூய்மையின் மொத்த அதிகரிப்பு

source: L2 (Ridge)
es: L2 (Cresta)
gl: L2 (Crista)
pt: L2 (Cume)
ta: எல் 2 (ரிட்ச்)

source: L1 (Lasso)
ta: எல் 1 (லாசோ)

source: Elastic Net
es: Red Elástica
gl: Rede Elástica
pt: Rede Elástica
ta: மீள் நிகர

source: Variable Trace Plot
es: Gráfico de Trazo de las Variables
gl: Gráfica de Trazo das Variables
pt: Gráfico de Traço da Variável
ta: மாறி சுவடு சூழ்ச்சி

source: Coefficients
es: Coeficientes
gl: Coeficientes
pt: Coeficientes
ta: குணகங்கள்

source: Lambda Evaluation Plot
es: Gráfico de Evaluación Lambda
gl: Gráfica da Avaliación Lambda
pt: Gráfico de Avaliação Lambda
ta: லாம்ப்டா மதிப்பீட்டு சூழ்ச்சி

source: Cross-Validated %sMean Squared Error
es: Raíz del Error %s Cuadrático Medio con Verificación Cruzada
gl: Raíz do Erro %s Cadrado Medio con Verificación Cruzada
pt: Erro Quadrático Médio %s Validado Cruzado
ta: குறுக்கு சரிபார்ப்பு %sஎன்பது சதுர பிழை

source: Min. CV MSE
es: Min. CV ECM
gl: Min. CV ECM
pt: Mín. CV EQM
ta: மணித்துளி. சி.வி எம்.எச்.இ.

source: %s 1 SE
es: %s 1 ET
gl: %s 1 EP
pt: %s 1 DP
ta: 1 உடன் %s

source: Row
es: Fila
gl: Fila
pt: Linha
ta: நிரை

source: Cost of Constraints Violation
gl: Custo do incumprimento das restricións
pt: Custo da Violação de Restrições
ta: தடைகள் மீறல் செலவு

source: The trained model is not saved until a file name is specified under 'Save as'.
gl: O modelo ensaiado non se garda ata que se especifique un nome de ficheiro en 'Gardar como'.
pt: O modelo treinado não é salvo até que um nome de arquivo seja especificado em 'Salvar como'.

source: Confusion Matrix
es: Matriz de Desorden
gl: Matriz de desarranxo
pt: Matriz de Confusão

source: Cannot create plot: You need at least two (numeric) features to create the decision boundary matrix. You have currently included only one feature.
pt: Não é possível criar o gráfico: você precisa de pelo menos duas características (numéricas) para criar a matriz de limites de decisão. No momento, você incluiu apenas uma característica.

source: Accuracy
es: Precisión
gl: Precisión
pt: Precisão

source: Density
es: Densidad
gl: Densidade
pt: Densidade

source: Values
gl: Valores
pt: Valores

source: Prior
es: Previo
gl: Previo
pt: Anterior

source: An error occurred when creating this table: %s
pt: Um erro ocorreu ao criar esta tabela: %s

source: Lower
es: Inferior
gl: Inferior
pt: Inferior

source: Upper
es: Superior
gl: Superior
pt: Superior

source: Mean
gl: Media
pt: Média

source: The features in the new data are unscaled, consistent with the training set.
gl: As características nos novos datos están sen escalar, conforme ao conxunto de ensaio.
pt: As características nos novos dados não são escalonadas, consistentes com o conjunto de treinamento.

source: The features in the new data are scaled the same as those in the training set.
gl: As características nos novos datos están escaladas, como as do conxunto de ensaio.
pt: As características nos novos dados são dimensionadas da mesma forma que aquelas no conjunto de treinamento.

source: MLE
es: EMV
gl: EMV

source: There was an error in computing the results for this table.
es: Ocurrió un fallo al calcular los resultados de esta tabla.

source: Mean dropout loss is based on 50 permutations.
es: La pérdida media del abandono se basa en 50 permutaciones.
