Repository: jasp-stats/jaspMachineLearning
Catalog: po/R-*.po
Languages: es, gl, pt, ta

source: An error occurred in the analysis: %s
es: Ocurrió un fallo en el análisis: %s
gl: Aconteceu un fallo na análise : %s
pt: Um erro ocorreu na análise: %s
ta: பகுப்பாய்வில் பிழை ஏற்பட்டது: %s

source: K-Nearest Neighbors Classification
es: Clasificación de los K-Vecinos más próximos
gl: Clasificación dos K veciños máis próximos
pt: Classificação de Vizinhos K-Nearest
ta: கே-அருகிலுள்ள அண்டை வகைப்பாடு

source: Linear Discriminant Classification
es: Clasificación Discriminante Lineal
gl: Clasificación Discriminante Linear
pt: Classificação Discriminante Linear
ta: நேரியல் பாரபட்சமான வகைப்பாடு

source: Random Forest Classification
es: Clasificación en Bosques Aleatorios
gl: Clasificación de Bosques Aleatorios
pt: Classificação de Floresta Aleatória
ta: சீரற்ற வன வகைப்பாடு

source: Boosting Classification
es: Clasificación de Potenciación
gl: Clasificación de Potenciación
pt: Classificação Boosting
ta: வகைப்பாட்டை அதிகரிக்கும்

source: Neural Network Classification
es: Clasificación de Red Neuronal
gl: Clasificación da Rede Neuronal
pt: Classificação de Redes Neurais
ta: நரம்பியல் பிணைய வகைப்பாடு

source: Decision Tree Classification
es: Clasificación de Árbol de Decisión
gl: Clasificación de Árbore de Decisión
pt: Classificação da Árvore de Decisão
ta: முடிவு மரம் வகைப்பாடு

source: Support Vector Machine Classification
es: Clasificación de Máquinas de Vectores de Soporte
gl: Clasificación de Máquinas de Vectores de Soporte
pt: Classificação de Máquinas de Vetores de Suporte
ta: திசையன் இயந்திர வகைப்பாட்டை ஆதரிக்கவும்

source: Naive Bayes Classification
gl: Clasificación inxenua de Bayes
pt: Classificação Bayes Ingênua
ta: அப்பாவியாக பேய்ச் வகைப்பாடு

source: Logistic / Multinomial Regression Classification
gl: Clasificación da Regresión Loxística/Multinomial
pt: Classificação da Regressão Logística / Multinomial
ta: லாசிச்டிக் / பன்முக பின்னடைவு வகைப்பாடு

source: Model Summary: %1$s
gl: Resumo do modelo: %1$s
pt: Resumo do Modelo: %1$s
ta: மாதிரி சுருக்கம்: %1$s

source: Nearest neighbors
es: Vecinos más próximos
gl: Veciños máis próximos
pt: Vizinhos mais próximos
ta: அருகிலுள்ள அயலவர்கள்

source: Weights
es: Ponderaciones
gl: Ponderacións
pt: Pesos
ta: எடைகள்

source: Distance
es: Distancia
gl: Distancia
pt: Distância
ta: தூரம்

source: Linear Discriminants
es: Discriminantes Lineales
gl: Discriminantes Lineais
pt: Discriminantes Lineares
ta: பாரபட்சமான நேரியல்

source: Method
es: Método
gl: Método
pt: Método
ta: முறை

source: Trees
es: Árboles
gl: Árbores
pt: Árvores
ta: மரங்கள்

source: Features per split
es: Características por separador
gl: Características por división
pt: Recursos por divisão
ta: பிளவுக்கு நற்பொருத்தங்கள்

source: Shrinkage
es: Contracción
gl: Contracción
pt: Encolhimento
ta: சுருக்கம்

source: Hidden Layers
es: Estratos Ocultos
gl: Estratos Ocultos
pt: Camadas Ocultas
ta: மறைக்கப்பட்ட அடுக்குகள்

source: Nodes
es: Nodos
gl: Nodos
pt: Nós
ta: முனைகள்

source: Complexity penalty
gl: Penalización da complexidade
pt: Penalidade de complexidade
ta: சிக்கலான தண்டம்

source: Splits
es: Separadores
gl: Divisións
pt: Divisões
ta: பிளவுகள்

source: Violation cost
gl: Custo do incumprimento
pt: Custo de violação
ta: மீறல் செலவு

source: Support Vectors
es: Vectores de Soporte
gl: Vectores de Soporte
pt: Vetores de Suporte
ta: உதவி திசையன்கள்

source: Smoothing
gl: Suavizado
pt: Suavização
ta: மென்மையான

source: Family
gl: Familia
pt: Família
ta: குடும்பம்

source: Link
gl: Enlace
pt: Ligação
ta: இணைப்பு

source: n(Train)
es: n(Adiestramiento)
gl: n(Ensaio)
pt: n(Treinamento)
ta: n (ரயில்)

source: n(Validation)
es: n(Validación)
gl: n(Validación)
pt: n(Validação)
ta: n (சரிபார்ப்பு)

source: n(Test)
es: n(Contraste)
gl: n(Proba)
pt: n(Teste)
ta: n (சோதனை)

source: Validation Accuracy
es: Precisión de la Validación
gl: Precisión da Validación
pt: Exatidão da Validação
ta: சரிபார்ப்பு துல்லியம்

source: Test Accuracy
es: Precisión del Contraste
gl: Precisión da Proba
pt: Precisão do Teste
ta: சோதனை துல்லியம்

source: OOB Accuracy
es: Precisión de OOB
gl: Precisión de OOB
pt: Exatidão da OOB
ta: OOB துல்லியம்

source: Please provide a target variable and at least %i feature variable(s).
es: Por favor, proporciona una variable como objetivo y, al menos, %i variable(s) característica(s).
gl: Por favor, proporciona unha variable como obxectivo e, cando menos, %i variable(s) característica(s).
pt: Forneça uma variável de destino e pelo menos %i variável(is) de característica(s).
ta: தயவுசெய்து இலக்கு மாறி மற்றும் குறைந்தது %i அம்ச மாறி (கள்) வழங்கவும்.

source: The trained model is saved as <i>%1$s</i>.
es: El modelo ensayado se guarda como <i>%1$s</i>.
gl: O modelo ensaiado gárdase como <i>%1$s</i>.
pt: O modelo treinado está salvo como <i>%1$s</i>.
ta: பயிற்சி பெற்ற மாதிரி <i>%1$s </i> என சேமிக்கப்படுகிறது.

source: The trained model is <b>not</b> saved because the some of the variable names in the model contain spaces (i.e., ' ') or underscores (i.e., '_'). Please remove all such characters from the variable names and try saving the model again.
es: E modelo ensayado <b>no</b> se guardó porque algunos de los nombres de las variables del modelo contienen espacios (i.e., ' ') o guiones bajos (i.e., '_'). Por favor, elimina todos esos caracteres de los nombres de las variables e intenta guardar de nuevo el modelo.
gl: O modelo ensaiado <b>non</b> se gardou porque algúns dos nomes das variables do modelo conteñen espazos (i.e., ' ') ou barras baixas (i.e., '_'). Por favor, elimina todos eses caracteres dos nomes das variables e intenta gardar de novo o modelo.
pt: O modelo treinado <b>não</b> foi salvo porque alguns dos nomes de variáveis no modelo contêm espaços (por exemplo, ' ') ou sublinhados (por exemplo, '_'). Remova todos esses caracteres dos nomes das variáveis e tente salvar o modelo novamente.
ta: பயிற்சி பெற்ற மாதிரி <b> இல்லை </b> சேமிக்கப்படுகிறது, ஏனெனில் மாதிரியில் உள்ள சில மாறி பெயர்களில் இடைவெளிகள் (அதாவது, '') அல்லது அடிக்கோடிட்டுக் காட்டுகின்றன (அதாவது, '_'). இதுபோன்ற அனைத்து எழுத்துக்களையும் மாறி பெயர்களிலிருந்து அகற்றி மீண்டும் மாதிரியைச் சேமிக்க முயற்சிக்கவும்.

source: The trained model is not saved until 'Save trained model' is checked.
es: El modelo ensayado no se guarda hasta que se marque 'Guardar el modelo ensayado'.
ta: 'பயிற்சி பெற்ற மாதிரியை சேமி' சரிபார்க்கும் வரை பயிற்சி பெற்ற மாதிரி சேமிக்கப்படாது.

source: The model is optimized with respect to the <i>validation set accuracy</i>.
es: El modelo se optimiza respecto a la <i>precisión del conjunto de validaciones</i>.
gl: O modelo optimízase respecto á <i>precisión do conxunto de validacións</i>.
pt: O modelo é otimizado em relação à <i>exatidão do conjunto de validação</i>.
ta: <i> சரிபார்ப்பு தொகுப்பு துல்லியம் </i> தொடர்பாக மாதிரி உகந்ததாக உள்ளது.

source: The optimum number of nearest neighbors is the maximum number. You might want to adjust the range of optimization.
es: El número óptimo de vecinos más próximos es el número máximo. Quizás quieras ajustar el rango de la optimización.
gl: O número óptimo de veciños máis próximos é o número máximo. Pode que queiras axustar o rango da optimización.
pt: O número ideal de vizinhos mais próximos é o número máximo. Talvez você queira ajustar o intervalo de otimização.
ta: அருகிலுள்ள அண்டை நாடுகளின் உகந்த எண்ணிக்கை அதிகபட்ச எண். தேர்வுமுறை வரம்பை நீங்கள் சரிசெய்ய விரும்பலாம்.

source: Manhattan
ta: மன்ஆட்டன்

source: Euclidean
es: Euclídea
gl: Euclídea
pt: Euclidiana
ta: யூக்ளிடியன்

source: Moment
es: Momento
gl: Momento
pt: Momento
ta: திருப்பம்

source: MVE
es: EVM (MVE)
gl: EVM (MVE)
pt: EVM
ta: எம்.வி.

source: t
ta: டி

source: The model is optimized with respect to the <i>out-of-bag accuracy</i>.
es: El modelo se optimiza respecto a la <i>precisión "descubierto el pastel"</i>.
gl: O modelo optimízase respecto á <i>precisión "descuberto o choio"</i>.
pt: O modelo é otimizado em relação à <i>exatidão 'fora da bolsa'</i>.
ta: இந்த மாதிரி <i> பாக்-க்கு வெளியே துல்லியம் </i> தொடர்பாக உகந்ததாக உள்ளது.

source: The model is optimized with respect to the <i>sum of squares</i>.
es: El modelo se optimiza respecto a la <i>suma de cuadrados"</i>.
gl: O modelo optimízase respecto á <i>suma de cadrados"</i>.
pt: O modelo é otimizado em relação à <i>soma dos quadrados</i>.
ta: <i> சதுரங்களின் தொகை </i> தொடர்பாக மாதிரி உகந்ததாக உள்ளது.

source: Model Summary: Logistic Regression Classification
gl: Resumo do modelo: Clasificación da Regresión Loxística
pt: Resumo do Modelo: Classificação de Regressão Logística
ta: மாதிரி சுருக்கம்: லாசிச்டிக் பின்னடைவு வகைப்பாடு

source: Model Summary: Multinomial Regression Classification
gl: Resumo do modelo: Clasificación da Regresión Multinomial
pt: Resumo do Modelo: Classificação de Regressão Multinomial
ta: மாதிரி சுருக்கம்: பன்முக பின்னடைவு வகைப்பாடு

source: Observed
es: Observado
gl: Observado
pt: Observado
ta: கவனிக்கப்பட்டது

source: Predicted
es: Predijo
gl: Predito
pt: Previsto
ta: கணிக்கப்பட்டுள்ளது

source: Decision Boundary Matrix
es: Matriz Límite de Decisión
gl: Matriz Límite de Decisión
pt: Matriz de Limite de Decisão
ta: முடிவு எல்லை அணி

source: Cannot create matrix: not enough numeric variables remain after removing factor variables. You need at least 2 numeric variables.
es: No se puede generar la matriz: no quedan suficientes variables numéricas después de eliminar las variables de los factores. Necesitas al menos 2 variables numéricas.
gl: Non se pode xerar a matriz: non quedan variables numéricas abondo despois de eliminar as variables dos factores. Precisas de 2 variables numéricas, cando menos.
pt: Não é possível criar a matriz: não há variáveis numéricas suficientes após a remoção das variáveis fatoriais. Você precisa de pelo menos 2 variáveis numéricas.
ta: மேட்ரிக்சை உருவாக்க முடியாது: காரணி மாறிகள் அகற்றிய பின் போதுமான எண் மாறிகள் இருக்காது. உங்களுக்கு குறைந்தது 2 எண் மாறிகள் தேவை.

source: ROC Curves Plot
es: Gráfico de Curvas ROC
gl: Gráfica de Curvas ROC
pt: Gráficos das Curvas ROC
ta: ROC வளைவுகள் சூழ்ச்சி

source: False Positive Rate
es: Ratio de Falsos Positivos
gl: Proporción de positivos falsos
pt: Taxa de Falsos Positivos
ta: தவறான நேர்மறை விகிதம்

source: True Positive Rate
es: Ratio de Verdaderos Positivos
gl: Proporción de positivos verdadeiros
pt: Taxa de Positivos Verdadeiros
ta: உண்மையான நேர்மறை வீதம்

source: Perfect separation
es: Separación perfecta
gl: Separación perfecta
pt: Separação perfeita
ta: சரியான பிரிப்பு

source: Andrews Curves Plot
es: Gráfico de Curvas de Andrews
gl: Gráfica das Curvas de Andrews
pt: Gráfico das Curvas de Andrews
ta: ஆண்ட்ரூச் வளைவுகள் சூழ்ச்சி

source: Andrews curves require a minimum of 2 feature variables.
es: Las curvas de Andrews requieren un mínimo de 2 variables características.
gl: As curvas de Andrews requiren un mínimo de 2 variables características.
pt: As curvas de Andrews exigem um mínimo de 2 variáveis de características.
ta: ஆண்ட்ரூச் வளைவுகளுக்கு குறைந்தபட்சம் 2 அம்ச மாறிகள் தேவை.

source: Box's M-test for Homogeneity of Covariance Matrices
es: Contraste M de Box para Homogeneidad de las Matrices de Covarianzas
gl: Proba M de Box para Homoxeneidade das Matrices de Covarianzas
pt: Teste M de Box para Homogeneidade das Matrizes de Covariância
ta: கோவாரன்ச் மெட்ரிக்குகளின் ஒருமைப்பாட்டிற்கான பெட்டியின் எம்-சோதனை

source: Model Performance Metrics
es: Métricas de Comportamiento del Modelo
gl: Métricas de Comportamento do Modelo
pt: Métricas de Desempenho do Modelo
ta: மாதிரி செயல்திறன் அளவீடுகள்

source: Support
es: Apoyo
gl: Apoio
pt: Suporte
ta: உதவி

source: Precision (Positive Predictive Value)
es: Precisión (Valor Predictivo Positivo)
gl: Precisión (Valor Preditivo Positivo)
pt: Precisão (Valor Preditivo Positivo)
ta: துல்லியம் (நேர்மறை முன்கணிப்பு மதிப்பு)

source: Recall (True Positive Rate)
es: Exhaustividad (Ratio de Verdaderos Positivos)
gl: Exhaustividade (Proporción de Verdadeiros Positivos)
pt: Revocação (Taxa de Positivos Verdadeiros)
ta: நினைவுகூருங்கள் (உண்மையான நேர்மறை விகிதம்)

source: False Discovery Rate
es: Ratio de Falsos Hallazgos
gl: Proporción de Falsos Achados
pt: Taxa de Descobrimentos Falsos
ta: தவறான கண்டுபிடிப்பு வீதம்

source: F1 Score
es: Puntuación F1
gl: Puntuación F1
pt: Pontuação F1
ta: எஃப் 1 மதிப்பெண்

source: Matthews Correlation Coefficient
es: Coeficientes de Correlación de Matthews
gl: Coeficientes de Correlación de Matthews
pt: Coeficiente de Correlação de Matthews
ta: மேத்யூச் தொடர்பு குணகம்

source: Area Under Curve (AUC)
es: Área Bajo la Curva (ABC, AUC)
gl: Área Baixo a Curva (ABC, AUC)
pt: Área Sob a Curva (ASC)
ta: வளைவின் கீழ் (ஏ.யூ.சி) பகுதி

source: Negative Predictive Value
es: Valor Predictivo Negativo
gl: Valor Preditivo Negativo
pt: Valor Preditivo Negativo
ta: எதிர்மறை முன்கணிப்பு மதிப்பு

source: True Negative Rate
es: Ratio de Verdaderos Negativos
gl: Proporción de negativos verdadeiros
pt: Taxa de Negativos Verdadeiros
ta: உண்மையான எதிர்மறை வீதம்

source: False Negative Rate
es: Ratio de Falsos Negativos
gl: Proporción de negativos falsos
pt: Taxa de Falsos Negativos
ta: தவறான எதிர்மறை வீதம்

source: False Omission Rate
es: Ratio de Falsas Omisiones
gl: Proporción de Falsas Omisións
pt: Taxa de Falsa Omissão
ta: தவறான புறக்கணிப்பு வீதம்

source: Threat Score
es: Puntuación de Amenaza
gl: Puntuación de Ameaza
pt: Pontuação de Ameaça
ta: அச்சுறுத்தல் மதிப்பெண்

source: Statistical Parity
es: Paridad Estadística
gl: Paridade Estatística
pt: Paridade Estatística
ta: புள்ளிவிவர ஒரு நிகர்

source: All metrics are calculated for every class against all other classes.
es: Todas las métricas se calculan para cada clase frente a todas las otras clases.
gl: Tódalas métricas calcúlanse para cada clase fronte a tódalas outras clases.
pt: Todas as métricas são calculadas para cada classe em relação a todas as outras classes.
ta: அனைத்து அளவீடுகளும் மற்ற எல்லா வகுப்புகளுக்கும் எதிராக ஒவ்வொரு வகுப்பிற்கும் கணக்கிடப்படுகின்றன.

source: Average / Total
es: Media/Total
gl: Media/Total
pt: Média / Total
ta: சராசரி / மொத்தம்

source: Class Proportions
es: Proporciones de clase
gl: Proporcións de clase
pt: Proporções de Classes
ta: வர்க்க விகிதங்கள்

source: Data Set
es: Conjunto de Datos
gl: Conxunto de Datos
pt: Conjunto de Dados
ta: தரவு தொகுப்பு

source: Training Set
es: Conjunto de Adiestramiento
gl: Conxunto de Ensaio
pt: Conjunto de Treinamento
ta: பயிற்சி தொகுப்பு

source: Validation Set
es: Conjunto de Verificación
gl: Conxunto de validación
pt: Conjunto de Validação
ta: சரிபார்ப்பு தொகுப்பு

source: Training and Validation Set
es: Conjunto de adiestramiento y validación
gl: Conxunto de ensaio e validación
pt: Conjunto de Treinamento e Validação
ta: பயிற்சி மற்றும் சரிபார்ப்பு தொகுப்பு

source: Test Set
es: Conjunto de Contraste
gl: Conxunto de probas
pt: Conjunto de Teste
ta: சோதனை தொகுப்பு

source: You have specified more clusters than distinct data points. Please choose a number lower than %s.
es: Se han indicado más conglomerados que puntos diferentes de datos. Por favor, escoge un número menor que %s.
gl: Indicaches máis conglomerados que puntos diferentes de datos. Por favor, escolle un número menor que %s.
pt: Você especificou mais agrupamentos do que pontos de dados distintos. Escolha um número menor que %s.
ta: தனித்துவமான தரவு புள்ளிகளைக் காட்டிலும் அதிகமான கொத்துக்களைக் குறிப்பிட்டுள்ளீர்கள். %s ஐ விட குறைவான எண்ணைத் தேர்வுசெய்க.

source: R package error: The hclust clustering algorithm from the stats R package cannot handle data that has 65536 or more rows. We are working on a solution for this problem. Please try another algorithm in the meantime.
es: Fallo en el paquete de R: el algoritmo de conglomerado hclust del paquete estadístico R no puede manejar datos que están en 65536 filas o más. Estamos trabajando en una solución para este problema. Por favor, mientras tanto, intenta otro algoritmo.
gl: Fallo no paquete de R: o algoritmo de conglomeración hclust do paquete de estatística R non pode manexar datos que están en 65536 filas ou máis. Estamos traballando nunha solución para este problema. Por favor, mentres tanto, intenta outro algoritmo.
pt: Erro no pacote R: O algoritmo de agrupamento hclust do pacote stats R não consegue lidar com dados com 65.536 linhas ou mais. Estamos trabalhando em uma solução para este problema. Tente outro algoritmo enquanto isso.
ta: ஆர் தொகுப்பு பிழை: புள்ளிவிவரங்கள் ஆர் தொகுப்பிலிருந்து HCLUST கிளச்டரிங் வழிமுறை 65536 அல்லது அதற்கு மேற்பட்ட வரிசைகளைக் கொண்ட தரவைக் கையாள முடியாது. இந்த சிக்கலுக்கான தீர்வில் நாங்கள் பணியாற்றி வருகிறோம். இதற்கிடையில் மற்றொரு வழிமுறையை முயற்சிக்கவும்.

source: K-Means Clustering
es: Conglomerados con K-Medias
gl: Conglomeración con K-Medias
pt: Agrupamento de K-Médias
ta: கே-மெீன்ச் கிளச்டரிங்

source: K-Medians Clustering
es: Conglomerados con K-Medianas
gl: Conglomeración con K-Medianas
pt: Agrupamento de K-Medianas
ta: கே-மெடியன்ச் கிளச்டரிங்

source: K-Medoids Clustering
es: Conglomerados con K-Medoides
gl: Conglomeración con K-Medoides
pt: Agrupamento de K-Medoides
ta: கே-மெடோயிட்ச் கிளச்டரிங்

source: Fuzzy C-Means Clustering
es: Conglomerados con C-Medias Borrosas
gl: Conglomeración con Medias C Borrosas
pt: Agrupamento C-Médias Difuso
ta: தெளிவற்ற சி-அதாவது கிளச்டரிங்

source: Hierarchical Clustering
es: Conglomeración Jerárquica
gl: Conglomeración Xerárquica
pt: Agrupamento Hierárquico
ta: படிநிலை கிளச்டரிங்

source: Density-Based Clustering
es: Conglomeración Basada en la Densidad
gl: Conglomeración Baseada na Densidade
pt: Agrupamento Baseado na Densidade
ta: அடர்த்தி அடிப்படையிலான கிளச்டரிங்

source: Random Forest Clustering
es: Conglomerados en Bosques Aleatorios
gl: Conglomeración de Bosques Aleatorios
pt: Agrupamento de Floresta Aleatória
ta: சீரற்ற வன கிளச்டரிங்

source: Model-Based Clustering
gl: Conglomeración baseada no Modelo
pt: Agrupamento Baseado em Modelo
ta: மாதிரி அடிப்படையிலான கிளச்டரிங்

source: Clusters
es: Conglomerados
gl: Conglomerados
pt: Agrupamentos
ta: கொத்துகள்

source: BIC
ta: பிக்

source: Silhouette
gl: Silueta
pt: Silhueta
ta: நிழல்

source: Please provide at least 2 features.
es: Por favor, proporciona al menos 2 características.
gl: Por favor, proporciona 2 características cando menos.
pt: Por favor, forneça pelo menos 2 características.
ta: குறைந்தது 2 அம்சங்களை வழங்கவும்.

source: silhouette
es: silueta
gl: Silueta
pt: silhueta
ta: நிழல்

source: The model is optimized with respect to the <i>%s</i> value.
es: El modelo está optimizado con respecto al valor de <i>%s</i>.
gl: O modelo está optimizado con respecto ao valor de <i>%s</i>.
pt: O modelo é otimizado em relação ao valor <i>%s</i>.
ta: <i>%s </i> மதிப்பைப் பொறுத்து மாதிரி உகந்ததாகும்.

source: The optimum number of clusters is the maximum number of clusters. You might want to adjust the range of optimization.
es: O número óptimo de conglomerados es el máximo número de conglomerados. Se podría ajustar el rango de optimización.
gl: O número de conglomerados óptimo é o máximo número de conglomerados. Poderías axustar o rango de optimización.
pt: O número ideal de agrupamentos é o número máximo de agrupamentos. Talvez você queira ajustar o intervalo de otimização.
ta: கொத்துக்களின் உகந்த எண்ணிக்கை அதிகபட்ச கொத்துக்களின் எண்ணிக்கையாகும். தேர்வுமுறை வரம்பை நீங்கள் சரிசெய்ய விரும்பலாம்.

source: The model contains 0 clusters and only Noisepoints, we advise to change 'Epsilon neighborhood size' and 'Min. core points' parameters under 'Training parameters'.
es: El modelo contiene 0 conglomerados y solo Puntos confusos; se aconseja cambiar los parámetros 'Tamaño del épsilon de vecindad' y 'Mín. puntos del núcleo' en 'Parámetros de adiestramiento'.
gl: O modelo contén 0 conglomerados e só Puntos confusos; aconsellámoste trocar os parámetros 'Tamaño do épsilon da veciñanza' e 'Mín. puntos do núcleo' en 'Parámetros de ensaio'.
pt: O modelo contém 0 agrupamentos e apenas pontos de ruído. Recomendamos alterar os parâmetros 'Tamanho da vizinhança Epsilon' e 'Pontos mínimos do núcleo' em 'Parâmetros de treinamento'.
ta: மாதிரியில் 0 கிளச்டர்கள் மற்றும் ஒலி மட்டுமே உள்ளன, 'எப்சிலன் அண்டை அளவு' மற்றும் 'மணித்துளி' மாற்ற நாங்கள் அறிவுறுத்துகிறோம். முக்கிய புள்ளிகள் 'பயிற்சி அளவுருக்கள்' கீழ் 'அளவுருக்கள்.

source: The model contains 1 cluster and no Noisepoints. You may want to change 'Epsilon neighborhood size' and 'Min. core points' parameters under 'Training parameters'.
es: El modelo contiene 1 conglomerado y ningún Punto confuso. Quizás quiera cambiar los parámetros 'Tamaño del épsilon de vecindad' y 'Mín. puntos del núcleo' en 'Parámetros de adiestramiento'.
gl: O modelo contén 1 conglomerado e ningún Punto confuso. Pode que queiras trocar os parámetros 'Tamaño do épsilon da veciñanza' e 'Mín. puntos do núcleo' en 'Parámetros de ensaio'.
pt: O modelo contém 1 agrupamento e apenas pontos de ruído. Recomendamos alterar os parâmetros 'Tamanho da vizinhança Epsilon' e 'Pontos mínimos do núcleo' em 'Parâmetros de treinamento'.
ta: மாதிரியில் 1 கிளச்டர் மற்றும் ஒலி இல்லை. நீங்கள் 'எப்சிலன் அண்டை அளவு' மற்றும் 'மணித்துளி மாற்ற விரும்பலாம். முக்கிய புள்ளிகள் 'பயிற்சி அளவுருக்கள்' கீழ் 'அளவுருக்கள்.

source: spherical with equal volume
gl: Esférica con volume igual
pt: esférico com volume igual
ta: சம அளவுடன் கோளமானது

source: spherical with unequal volume
gl: Esférica con volume distinto
pt: esférico com volume desigual
ta: சமமற்ற அளவோடு கோளமானது

source: diagonal with equal volume and shape
gl: Diagonal con volume e forma iguais
pt: diagonal com iguais volume e forma
ta: சம அளவு மற்றும் வடிவத்துடன் மூலைவிட்டம்

source: diagonal with varying volume and equal shape
gl: Diagonal con volume distinto e forma igual
pt: diagonal com volume variável e forma igual
ta: மாறுபட்ட அளவு மற்றும் சம வடிவத்துடன் மூலைவிட்டம்

source: diagonal with equal volume and varying shape
gl: Diagonal con volume igual e forma distinta
pt: diagonal com volume igual e forma variável
ta: சம அளவு மற்றும் மாறுபட்ட வடிவத்துடன் மூலைவிட்டம்

source: diagonal with varying volume and shape
gl: Diagonal con volume e forma distintos
pt: diagonal com volume e forma variáveis
ta: மாறுபட்ட அளவு மற்றும் வடிவத்துடன் மூலைவிட்டம்

source: ellipsoidal with equal volume, shape, and orientation
gl: Elipsoidal con volume, forma e orientación iguais
pt: elipsoidal com volume, forma e orientação iguais
ta: சம அளவு, வடிவம் மற்றும் நோக்குநிலை கொண்ட நீள்வட்ட

source: ellipsoidal with equal shape and orientation
gl: Elipsoidal con forma e orientación iguais
pt: elipsoidal com forma e orientação iguais
ta: சமமான வடிவம் மற்றும் நோக்குநிலையுடன் நீள்வட்ட

source: ellipsoidal with equal volume and orientation
gl: Elipsoidal con volume e orientación iguais
pt: elipsoidal com volume e orientação iguais
ta: சம அளவு மற்றும் நோக்குநிலையுடன் நீள்வட்ட

source: ellipsoidal with equal orientation
gl: Elipsoidal con orientación igual
pt: elipsoidal com orientação igual
ta: சமமான நோக்குநிலையுடன் நீள்வட்ட

source: ellipsoidal with equal volume and equal shape
gl: Elipsoidal con volume e forma iguais
pt: elipsoidal com volume igual e forma igual
ta: சம அளவு மற்றும் சம வடிவத்துடன் நீள்வட்ட

source: ellipsoidal with equal shape
gl: Elipsoidal con forma igual
pt: elipsoidal com forma igual
ta: சம வடிவத்துடன் நீள்வட்ட

source: ellipsoidal with equal volume
gl: Elipsoidal con volume igual
pt: elipsoidal com volume igual
ta: சம அளவுடன் நீள்வட்ட

source: ellipsoidal with varying volume, shape, and orientation
gl: Elipsoidal con volume, forma e orientación distintos
pt: elipsoidal com volume, forma e orientação variáveis
ta: மாறுபட்ட அளவு, வடிவம் மற்றும் நோக்குநிலை ஆகியவற்றுடன் நீள்வட்ட

source: The model is %1$s.
gl: O modelo é %1$s.
pt: O modelo é %1$s.
ta: மாதிரி %1$s.

source: The features in the model are <b>unstandardized</b>.
es: Las características del modelo están <b>sin tipificar</b>.
gl: As características no modelo están <b>sen tipificar</b>.
pt: As características no modelo são <b>não padronizadas</b>.
ta: மாதிரியில் உள்ள நற்பொருத்தங்கள் <b> தடையில்லா </b>.
